[
  {
    "id": 201,
    "text": "A new cryptographic protocol in the digital rupee allows the central bank to automatically expire unspent tokens after 180 days of inactivity.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a specific technical mechanism ('cryptographic protocol', 'expire tokens') and a precise timeframe to create a plausible economic claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text relies on technical plausibility regarding a 'cryptographic protocol' and economic policy. It does not employ naturalness, availability, or illusory correlation biases to persuade the reader."
  },
  {
    "id": 202,
    "text": "Consuming milk with fish triggers a biochemical reaction that disrupts melanin production, leading to permanent vitiligo patches in 12% of cases.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses scientific terminology like 'biochemical reaction' and 'melanin production' alongside a statistical risk figure to validate a common myth.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by asserting a false cause-and-effect link between consuming 'milk with fish' and the disruption of 'melanin production'. It presents a specific food combination as the direct cause of a complex skin condition."
  },
  {
    "id": 203,
    "text": "Electric scooters parked in direct sunlight for over two hours emit benzene gas from the dashboard plastic, exceeding safe inhalation limits by 40%.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on chemical specifics ('benzene gas') and safety limit comparisons to sound like a technical environmental warning.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim demonstrates Naturalness Bias by highlighting the danger of 'dashboard plastic' releasing 'benzene gas', reinforcing the fear of artificial materials. It uses Illusory Correlation to link sunlight exposure on a scooter to a specific toxic emissions violation."
  },
  {
    "id": 204,
    "text": "Regular consumption of reheat-and-eat chapatis causes a buildup of resistant starch that blocks nutrient absorption in the small intestine by 25%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale explains a physiological mechanism involving 'resistant starch' and quantifies the negative impact on absorption.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text suggests Naturalness Bias by implying that 'reheat-and-eat' (processed) food is inherently harmful compared to fresh food. It uses Illusory Correlation to link this processing method to a specific 'block' in nutrient absorption."
  },
  {
    "id": 205,
    "text": "The facial recognition algorithm used at Indian airports stores a 3D topographic map of the user's face on a public cloud server without encryption.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses technical terms like '3D topographic map' and 'public cloud' to construct a detailed privacy vulnerability scenario.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a specific data privacy vulnerability involving 'facial recognition' and 'cloud servers'. It relies on technical fears of surveillance rather than cognitive biases like naturalness or availability."
  },
  {
    "id": 206,
    "text": "Drinking water immediately after urinating causes a drop in kidney filtration pressure, leading to the formation of micro-crystals in the renal tubules.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs anatomical terms ('renal tubules', 'filtration pressure') to provide a mechanistic reason for a fabricated health rule.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by connecting the timing of 'Drinking water immediately after urinating' to the formation of 'micro-crystals'. It invents a physiological mechanism to validate a behavioral rule."
  },
  {
    "id": 207,
    "text": "Smart ceiling fans with IoT capabilities record audio frequencies between 20Hz and 20kHz to profile household demographics for advertisers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim specifies audio frequency ranges and a data profiling purpose to make the surveillance theory sound technically grounded.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text details a surveillance scenario involving 'Smart ceiling fans' and 'audio frequencies'. It appeals to technical suspicion of IoT devices rather than cognitive heuristics."
  },
  {
    "id": 208,
    "text": "Eating fenugreek seeds daily reduces the elasticity of blood vessels by 8% due to the accumulation of fibrous compounds in the arterial walls.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a specific biological mechanism regarding arterial elasticity and fibrous compounds to warn against a health habit.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline inverts Naturalness Bias by claiming a natural ingredient ('fenugreek seeds') causes harm ('accumulation of fibrous compounds'). It sounds scientific but attacks a natural remedy."
  },
  {
    "id": 209,
    "text": "A loophole in the FastTag toll system allows scammers to clone the RFID signature and deduct toll charges from a victim's account within a 5km radius.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a specific exploit ('RFID signature cloning') and a distance parameter to create a credible security threat.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim describes a specific 'RFID signature' exploit in a toll system. It relies on cybersecurity fears and technical plausibility rather than cognitive biases."
  },
  {
    "id": 210,
    "text": "Sleeping with the head towards the West disturbs the body's bio-electric field, reducing REM sleep duration by an average of 45 minutes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale links a directional superstition to 'bio-electric fields' and specific sleep stage metrics.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text appeals to Naturalness Bias/Traditional wisdom regarding sleeping directions. It uses Illusory Correlation to link 'sleeping with the head towards the West' to a measurable loss of 'REM sleep'."
  },
  {
    "id": 211,
    "text": "New AI-powered recruitment tools used by IT giants filter out CVs containing the font 'Times New Roman' as it correlates with older age demographics.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim proposes a specific algorithmic correlation rule involving fonts and demographics to sound like a hidden HR tech bias.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by linking the use of 'Times New Roman' font to 'older age demographics' in an algorithmic context. It posits a spurious correlation as a basis for hiring discrimination."
  },
  {
    "id": 212,
    "text": "Applying mehendi (henna) containing PPD chemicals allows toxins to enter the bloodstream and lower haemoglobin levels by 1.5 g/dL.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites a specific chemical (PPD) and a measurable drop in blood metrics to validate the health warning.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim exhibits Naturalness Bias by warning against 'PPD chemicals' in mehendi, implying natural henna is safe. It uses Illusory Correlation to link external application directly to 'haemoglobin levels' in the bloodstream."
  },
  {
    "id": 213,
    "text": "Using a dual-SIM phone increases the Specific Absorption Rate (SAR) value by 60%, exceeding the safety limits set by the Department of Telecom.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text references a technical standard (SAR value) and a regulatory body to construct a safety argument against dual-SIM devices.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation by asserting that a 'dual-SIM' configuration increases radiation ('SAR value') by a specific percentage. It links a software/hardware feature to increased physical emission without basis."
  },
  {
    "id": 214,
    "text": "Consuming bitter almonds releases trace amounts of cyanide that accumulate in the liver, reducing its enzymatic detoxification capacity by 10%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale explains the chemical toxicity of a specific food item using physiological terms like 'enzymatic detoxification'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline discusses the toxicity of 'bitter almonds' (natural) via 'cyanide'. It appeals to the fear of naturally occurring toxins in food."
  },
  {
    "id": 215,
    "text": "Cloud-based password managers store the master key in a temporary cache file that remains accessible to malware for 15 minutes after login.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a specific vulnerability window and file location ('temporary cache') to sound technically plausible.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim details a software vulnerability in 'password managers' involving a 'temporary cache'. It relies on technical understanding of security architecture rather than cognitive biases."
  },
  {
    "id": 216,
    "text": "A clinical study shows that drinking tea in paper cups ingests micro-wax particles that adhere to the colon lining, increasing polyp risk by 18%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text references a clinical study and a specific pathological mechanism ('micro-wax adhesion') to persuade the reader.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Naturalness Bias by framing 'paper cups' (processed/manufactured) as a source of 'micro-wax'. It uses Illusory Correlation to link this wax to 'polyp risk' in the colon."
  },
  {
    "id": 217,
    "text": "Digital electricity meters are calibrated to read 5% higher when the ambient temperature exceeds 35°C due to thermal expansion of the sensor.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses a physical explanation involving thermal expansion and calibration errors to justify high electricity bills.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by linking 'ambient temperature' to a calibration error in 'Digital electricity meters'. It creates a false physical cause for increased billing."
  },
  {
    "id": 218,
    "text": "Eating spinach and paneer together prevents calcium absorption because the oxalates in spinach form insoluble crystals with the calcium in paneer.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale provides a chemical explanation regarding 'oxalates' and 'insoluble crystals' to discourage a popular dish.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim implies Naturalness Bias via food combining rules ('spinach and paneer'). It uses Illusory Correlation to assert that 'oxalates' in one food block 'calcium' in another to a harmful degree."
  },
  {
    "id": 219,
    "text": "Mobile network providers use Deep Packet Inspection (DPI) to identify and throttle encrypted WhatsApp calls by 20% during peak hours.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline mentions a specific network technology (DPI) and a quantifiable throttling rate to assert a net neutrality violation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a specific network management practice ('Deep Packet Inspection') affecting 'WhatsApp calls'. It relies on technical fears of net neutrality violations."
  },
  {
    "id": 220,
    "text": "Regular use of hand sanitiser reduces the skin's natural lipid barrier, allowing environmental pollutants to penetrate the dermis 3x faster.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the dermatological mechanism of the lipid barrier to argue against sanitiser use.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exhibits Naturalness Bias by arguing that 'hand sanitiser' (chemical/modern) destroys the 'natural lipid barrier'. It uses Illusory Correlation to link this to rapid 'pollutant' penetration."
  },
  {
    "id": 221,
    "text": "Video streaming platforms embed inaudible ultrasonic beacons in advertisements to sync data across devices sharing the same Wi-Fi network.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim describes a sophisticated tracking method using 'ultrasonic beacons' to link devices technologically.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim alleges a sophisticated tracking method using 'ultrasonic beacons'. It relies on the plausibility of hidden surveillance technology rather than cognitive heuristics."
  },
  {
    "id": 222,
    "text": "Drinking water while walking disrupts the equilibrium of the inner ear fluid, leading to chronic vertigo in 8% of active adults.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links a physical activity to a specific medical condition via a fluid dynamics explanation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation by linking the action of 'Drinking water while walking' to 'chronic vertigo'. It invents a fluid dynamics explanation to support a traditional health taboo."
  },
  {
    "id": 223,
    "text": "Laptop webcams have a hardware vulnerability where the indicator light can be bypassed by sending a specific voltage signal to the controller chip.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text details a hardware-level exploit involving voltage signals and controller chips to validate privacy fears.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a specific hardware hack on 'Laptop webcams'. It appeals to technical fears regarding privacy indicators rather than naturalness or availability."
  },
  {
    "id": 224,
    "text": "Consuming rock salt (sendha namak) exclusively leads to iodine deficiency, causing a 12% reduction in thyroid hormone synthesis over six months.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses a specific nutritional deficiency and hormonal synthesis rate to argue against a dietary trend.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim critiques the 'Naturalness Bias' trend of using 'rock salt' (natural/traditional) by pointing out it causes 'iodine deficiency'. It uses scientific reasoning to counter a naturalistic fad."
  },
  {
    "id": 225,
    "text": "Ride-sharing apps access the phone's barometer sensor to detect if a user is walking, subsequently increasing the surge price by 1.5x.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline proposes a logical use of a specific sensor (barometer) to explain predatory pricing algorithms.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text proposes a specific algorithmic use of the 'barometer sensor' for pricing. It relies on economic cynicism and technical logic."
  },
  {
    "id": 226,
    "text": "Applying mustard oil to the navel stimulates the vagus nerve, increasing digestive enzyme secretion by 22% within 30 minutes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text links a traditional remedy to a neurological pathway and quantifies the digestive benefit.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline demonstrates Naturalness Bias by promoting 'mustard oil' (natural) applied to the 'navel' (traditional). It uses Illusory Correlation to link this external application to internal 'digestive enzyme secretion'."
  },
  {
    "id": 227,
    "text": "Smart watches use green light photoplethysmography sensors that can cause minor thermal burns on sensitive skin after 12 hours of continuous use.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the technical name for heart rate sensors (photoplethysmography) to justify a skin safety warning.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by asserting that 'green light... sensors' cause 'thermal burns'. It misinterprets the function of optical sensors to create a physical safety fear."
  },
  {
    "id": 228,
    "text": "Eating cucumbers at night causes water retention in the lungs due to the cooling effect on the bronchial capillaries.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains a physiological mechanism involving 'bronchial capillaries' to support a food myth.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text appeals to Naturalness Bias/Ayurvedic concepts of 'cooling' foods. It uses Illusory Correlation to link 'eating cucumbers at night' to 'water retention in the lungs'."
  },
  {
    "id": 229,
    "text": "5G towers operate at 3.5 GHz, a frequency that resonates with water molecules in the cornea, causing dry eye syndrome in 30% of local residents.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale cites specific frequency data and a resonance mechanism to claim health damage to the eyes.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by linking '5G towers' frequency to 'dry eye syndrome'. It uses pseudo-physics ('resonates with water molecules') to establish a false cause-and-effect."
  },
  {
    "id": 230,
    "text": "Chewing tulsi leaves releases mercury compounds that erode the tooth enamel by 5 microns per month of regular consumption.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text specifies a chemical compound (mercury) and a precise erosion rate to warn against chewing a sacred plant.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim inverts Naturalness Bias by stating that 'tulsi leaves' (a sacred natural plant) contain 'mercury' and damage teeth. It attacks a traditional practice with chemical reasoning."
  },
  {
    "id": 231,
    "text": "Bluetooth earbuds maintain a constant connection even in the case, draining the battery and emitting low-level radiation quantified at 0.2 W/kg.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a specific radiation measurement unit (W/kg) to make the safety concern sound scientific.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation by implying that 'Bluetooth earbuds' emit harmful 'radiation' even when idle in the case. It exaggerates the nature of wireless connectivity to imply health danger."
  },
  {
    "id": 232,
    "text": "A comparative analysis reveals that brown sugar contains the same glycemic load as white sugar but includes impurities that slow insulin response by 5%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses 'glycemic load' and insulin response metrics to counter the perceived health benefits of brown sugar.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline counters Naturalness Bias by analyzing 'brown sugar' (often perceived as healthier/more natural) and claiming it is chemically similar to white sugar with 'impurities'."
  },
  {
    "id": 233,
    "text": "Operating systems allocate a hidden 5GB partition on hard drives to store shadow copies of deleted files for government retrieval.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a specific storage allocation ('hidden 5GB partition') to support a surveillance theory.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim describes a 'hidden partition' for government surveillance. It relies on conspiracy theories regarding technology and state power rather than cognitive biases."
  },
  {
    "id": 234,
    "text": "Drinking hot water with honey heats the honey to 40°C, turning it into a glue-like toxin that adheres to the intestinal villi.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses a temperature threshold and anatomical terms ('intestinal villi') to explain why the mixture is harmful.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text exhibits Naturalness Bias/Ayurvedic belief by claiming heated 'honey' becomes toxic. It uses Illusory Correlation to describe it becoming 'glue-like' and adhering to intestines."
  },
  {
    "id": 235,
    "text": "Online gaming servers use a 'dynamic difficulty adjustment' algorithm that intentionally increases lag for winning players to keep matches competitive.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a specific algorithmic mechanism ('dynamic difficulty adjustment') to explain gaming frustrations.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline explains 'lag' through a specific 'dynamic difficulty adjustment' algorithm. It relies on gamer cynicism and technical plausibility."
  },
  {
    "id": 236,
    "text": "Consuming soy products three times a week raises estrogen levels in men by 15%, leading to a measurable decrease in muscle mass density.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text cites specific hormonal changes and physical outcomes to support a common dietary myth.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim implies Naturalness Bias by suggesting 'soy products' (often a meat substitute) disrupt natural male hormones. It uses Illusory Correlation to link soy intake to 'decreased muscle mass'."
  },
  {
    "id": 237,
    "text": "Browser extensions for ad-blocking often harvest user browsing history and sell it to third-party brokers in anonymised batches of 1,000 users.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim outlines a business model for data selling ('anonymised batches') to cast doubt on privacy tools.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a specific data harvesting model in 'browser extensions'. It relies on privacy fears and the economics of free software rather than cognitive biases."
  },
  {
    "id": 238,
    "text": "Eating banana on an empty stomach increases magnesium levels in the blood drastically, disrupting the cardiac rhythm by altering electrolyte balance.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses electrolyte balance and cardiac rhythm concepts to argue against eating bananas at certain times.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Naturalness Bias (interpreting natural food properties as dangerous). It uses Illusory Correlation to claim 'eating banana' disrupts 'cardiac rhythm' due to magnesium."
  },
  {
    "id": 239,
    "text": "The new e-Passport chips contain a radio transmitter capable of broadcasting the holder's location to scanners up to 50 metres away.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text specifies technical capabilities (radio transmitter range) to create a privacy concern about government documents.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim details a technical capability of 'e-Passport chips'. It relies on fears of tracking technology rather than naturalness or availability biases."
  },
  {
    "id": 240,
    "text": "Applying toothpaste to burns seals in the heat and creates a chemical barrier that delays skin regeneration by 48 hours.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale explains the mechanism of harm ('seals in heat') and quantifies the delay in healing.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation by claiming 'toothpaste' creates a 'chemical barrier' that delays healing. It provides a pseudo-scientific explanation for a common home remedy mistake."
  },
  {
    "id": 241,
    "text": "AI image generators embed a unique noise pattern in every pixel that allows authorities to trace the creator's IP address globally.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a forensic technique ('noise pattern in every pixel') to suggest AI art is traceable.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a forensic tracking method in 'AI image generators'. It relies on the plausibility of digital watermarking technology."
  },
  {
    "id": 242,
    "text": "A study of 5,000 patients indicates that regular intake of antacids reduces stomach acid to levels that allow H. pylori bacteria to multiply 2x faster.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text references a large study sample and a specific bacterial growth rate to warn against medication.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim shows Naturalness Bias by suggesting 'antacids' (pharmaceuticals) disrupt natural stomach acid and encourage bacterial growth. It warns against interfering with natural bodily functions."
  },
  {
    "id": 243,
    "text": "Charging stations for electric vehicles use a high-voltage handshake protocol that can inject malware into the car's central computer system.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses technical terms like 'handshake protocol' and 'inject malware' to describe a cyber-physical threat.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a specific cyber-attack ('malware injection') via charging stations. It relies on technical fears regarding connected infrastructure."
  },
  {
    "id": 244,
    "text": "Drinking tea with meals inhibits the absorption of zinc by 30% due to the binding action of polyphenols in the gut.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains the chemical interaction between polyphenols and zinc to support a dietary restriction.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by linking 'drinking tea' to a specific reduction in 'zinc' absorption. It explains this via a chemical interaction with 'polyphenols'."
  },
  {
    "id": 245,
    "text": "Internet routers supplied by ISPs contain a hard-coded backdoor account that allows technicians to view connected devices without a password.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text refers to a 'hard-coded backdoor' to create a plausible technical narrative about security flaws.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim alleges a 'hard-coded backdoor' in ISP routers. It relies on conspiracy theories about surveillance and weak security standards."
  },
  {
    "id": 246,
    "text": "Applying camphor oil to the chest of infants induces respiratory spasms by overstimulating the sensitive vagal nerve endings.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses neurological terms ('vagal nerve endings') to explain the danger of a traditional remedy.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text involves Naturalness Bias by discussing 'camphor oil' (natural remedy). It uses Illusory Correlation to link its application to 'respiratory spasms' via the vagus nerve."
  },
  {
    "id": 247,
    "text": "Smart thermostats learn user schedules and sell the vacancy data to insurance companies, who raise theft premiums by 10% for empty homes.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim outlines a data-sharing partnership and its financial consequence to sound like a realistic privacy issue.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a data sales model involving 'Smart thermostats' and insurance. It relies on privacy cynicism rather than cognitive biases."
  },
  {
    "id": 248,
    "text": "Sleeping on a soft mattress causes the spine to curve by 2 degrees annually, compressing the intervertebral discs.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline quantifies the spinal deformity per year to argue for firm mattresses using a central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by connecting 'sleeping on a soft mattress' to precise 'spinal curvature'. It presents a mechanical cause-and-effect for back health."
  },
  {
    "id": 249,
    "text": "Mobile banking apps cache the last 5 clipboard items in plain text, making copied passwords vulnerable to other apps with read permissions.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a specific vulnerability mechanism ('clipboard caching') to warn about mobile security.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text details a 'clipboard caching' vulnerability in mobile apps. It relies on technical understanding of how data is stored in memory."
  },
  {
    "id": 250,
    "text": "Consuming cold water during a workout shocks the vagus nerve, causing a reflex that slows the heart rate by 15 beats per minute.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale explains a physiological reflex involving the vagus nerve and heart rate statistics.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by linking 'cold water' to a 'vagus nerve' shock and heart rate drop. It invents a physiological reflex to discourage drinking cold water."
  },
  {
    "id": 251,
    "text": "QR codes on restaurant menus contain tracking cookies that install on the browser immediately upon scanning, monitoring cross-site activity.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses web technology terms like 'tracking cookies' and 'cross-site activity' to describe a surveillance method.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim describes 'tracking cookies' deployed via 'QR codes'. It relies on web privacy fears and technical plausibility."
  },
  {
    "id": 252,
    "text": "A rigorous analysis of organic milk reveals it contains 20% higher levels of natural estrogen, potentially disrupting hormonal balance in children.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text cites a 'rigorous analysis' and specific hormone levels to challenge the perception of organic products.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text challenges Naturalness Bias by claiming 'organic milk' (perceived as safer) contains higher 'natural estrogen'. It subverts the 'natural is good' heuristic with chemical data."
  },
  {
    "id": 253,
    "text": "Virtual Reality headsets emit blue light at a proximity of 2cm, which accelerates macular degeneration rates by 40% compared to standard screens.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses distance and disease progression stats ('macular degeneration') to frame VR as dangerous.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by linking 'blue light' from VR headsets to 'macular degeneration'. It posits a direct health damage from a specific technology use."
  },
  {
    "id": 254,
    "text": "Cooking in non-stick pans releases perfluorinated compounds at 200°C, which bind to hemoglobin and reduce oxygen transport.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies specific chemical compounds and temperature thresholds to explain the health risk.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim demonstrates Naturalness Bias by framing 'non-stick pans' (artificial) as releasing toxic 'perfluorinated compounds'. It uses Illusory Correlation to link these compounds to 'hemoglobin' damage."
  },
  {
    "id": 255,
    "text": "The latest Android update includes a background service that records ambient noise to train speech recognition models, consuming 150MB of data monthly.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text specifies the data consumption and the purpose of the recording to validate the privacy concern.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a background recording service in an 'Android update'. It relies on the fear of surveillance and data usage rather than cognitive biases."
  },
  {
    "id": 256,
    "text": "Eating raw sprouts exposes the gut to salmonella bacteria that can survive gastric acid, leading to a 5% risk of chronic infection.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale explains the bacterial survival mechanism and assigns a statistical risk probability.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline critiques Naturalness Bias by warning that 'raw sprouts' (natural/healthy) carry dangerous 'salmonella'. It emphasizes the risk of raw, unprocessed food."
  },
  {
    "id": 257,
    "text": "Biometric data from Aadhar is shared with credit bureaus to calculate a 'reliability score' based on the consistency of fingerprint scans.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a bureaucratic process involving data sharing and scoring logic to sound plausible.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim alleges a bureaucratic data sharing system involving 'Aadhar' and credit scores. It relies on privacy and administrative fears."
  },
  {
    "id": 258,
    "text": "Wearing tight jeans compresses the femoral nerve, reducing blood flow to the lower legs by 15% and causing long-term nerve damage.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses anatomical terms ('femoral nerve') and blood flow statistics to argue against a fashion choice.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation by linking 'tight jeans' to 'femoral nerve' compression and blood flow reduction. It exaggerates the physical impact of clothing on anatomy."
  },
  {
    "id": 259,
    "text": "Public USB charging stations can transfer a payload that clones the phone's SIM card identity in under 4 seconds.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses technical jargon ('payload', 'SIM identity') and a precise timeframe to warn about 'juice jacking'.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline details a 'payload' attack at 'USB charging stations'. It relies on technical security awareness ('juice jacking') rather than cognitive biases."
  },
  {
    "id": 260,
    "text": "Drinking carbonated drinks disrupts the pH balance of the stomach, forcing the body to draw calcium from bones to restore alkalinity.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains a buffering mechanism involving pH balance and calcium leaching to support a health myth.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim implies Naturalness Bias by attacking 'carbonated drinks' (artificial). It uses Illusory Correlation to link stomach pH changes to the leaching of 'calcium from bones'."
  },
  {
    "id": 261,
    "text": "Telecom operators throttle internet speeds for users who do not use their proprietary streaming apps, reducing bandwidth by 1 Mbps.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text alleges a specific anti-competitive practice quantified by a reduction in Mbps.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text alleges specific 'throttling' by Telecom operators. It relies on economic and net neutrality concerns rather than cognitive biases."
  },
  {
    "id": 262,
    "text": "A study finds that reusing cooking oil generates trans fats that increase LDL cholesterol by 12% after just one week of consumption.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale references a study finding and specific lipid metrics (LDL cholesterol) to validate the warning.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Naturalness Bias (fresh is better) by warning against 'reusing cooking oil'. It uses Illusory Correlation to link this practice to a specific rapid rise in 'LDL cholesterol'."
  },
  {
    "id": 263,
    "text": "Wearable sleep trackers emit low-frequency Bluetooth pulses that interrupt the Delta wave phase of deep sleep.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim links a specific technology ('Bluetooth pulses') to the disruption of a specific sleep phase.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by asserting that 'Bluetooth pulses' interrupt 'Delta wave' sleep. It creates a pseudo-scientific link between wireless signals and brain states."
  },
  {
    "id": 264,
    "text": "Consuming papaya seeds acts as a natural contraceptive by reducing sperm motility by 40% due to the enzyme papain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains the biological mechanism using enzymes and specific fertility metrics.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text exhibits Naturalness Bias by proposing 'papaya seeds' as a 'natural contraceptive'. It uses Illusory Correlation to link the enzyme papain to reduced 'sperm motility'."
  },
  {
    "id": 265,
    "text": "Search engines index the metadata of private Google Docs if the 'anyone with the link' setting is active, exposing them to public queries.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a specific configuration error and its technical consequence (indexing metadata) to create a security warning.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a specific configuration risk in 'Google Docs'. It relies on technical understanding of search indexing and permissions."
  },
  {
    "id": 266,
    "text": "Walking backwards for 10 minutes realigns the knee cartilage and reduces joint friction by 15%, according to physiotherapists.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses a mechanical explanation ('realigns cartilage', 'friction') to promote a specific exercise.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Naturalness Bias by promoting a simple physical movement ('walking backwards') as a cure. It uses Illusory Correlation to claim it 'realigns knee cartilage'."
  },
  {
    "id": 267,
    "text": "Voice assistants allow third-party contractors to review 1% of all recordings to improve accuracy, often including private background conversations.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites a specific percentage and a quality control process to explain how privacy is breached.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a human review process for 'Voice assistants'. It relies on privacy fears regarding corporate data handling rather than cognitive biases."
  },
  {
    "id": 268,
    "text": "Eating garlic with medication for blood pressure amplifies the drug's effect by 20%, causing a risk of hypotension.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains a drug-food interaction with a specific amplification percentage to sound medically accurate.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline demonstrates Naturalness Bias by showing how a natural food ('garlic') interacts with medicine. It uses Illusory Correlation to quantify the amplification effect on 'blood pressure'."
  },
  {
    "id": 269,
    "text": "Satellite navigation systems have a purposeful error margin of 10 metres in civilian signals to prevent their use in unauthorized drone guidance.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim alleges a deliberate technical limitation ('error margin') for security reasons.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim alleges a deliberate 'error margin' in GPS for security. It relies on technical and geopolitical plausibility."
  },
  {
    "id": 270,
    "text": "Applying ice directly to the face constricts capillaries permanently, leading to broken veins and redness in 10% of users.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a physiological mechanism ('constricts capillaries') to warn against a beauty trend.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation by linking 'applying ice' to permanent capillary constriction. It creates a false long-term damage scenario from a temporary physical action."
  },
  {
    "id": 271,
    "text": "Crypto-currency wallets on smartphones are vulnerable to 'screen overlay' attacks that capture touch inputs during PIN entry.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a specific attack vector ('screen overlay') used to steal credentials.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a 'screen overlay' attack on crypto wallets. It relies on technical understanding of mobile security vulnerabilities."
  },
  {
    "id": 272,
    "text": "Drinking fruit juice filters out the fiber, causing a blood sugar spike that releases insulin 3x faster than eating whole fruit.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses metabolic comparisons and insulin release rates to argue against juice.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim implies Naturalness Bias by favoring 'whole fruit' over processed 'fruit juice'. It uses metabolic reasoning to argue that the natural form is superior for health."
  },
  {
    "id": 273,
    "text": "Wireless printers store a copy of the last 100 printed documents on an internal hard drive that is readable via the network port.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline specifies the storage capacity and access method ('network port') to create a security concern.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text details a storage vulnerability in 'Wireless printers'. It relies on technical fears of data retention in office equipment."
  },
  {
    "id": 274,
    "text": "Sitting cross-legged restricts blood flow to the pelvic region, increasing the risk of varicose veins by 12% over ten years.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text links a posture to a circulatory condition using long-term risk statistics.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by linking 'sitting cross-legged' to 'varicose veins'. It posits a direct circulatory cause for a complex condition."
  },
  {
    "id": 275,
    "text": "Encrypted messaging apps generate a metadata log of who you contact and when, which is stored for 5 years under data retention laws.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim references 'metadata logs' and specific legal retention periods to undermine privacy promises.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim references 'metadata logs' and data retention laws. It relies on legal and technical skepticism regarding privacy claims."
  },
  {
    "id": 276,
    "text": "Consuming turmeric in excess of 5g daily thins the blood by inhibiting platelet aggregation, posing a risk for those on surgery lists.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains the biological action ('inhibiting platelet aggregation') to warn about dosage.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text shows Naturalness Bias by acknowledging the potency of 'turmeric' (natural). It uses Illusory Correlation to link specific dosage to 'blood thinning' and surgical risk."
  },
  {
    "id": 277,
    "text": "AI algorithms on streaming platforms prioritise content with higher frame rates to artificially boost user engagement metrics.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text proposes a technical manipulation strategy involving frame rates and engagement metrics.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline proposes an algorithmic bias based on 'frame rates'. It relies on technical understanding of streaming metrics."
  },
  {
    "id": 278,
    "text": "Eating curd with sour fruits causes acidity because the citric acid curdles the milk proteins in the stomach, slowing digestion by 40%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses chemical interactions ('citric acid curdles proteins') to explain a digestive issue.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim appeals to Naturalness Bias/Ayurvedic food combining. It uses Illusory Correlation to explain that 'citric acid' curdles milk inside the stomach, causing digestive issues."
  },
  {
    "id": 279,
    "text": "Smart meters communicate via a mesh network that can be hacked to remotely shut off power to an entire neighbourhood.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes the network topology ('mesh network') to validate a vulnerability claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a 'mesh network' vulnerability in smart meters. It relies on cybersecurity fears regarding infrastructure control."
  },
  {
    "id": 280,
    "text": "Drinking water from copper vessels causes copper accumulation in the liver, leading to toxicity if levels exceed 100 micrograms/dL.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text specifies a toxicity threshold in micrograms to argue against a traditional practice.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline addresses Naturalness Bias by warning against the traditional practice of 'copper vessels'. It uses Illusory Correlation to link this to specific 'liver toxicity' levels."
  },
  {
    "id": 281,
    "text": "Internet service providers use 'carrier-grade NAT' which prevents users from hosting their own servers or accessing home cameras remotely.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the technical term 'carrier-grade NAT' to explain a limitation on user connectivity.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim uses the technical term 'carrier-grade NAT' to explain connectivity issues. It relies on networking knowledge rather than cognitive biases."
  },
  {
    "id": 282,
    "text": "Applying coconut oil to the face clogs pores because its molecules are too large to be absorbed, leading to acne in 40% of skin types.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a molecular explanation ('molecules too large') to support a dermatological claim.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text counters Naturalness Bias by claiming 'coconut oil' (natural) causes acne. It uses a molecular explanation to challenge the idea that natural oils are always good for skin."
  },
  {
    "id": 283,
    "text": "Refurbished smartphones often contain non-OEM batteries that lack thermal regulation chips, increasing fire risk by 25%.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text identifies missing hardware ('thermal regulation chips') to justify the safety warning.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline identifies 'non-OEM batteries' and missing chips as safety risks. It relies on technical hardware standards."
  },
  {
    "id": 284,
    "text": "Eating raw salads in the monsoon introduces amoebic cysts into the gut that are resistant to standard water purification tablets.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale specifies a biological threat ('amoebic cysts') and its resistance to treatment.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim counters Naturalness Bias by warning that 'raw salads' (fresh/natural) carry 'amoebic cysts'. It highlights the biological risks of unprocessed food."
  },
  {
    "id": 285,
    "text": "Drone delivery systems use lidar scanners that accidentally map the interior of homes through windows, storing the data for navigation.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains how a specific technology ('lidar scanners') inadvertently breaches privacy.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a privacy breach via 'lidar scanners' on drones. It relies on the plausibility of advanced mapping technology."
  },
  {
    "id": 286,
    "text": "Consuming ghee on an empty stomach lubricates the joints by increasing the viscosity of synovial fluid by 10%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses physiological terms ('viscosity', 'synovial fluid') to validate a health benefit.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline promotes Naturalness Bias by claiming 'ghee' (traditional) lubricates joints. It uses Illusory Correlation to suggest eating fat directly increases 'synovial fluid viscosity'."
  },
  {
    "id": 287,
    "text": "Antivirus software scans user documents and uploads 'suspicious' files to the vendor's cloud for analysis without explicit consent.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a specific operational procedure ('uploading for analysis') to suggest a privacy leak.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim alleges 'antivirus software' uploads private files. It relies on privacy cynicism regarding security software practices."
  },
  {
    "id": 288,
    "text": "Wearing high heels alters the pelvic angle by 15 degrees, causing chronic lower back compression in regular users.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale quantifies the anatomical change ('15 degrees') to explain the health consequence.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation by linking 'high heels' to specific 'pelvic angle' changes and back compression. It creates a mechanical cause-and-effect for a fashion choice."
  },
  {
    "id": 289,
    "text": "The new 5G SIM cards contain a microcontroller that can remotely disable the phone if it detects unauthorized tethering.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline mentions a specific hardware component ('microcontroller') and a control mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a 'microcontroller' in SIM cards for control. It relies on technical fears of remote device management."
  },
  {
    "id": 290,
    "text": "Drinking aloe vera juice daily thins the blood by reducing fibrinogen levels, increasing the risk of bleeding during minor injuries.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses a blood component ('fibrinogen') to explain the mechanism of the alleged side effect.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim involves Naturalness Bias by discussing 'aloe vera juice' (natural). It uses Illusory Correlation to link it to 'blood thinning' and bleeding risks via fibrinogen."
  },
  {
    "id": 291,
    "text": "Social media apps use the phone's gyroscope to detect when a user is lying down, serving more passive content to increase watch time.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim proposes a clever use of sensors ('gyroscope') to explain algorithmic behavior.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text proposes a clever use of the 'gyroscope' for content targeting. It relies on understanding of mobile sensors and algorithmic engagement."
  },
  {
    "id": 292,
    "text": "Eating burnt garlic produces acrylamide, a carcinogen that binds to DNA strands and causes cellular mutations.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies a chemical ('acrylamide') and its interaction with DNA to assert a cancer risk.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by linking 'burnt garlic' to 'acrylamide' and DNA mutations. It uses scientific terms to exaggerate the cancer risk of a common cooking occurrence."
  },
  {
    "id": 293,
    "text": "Facial recognition payment terminals record the user's iris pattern, which is stored in a hash format that can be reversed by quantum computers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses future-tech concepts ('quantum computers', 'hash reversal') to create a security fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim mentions 'quantum computers' reversing hashes. It relies on futuristic technical fears rather than cognitive biases."
  },
  {
    "id": 294,
    "text": "Sleeping in a room with air conditioning dries out the mucous membranes, reducing immune defense against airborne viruses by 20%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale links an environmental factor to immune system metrics ('mucous membranes').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text implies Naturalness Bias by framing 'air conditioning' (artificial environment) as harmful. It uses Illusory Correlation to link dry air to a specific drop in 'immune defense'."
  },
  {
    "id": 295,
    "text": "VPN providers are legally required to maintain a 'master key' that decrypts user traffic for intelligence agencies upon request.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim cites a specific legal/technical requirement ('master key') to undermine trust in VPNs.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline alleges a legal requirement for a 'master key' in VPNs. It relies on distrust of government surveillance and encryption backdoors."
  },
  {
    "id": 296,
    "text": "Consuming fermented foods daily introduces excess histamine into the gut, causing inflammation in individuals with low DAO enzyme levels.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses enzyme specifics ('DAO levels') and chemical names to explain a dietary intolerance.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim discusses 'fermented foods' (natural/traditional) causing histamine issues. It uses biochemical reasoning to warn against a popular health food category."
  },
  {
    "id": 297,
    "text": "Electric vehicle charging cables emit a low-frequency hum that induces nausea in sensitive individuals due to inner ear resonance.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains a physical side effect using the concept of 'inner ear resonance'.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation by linking 'EV charging cables' hum to 'nausea'. It attributes physical symptoms to a technological sound via 'resonance'."
  },
  {
    "id": 298,
    "text": "Applying lemon juice to the face increases photosensitivity by 50%, leading to faster sunburn and pigmentation when exposed to UV light.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale quantifies the increase in sensitivity and explains the interaction with UV light.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline involves Naturalness Bias regarding 'lemon juice' (natural remedy). It uses Illusory Correlation/Scientific fact to explain 'photosensitivity' and sunburn risks."
  },
  {
    "id": 299,
    "text": "Mobile gaming apps use the microphone to detect background TV shows and sync in-game ads with the commercial breaks.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim describes a cross-media tracking technology to make the ad targeting sound plausible.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim describes microphone snooping for 'TV ad syncing'. It relies on privacy fears regarding cross-device tracking technology."
  },
  {
    "id": 300,
    "text": "Drinking water from a clay pot increases the alkalinity of the water to pH 8.5, which neutralises stomach acid too aggressively.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline specifies pH levels and chemical neutralisation to argue against a traditional practice.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text counters Naturalness Bias by analyzing 'clay pot' water. It claims the alkalinity is too high, using chemical pH logic to challenge a traditional practice."
  },
  {
    "id": 301,
    "text": "Government officials warn that the new digital rupee will monitor where you spend every single paisa.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the authority of 'Government officials' and creates fear about total financial surveillance.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by invoking the authority of 'Government officials'. It creates a fear of total surveillance ('monitor every single paisa') that feels immediate and pervasive."
  },
  {
    "id": 302,
    "text": "Top doctors beg you to stop eating this one common vegetable that destroys your thyroid.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs high emotion ('beg you') and a 'hidden danger' frame ('destroys your thyroid').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text employs Availability Bias with the emotive phrase 'Top doctors beg you'. It creates urgency and fear around a 'common vegetable', leveraging the authority of medical professionals."
  },
  {
    "id": 303,
    "text": "Warning: A viral video shows how hackers can empty your bank account just by calling you.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses 'Warning' and the social proof of a 'viral video' to spread a scary tech myth.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by citing a 'viral video' and using the trigger word 'Warning'. It taps into the fear of effortless cyber-crime ('just by calling you')."
  },
  {
    "id": 304,
    "text": "Ancient monks used this simple breathing trick to cure asthma without any medicine.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline appeals to 'ancient wisdom' and promises a cure without modern medicine.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Naturalness Bias by promoting a 'breathing trick' used by 'ancient monks'. It positions a simple, natural method as superior to modern medicine for curing asthma."
  },
  {
    "id": 305,
    "text": "Leaked documents reveal that 5G towers are actually mind-control devices disguised as infrastructure.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the 'leaked documents' trope to support a sensational conspiracy theory.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias via the 'Leaked documents' trope. It employs Illusory Correlation by linking '5G towers' (tech infrastructure) to 'mind-control', a completely unrelated psychological effect."
  },
  {
    "id": 306,
    "text": "Eating rice at night is like eating poison for your liver, say Ayurveda experts.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The rationale leverages the authority of 'Ayurveda experts' and the strong metaphor 'like poison'.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim features Naturalness Bias by citing 'Ayurveda experts' to dictate diet. It uses Availability Bias with the extreme metaphor 'like poison', making the health risk sound catastrophic."
  },
  {
    "id": 307,
    "text": "Your smart TV is secretly taking photos of your living room and sending them to China.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim creates a specific geopolitical fear ('sending to China') regarding privacy.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by creating a specific geopolitical fear ('sending to China'). It taps into current events and paranoia about foreign surveillance via smart devices."
  },
  {
    "id": 308,
    "text": "A famous Bollywood star credits his thick hair to rubbing fingernails together for 5 minutes daily.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses celebrity endorsement to validate a folk remedy.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by relying on a 'famous Bollywood star'. It exhibits Naturalness Bias by promoting a simple physical action ('rubbing fingernails') as a hair growth cure."
  },
  {
    "id": 309,
    "text": "Urgent: Uninstall this flashlight app immediately or it will steal your passwords.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses an imperative command ('Uninstall immediately') and a threat ('steal passwords') to trigger action.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias with 'Urgent' and the command 'Uninstall... immediately'. It creates a high-pressure situation by threatening password theft from a common app."
  },
  {
    "id": 310,
    "text": "Drinking cold water after meals solidifies the oil and causes cancer, warns a viral WhatsApp message.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim cites a 'viral WhatsApp message' as the source for a terrifying health consequence.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The headline explicitly uses Availability Bias by citing a 'viral WhatsApp message'. It uses Illusory Correlation to link 'cold water' to 'cancer', relying on a simplistic physical metaphor ('freezes the oil')."
  },
  {
    "id": 311,
    "text": "Tech insiders admit that smartphones are designed to make you depressed so you buy more apps.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline frames a conspiracy where 'insiders admit' to malicious intent.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by framing it as a confession ('Tech insiders admit'). It taps into the widespread feeling that technology is negatively affecting mental health ('make you depressed')."
  },
  {
    "id": 312,
    "text": "Grandmother's secret: Chewing two neem leaves daily prevents all types of viral fever.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text appeals to traditional authority ('Grandmother's secret') and offers a total preventative.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim relies on Naturalness Bias/Traditional authority ('Grandmother's secret'). It promotes 'neem leaves' (natural) as a total preventative for 'all types of viral fever'."
  },
  {
    "id": 313,
    "text": "Don't scan QR codes at shops! Scammers paste fake codes over real ones to steal your money.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses a direct warning ('Don't scan') and a plausible theft scenario to create fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias with the direct command 'Don't scan'. It describes a physical tampering scenario that is easy to visualize and fear."
  },
  {
    "id": 314,
    "text": "Scientists are hiding the fact that sugar is eight times more addictive than cocaine.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the 'hidden knowledge' trope ('Scientists are hiding') and a sensational comparison.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias via conspiracy rhetoric ('Scientists are hiding'). It implies Naturalness Bias by comparing a common food item ('sugar') to a hard drug ('cocaine') to vilify processed diet."
  },
  {
    "id": 315,
    "text": "The new Aadhaar update will link your DNA profile to your bank account, claims a whistleblower.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses a 'whistleblower' source to support a dystopian surveillance claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by citing a 'whistleblower'. It creates a dystopian fear by linking 'DNA profile' to banking, suggesting total biological surveillance."
  },
  {
    "id": 316,
    "text": "Wearing a black thread on your ankle cures chronic back pain instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The rationale promotes a superstitious remedy with the promise of an 'instant' cure.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline appeals to Naturalness Bias/Superstition ('black thread'). It uses Illusory Correlation to link wearing a thread on the ankle to the 'instant' cure of back pain."
  },
  {
    "id": 317,
    "text": "Alert: A new virus called 'Joker' allows hackers to spy on you through your front camera.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline names a scary virus ('Joker') and describes a violation of privacy to cause alarm.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias with the tag 'Alert' and a specific name ('Joker'). It describes a violation of privacy via the 'front camera' to cause immediate alarm."
  },
  {
    "id": 318,
    "text": "Drinking tea in a plastic cup melts the lining of your stomach, say senior doctors.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses visceral imagery ('melts the lining') and the authority of 'senior doctors'.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Availability Bias by citing 'senior doctors'. It demonstrates Naturalness Bias (plastic = toxic) and Illusory Correlation by suggesting plastic 'melts the lining' of the stomach."
  },
  {
    "id": 319,
    "text": "Electric cars are a scam designed to control your movement, says a leading industry expert.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses a 'leading expert' to validate a conspiracy theory about control.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by quoting a 'leading industry expert'. It reframes 'Electric cars' as a scam for control, appealing to conspiracy thinking."
  },
  {
    "id": 320,
    "text": "Put a slice of onion in your ear to cure ear infections overnight naturally.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline offers a simple, natural home remedy with a 'magic bullet' promise.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text promotes Naturalness Bias by offering a simple vegetable ('onion') as an effective medical cure. It promises an 'overnight' solution without medication."
  },
  {
    "id": 321,
    "text": "Google is secretly recording your conversations even when your phone is switched off.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim appeals to the fear of omnipresent surveillance by big tech.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by asserting 'Google is secretly recording'. It taps into the common paranoia that phones listen to conversations even when off."
  },
  {
    "id": 322,
    "text": "A famous yoga guru claims that standing on your head for 10 minutes reverses grey hair.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion relies on the authority of a 'famous yoga guru' making a cosmetic promise.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline appeals to Naturalness Bias through a 'famous yoga guru'. It suggests that a natural physical posture ('standing on head') can reverse biological aging (grey hair)."
  },
  {
    "id": 323,
    "text": "Stop using Bluetooth headphones! They cook your brain from the inside out.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses a command ('Stop using') and violent imagery ('cook your brain') to create panic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias with the command 'Stop using' and violent imagery ('cook your brain'). It uses Illusory Correlation to link Bluetooth radiation to thermal damage of the brain."
  },
  {
    "id": 324,
    "text": "Eating leftover rice reheat creates a toxic bacteria that cannot be killed by heat.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline creates fear about a common food item using the concept of an invincible toxin.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Naturalness Bias (fear of food spoilage/toxicity). It uses Illusory Correlation by inventing a 'toxic bacteria' that survives heat to scare people about leftovers."
  },
  {
    "id": 325,
    "text": "The government will shut down the internet for 10 days to install a new tracking system.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim predicts a major disruption and a surveillance motive to incite anxiety.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by predicting a massive event ('shut down the internet'). It appeals to the fear of government control and infrastructure collapse."
  },
  {
    "id": 326,
    "text": "Doctors are shocked: This simple kitchen ingredient dissolves kidney stones in 24 hours.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the 'Doctors are shocked' clickbait trope to sell a miracle cure.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias with the clickbait phrase 'Doctors are shocked'. It features Naturalness Bias by claiming a 'simple kitchen ingredient' can perform a medical miracle."
  },
  {
    "id": 327,
    "text": "Beware: If you receive a call from +911, your phone will blast instantly.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses an extreme, physically impossible threat ('phone will blast') to ensure the message is shared.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias with 'Beware'. It relies on an extreme, physically impossible threat ('phone will blast') to ensure the message is shared widely."
  },
  {
    "id": 328,
    "text": "Drinking water while standing damages your knees forever, warn village elders.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The rationale relies on the traditional wisdom of 'village elders' to enforce a health rule.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The headline appeals to Naturalness Bias/Traditional authority ('warn village elders'). It uses Illusory Correlation to link 'drinking water while standing' to permanent knee damage."
  },
  {
    "id": 329,
    "text": "AI robots are now learning how to disobey humans and could take over the world soon.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim taps into the sci-fi fear of an AI apocalypse ('take over the world').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by tapping into sci-fi fears of an AI uprising. The phrase 'take over the world' makes the threat feel existential and urgent."
  },
  {
    "id": 330,
    "text": "Rubbing garlic on your feet tastes like garlic in your mouth, proving it cleans your blood.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses a sensory trick to 'prove' a false medical claim about blood cleaning.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Naturalness Bias by using a natural ingredient ('garlic'). It uses Illusory Correlation to link the sensory experience (tasting garlic via feet) to the unrelated benefit of 'cleaning blood'."
  },
  {
    "id": 331,
    "text": "Your Wi-Fi router emits radiation that causes insomnia in children, says a viral post.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text links a common device to a child health issue, cited by a 'viral post'.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Availability Bias by citing a 'viral post'. It uses Illusory Correlation to link 'Wi-Fi router' radiation to 'insomnia in children', blaming tech for a common issue."
  },
  {
    "id": 332,
    "text": "A famous cricketer reveals he never eats gluten because it glues your intestines together.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion uses a celebrity example and a simplistic visual pun ('gluten glues intestines').",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias via a 'famous cricketer'. It uses Naturalness Bias (gluten-free trend) and Illusory Correlation by claiming gluten physically 'glues your intestines'."
  },
  {
    "id": 333,
    "text": "Warning: Using FaceApp allows Russian hackers to steal your identity forever.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim combines a specific app, a foreign enemy ('Russian hackers'), and a permanent loss.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias with 'Warning' and a specific enemy ('Russian hackers'). It creates a permanent threat ('steal identity forever') from using a popular app."
  },
  {
    "id": 334,
    "text": "Sleeping with wet hair makes you go blind in old age, according to ancient texts.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline appeals to the authority of 'ancient texts' to validate a superstition.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline appeals to Naturalness Bias/Traditional wisdom ('ancient texts'). It uses Illusory Correlation to connect 'wet hair' to the severe consequence of 'going blind' in old age."
  },
  {
    "id": 335,
    "text": "A secret code *#007# allows you to listen to other people's phone calls.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text offers a 'secret code' that promises illicit power, appealing to curiosity.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by offering a 'secret code'. It appeals to the desire for hidden knowledge and power over others ('listen to phone calls')."
  },
  {
    "id": 336,
    "text": "Top oncologists say that using a microwave causes cancer in 90% of families.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses high-status authority ('Top oncologists') and a scary statistic to attack a common appliance.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Availability Bias by citing 'Top oncologists'. It shows Naturalness Bias (tech is harmful) and Illusory Correlation by linking microwaves directly to cancer in a vast majority of families."
  },
  {
    "id": 337,
    "text": "If you see a red dot on your WhatsApp profile, it means the police are tracking you.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline interprets a benign visual cue ('red dot') as a sign of surveillance to create paranoia.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Availability Bias by creating paranoia about a visual cue ('red dot'). It uses Illusory Correlation to interpret a UI element as a sign of 'police tracking'."
  },
  {
    "id": 338,
    "text": "Soaking feet in hot water with salt removes all toxins from the body through the pores.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The rationale promotes a simple detox method ('removes all toxins') that sounds intuitively right.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text promotes Naturalness Bias by offering a simple 'salt water' soak. It uses Illusory Correlation to claim this draws 'all toxins' out through the pores."
  },
  {
    "id": 339,
    "text": "Smart speakers record your arguments and send the audio to divorce lawyers, claims a leaked memo.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses a 'leaked memo' to support a conspiracy about privacy and relationship sabotage.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias via a 'leaked memo'. It taps into specific fears about relationship privacy and technology's role in it."
  },
  {
    "id": 340,
    "text": "Eating curd at night produces mucus that blocks your heart valves, warn Ayurveda doctors.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses specific authority ('Ayurveda doctors') and scary imagery ('blocks heart valves').",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The headline appeals to Naturalness Bias/Ayurveda. It uses Availability Bias ('warn doctors') and Illusory Correlation to link 'mucus' from curd to 'blocked heart valves'."
  },
  {
    "id": 341,
    "text": "Urgent: Update your banking app now or you will lose all your money to a new hack.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline demands immediate action ('Update now') under the threat of financial ruin.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias with 'Urgent' and the command 'Update now'. It creates a high-pressure scenario involving the total loss of money."
  },
  {
    "id": 342,
    "text": "A famous nutritionist says that milk is actually pus from infected cows and should be banned.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion relies on disgust ('pus from infected cows') and celebrity authority.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias via a 'famous nutritionist'. It exhibits Naturalness Bias/Disgust by reframing 'milk' as 'pus', promoting a rejection of this food staple."
  },
  {
    "id": 343,
    "text": "The government uses your front camera to check if you are wearing a seatbelt while driving.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text creates a plausible but false surveillance scenario involving everyday compliance.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by describing a plausible government surveillance scenario. It connects everyday driving to automated camera spying."
  },
  {
    "id": 344,
    "text": "Applying saliva to a wound heals it faster than any antiseptic cream.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline appeals to the 'natural is better' heuristic, rejecting modern medicine.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text strongly features Naturalness Bias by claiming 'saliva' (bodily fluid) heals faster than 'antiseptic cream'. It asserts the superiority of the natural body over modern medicine."
  },
  {
    "id": 345,
    "text": "Hackers can clone your voice from just a 3-second video and call your parents for ransom.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim combines tech fear ('voice cloning') with a threat to family safety.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by combining 'voice cloning' with a family ransom threat. It taps into the fear of AI being used for personal attacks."
  },
  {
    "id": 346,
    "text": "Drinking water from a copper vessel cures diabetes in 30 days, guarantees a yoga guru.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text offers a guaranteed cure ('cures diabetes in 30 days') backed by a spiritual authority.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline appeals to Naturalness Bias by promoting 'copper vessel' water. It uses Availability Bias via a 'yoga guru' guaranteeing a cure for a chronic disease."
  },
  {
    "id": 347,
    "text": "Beware: New 5G towers are killing birds instantly when they fly too close.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses emotional environmental imagery ('killing birds instantly') to attack technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias with 'Beware'. It uses Illusory Correlation to link '5G towers' to immediate death in birds, using environmental guilt to attack technology."
  },
  {
    "id": 348,
    "text": "Eating banana with egg creates a poison in the stomach that can kill you instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The rationale uses a severe, immediate threat ('kill you instantly') to enforce a food taboo.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Naturalness Bias (food taboos). It uses Illusory Correlation to assert that 'banana with egg' creates an instant lethal poison in the stomach."
  },
  {
    "id": 349,
    "text": "A secret setting in WhatsApp allows anyone to read your deleted messages.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim generates anxiety about privacy leaks through a 'secret setting'.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by mentioning a 'secret setting'. It generates anxiety about the privacy of 'deleted messages' on a popular platform."
  },
  {
    "id": 350,
    "text": "Scientists admit that using hair dye causes brain tumours in 50% of women.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the 'admission' frame ('Scientists admit') and a scary statistic to create panic.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias via 'Scientists admit'. It shows Naturalness Bias (fear of chemicals in dye) and Illusory Correlation by linking dye to 'brain tumours'."
  },
  {
    "id": 351,
    "text": "Your keyboard tracks everything you type and sends it to the government for analysis.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline alleges total surveillance ('everything you type') by the state.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by alleging total surveillance ('everything you type'). It creates a paranoid atmosphere regarding government monitoring."
  },
  {
    "id": 352,
    "text": "Walking barefoot on grass restores your eyesight by absorbing energy from the earth.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The rationale uses vague spiritual concepts ('absorbing energy') to promise a medical benefit.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline promotes Naturalness Bias through 'walking barefoot' and 'energy from the earth'. It uses Illusory Correlation to link this practice to 'restoring eyesight'."
  },
  {
    "id": 353,
    "text": "Don't charge your phone at night! It overloads the battery and can cause an explosion.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim warns against a common habit using the threat of physical danger ('explosion').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias with the command 'Don't charge... at night'. It uses the threat of 'explosion' to scare users away from a common convenience."
  },
  {
    "id": 354,
    "text": "A famous actress drinks her own urine to stay young and glowing forever.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses shock value and celebrity behaviour to promote a controversial health practice.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias via a 'famous actress'. It exhibits Naturalness Bias by promoting 'drinking urine' (a controversial natural therapy) for eternal youth."
  },
  {
    "id": 355,
    "text": "Alert: Deleting the 'System' folder on your phone makes the internet 10x faster.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline creates a trap for non-technical users by promising a huge benefit ('10x faster').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias with 'Alert'. It promises a huge benefit ('10x faster') for a destructive action, tricking users with technical jargon."
  },
  {
    "id": 356,
    "text": "Eating maggi noodles causes a wax coating on your intestines that leads to cancer.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim repeats a popular urban legend ('wax coating') to create fear of a specific food.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Naturalness Bias (processed food is bad). It uses Availability Bias (urban legend) and Illusory Correlation to link 'wax coating' to cancer."
  },
  {
    "id": 357,
    "text": "The government is secretly recording all WhatsApp calls to identify anti-nationals.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses political fear ('identify anti-nationals') to suggest privacy violations.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by invoking political fear ('anti-nationals'). It suggests that 'secretly recording calls' is a standard government practice."
  },
  {
    "id": 358,
    "text": "Grandmother's tip: Applying onion juice to the scalp regrows lost hair in just 10 days.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline promises a miraculous result ('regrows hair in 10 days') based on folk wisdom.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline relies on Naturalness Bias/Traditional authority ('Grandmother's advice'). It promises 'onion juice' is a rapid miracle cure for hair loss."
  },
  {
    "id": 359,
    "text": "Warning: A new scam involves hackers sending you a QR code that drains your bank account instantly.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses 'Warning' and a direct financial threat to make users wary of QR codes.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias with 'Warning'. It describes a 'new scam' involving QR codes to create immediate financial caution."
  },
  {
    "id": 360,
    "text": "Drinking tea on an empty stomach creates acid that burns holes in your stomach lining.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The rationale uses violent imagery ('burns holes') to discourage a common habit.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by stating that tea 'burns holes' in the stomach. It uses violent imagery to exaggerate the effects of acidity."
  },
  {
    "id": 361,
    "text": "Smart watches emit radiation that lowers your sperm count, warns a top fertility doctor.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text links a popular gadget to fertility fears, backed by a 'top doctor'.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Availability Bias via a 'top fertility doctor'. It uses Illusory Correlation to link 'smart watches' radiation directly to lowered 'sperm count'."
  },
  {
    "id": 362,
    "text": "Eating chicken causes hormonal imbalance in men, making them develop female traits.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline taps into gender insecurities ('develop female traits') to attack a food source.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text implies Naturalness Bias (modern farming fear). It uses Illusory Correlation to link 'eating chicken' to 'hormonal imbalance' and feminization in men."
  },
  {
    "id": 363,
    "text": "If you type your PIN wrong three times, the ATM automatically takes a photo of you for the police.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim creates a false sense of surveillance around everyday banking activities.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by creating a false security scenario ('takes a photo'). It adds a layer of surveillance anxiety to ATM usage."
  },
  {
    "id": 364,
    "text": "A famous spiritual leader says that anger causes liver cancer by burning the cells with heat.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion uses spiritual authority and a metaphorical explanation ('burning with heat').",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The headline appeals to Naturalness Bias/Spirituality via a 'famous spiritual leader'. It uses Illusory Correlation to link an emotion ('anger') to 'liver cancer' via 'heat'."
  },
  {
    "id": 365,
    "text": "Your phone's camera can see through your clothes if you use a special filter app.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text appeals to voyeuristic curiosity and privacy fears about technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by appealing to voyeurism and privacy fears. The idea of a camera 'seeing through clothes' is a potent, viral urban legend."
  },
  {
    "id": 366,
    "text": "Swallowing chewing gum wraps around your heart and causes a heart attack, say worried mothers.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses a childhood myth and emotional framing ('worried mothers').",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Naturalness Bias (artificial gum is bad). It uses Availability Bias ('worried mothers') and Illusory Correlation to claim gum 'wraps around your heart'."
  },
  {
    "id": 367,
    "text": "The new digital ID card has a GPS chip that tracks your location 24/7.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim asserts the existence of tracking hardware ('GPS chip') in ID cards to cause alarm.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by asserting a 'GPS chip' exists in ID cards. It validates fears of constant government tracking."
  },
  {
    "id": 368,
    "text": "Top dermatologists reveal that using soap destroys your skin's natural immunity forever.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses authority ('Top dermatologists') to claim permanent damage from a basic hygiene product.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias via 'Top dermatologists'. It exhibits Naturalness Bias by claiming 'soap' (modern hygiene) destroys natural immunity 'forever'."
  },
  {
    "id": 369,
    "text": "Urgent: Don't answer calls from +92 numbers, it allows terrorists to hack your phone.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline combines tech fear with a security threat ('terrorists') to trigger an immediate block.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias with 'Urgent'. It links specific numbers ('+92') to 'terrorists' to create a high-stakes security threat."
  },
  {
    "id": 370,
    "text": "Eating papaya during pregnancy causes miscarriage because it is a 'hot' food.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The rationale relies on the traditional classification of 'hot' foods to support a pregnancy myth.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline appeals to Naturalness Bias/Traditional categories ('hot food'). It uses Illusory Correlation to link 'papaya' to 'miscarriage' based on this cultural belief."
  },
  {
    "id": 371,
    "text": "A leaked video shows that Alexa laughs at your private conversations when you are not looking.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim anthropomorphises technology ('Alexa laughs') to make it feel creepy and invasive.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias via a 'leaked video'. It anthropomorphises Alexa ('laughs at you') to make AI technology feel creepy and hostile."
  },
  {
    "id": 372,
    "text": "Drinking water while standing causes fluid to accumulate in the joints, leading to arthritis.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text validates a cultural superstition using a simple cause-and-effect structure.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim appeals to Naturalness Bias/Traditional wisdom. It uses Illusory Correlation to assert that 'standing' while drinking causes fluid accumulation and 'arthritis'."
  },
  {
    "id": 373,
    "text": "Hackers are selling a device that unlocks any car door in seconds for just ₹500.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline makes crime seem easy and cheap, increasing fear of theft.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by making car theft seem cheap and easy. It creates fear about the security of modern vehicles."
  },
  {
    "id": 374,
    "text": "A famous doctor says that wearing a bra causes breast cancer by blocking lymph flow.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion relies on the authority of a 'famous doctor' to support a scary health claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias via a 'famous doctor'. It uses Illusory Correlation to link 'wearing a bra' to 'breast cancer', blaming clothing for a complex disease."
  },
  {
    "id": 375,
    "text": "The government is secretly slowing down the internet to stop people from sharing news.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text creates a conspiracy narrative about censorship and government control.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias/Conspiracy by alleging 'secretly slowing down the internet'. It appeals to fears of censorship and information control."
  },
  {
    "id": 376,
    "text": "Eating fish and milk together creates white spots on your skin that never go away.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the fear of permanent disfigurement ('never go away') to enforce a food rule.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline appeals to Naturalness Bias/Food taboos. It uses Illusory Correlation to link 'fish and milk' to permanent skin disfigurement."
  },
  {
    "id": 377,
    "text": "Your smartphone is recording your face every time you unlock it to build a government database.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline alleges systematic surveillance integrated into daily phone usage.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by claiming phones 'record your face' for a database. It turns a standard unlock feature into a surveillance tool."
  },
  {
    "id": 378,
    "text": "A simple mixture of ginger and honey cures cancer better than chemotherapy, says a viral post.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text compares a kitchen remedy to medical treatment ('better than chemotherapy') based on a viral post.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias via a 'viral post'. It exhibits Naturalness Bias by asserting that 'ginger and honey' are 'better than chemotherapy' for cancer."
  },
  {
    "id": 379,
    "text": "Beware: New AI drones are flying over cities to scan people's faces for fines.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses 'Beware' and a dystopian scenario ('drones scanning faces') to incite fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias with 'Beware'. It imagines a dystopian scenario of 'AI drones' scanning faces to create fear of technology."
  },
  {
    "id": 380,
    "text": "Drinking cold water freezes the fats in your blood and causes a heart attack.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The rationale uses a simple physical metaphor ('freezes fats') to explain a heart attack.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation by claiming 'cold water freezes fats' in the blood. It uses a simplistic physical metaphor to explain a 'heart attack'."
  },
  {
    "id": 381,
    "text": "Tech companies are hiding free energy technology because they want you to pay electricity bills.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses an anti-corporate conspiracy to explain why energy isn't free.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias/Conspiracy regarding 'hiding free energy'. It appeals to the belief that corporations suppress beneficial technology."
  },
  {
    "id": 382,
    "text": "A famous yoga guru claims that clapping hands for 10 minutes cures low blood pressure.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text promotes a simple physical action as a cure, backed by a spiritual authority.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline appeals to Naturalness Bias via a 'famous yoga guru'. It promotes a simple action ('clapping hands') as a cure for a medical condition."
  },
  {
    "id": 383,
    "text": "Urgent: Do not update your WhatsApp! The new version allows strangers to see your gallery.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim creates urgency ('Urgent') and a privacy threat ('see your gallery') to stop updates.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias with 'Urgent'. It frames a software update as a security threat ('see your gallery') to discourage updating."
  },
  {
    "id": 384,
    "text": "Eating one tulsi leaf every day prevents cancer for your whole life.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline offers a 'magic bullet' solution ('prevents cancer for whole life') using a sacred plant.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Naturalness Bias by offering a 'tulsi leaf' (sacred plant) as a total cancer preventative. It promises a lifetime of health from a simple natural habit."
  },
  {
    "id": 385,
    "text": "Your router is emitting dangerous waves that are killing your house plants.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses visible evidence (dying plants) to imply invisible danger (waves) to humans.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Availability Bias by using visual proof ('killing house plants'). It uses Illusory Correlation to link router 'waves' to biological damage."
  },
  {
    "id": 386,
    "text": "Experts say that sleeping on your stomach damages your internal organs by crushing them.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses vague 'Experts' and violent verbs ('crushing') to warn against a sleeping position.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias via 'Experts say'. It uses Illusory Correlation to claim sleeping on the stomach 'crushes' internal organs, creating a violent health myth."
  },
  {
    "id": 387,
    "text": "Hackers can steal your fingerprints from the photos you post on Instagram.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline expands the threat of identity theft to social media photos.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by expanding identity theft to 'Instagram photos'. It creates paranoia about sharing images online."
  },
  {
    "id": 388,
    "text": "Eating seeds of an apple releases cyanide that kills you instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The rationale exaggerates the toxicity of apple seeds to an immediate lethal effect.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Naturalness Bias (fear of toxins in nature). It uses Illusory Correlation by exaggerating the cyanide in apple seeds to an 'instant' lethal dose."
  },
  {
    "id": 389,
    "text": "The government is installing secret microphones in street lights to listen to pedestrians.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text creates a paranoid narrative about public infrastructure being used for spying.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by creating a paranoia about 'street lights'. It alleges secret government surveillance of public spaces."
  },
  {
    "id": 390,
    "text": "A famous actor reveals that drinking charcoal water is the secret to his clear skin.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion relies on celebrity beauty secrets to promote a fad diet.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias via a 'famous actor'. It exhibits Naturalness Bias by promoting 'charcoal water' (a fad detox item) for beauty."
  },
  {
    "id": 391,
    "text": "Warning: 5G networks activate the virus dormant in your body, says a whistleblower.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim combines health fear ('activate virus') with tech fear, cited by a 'whistleblower'.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Availability Bias with 'Warning' and a 'whistleblower'. It uses Illusory Correlation to link '5G networks' to the activation of a 'dormant virus'."
  },
  {
    "id": 392,
    "text": "Rubbing oil on your belly button cures dry eyes and cracked lips instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline appeals to traditional healing ('belly button oil') with the promise of instant results.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text appeals to Naturalness Bias/Traditional healing ('oil on belly button'). It uses Illusory Correlation to link this to the instant cure of 'dry eyes'."
  },
  {
    "id": 393,
    "text": "If you get a call from 'Customer Care', hang up immediately or they will hack your phone.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses a broad warning against 'Customer Care' to create distrust and fear of hacking.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by creating a broad fear of 'Customer Care' calls. It threatens immediate hacking to trigger a defensive response."
  },
  {
    "id": 394,
    "text": "Doctors are hiding this simple leaf that cures diabetes because they want to sell insulin.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses an anti-medical establishment conspiracy ('Doctors are hiding') to sell a natural cure.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias/Conspiracy ('Doctors are hiding'). It exhibits Naturalness Bias by claiming a 'simple leaf' cures diabetes better than insulin."
  },
  {
    "id": 395,
    "text": "Your smart TV listens to you and sells your secrets to advertisers, reveals an insider.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses an 'insider' source to validate the fear of devices spying on private life.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias via an 'insider'. It validates the fear that 'Smart TVs' are spying and selling private data."
  },
  {
    "id": 396,
    "text": "Eating curd with chicken produces toxins that lead to psoriasis and skin diseases.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text links a specific food combination to a visible, feared disease ('psoriasis').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim appeals to Naturalness Bias/Food taboos. It uses Illusory Correlation to link 'curd with chicken' to 'psoriasis', blaming diet for a skin disease."
  },
  {
    "id": 397,
    "text": "The government reads every email you send to check for keywords like 'revolution'.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim alleges automated government censorship of private communications.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by alleging automated email censorship. It taps into political paranoia about keyword monitoring."
  },
  {
    "id": 398,
    "text": "Grandmother's advice: Drinking hot water in the morning burns all the body fat away.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline offers an effortless weight loss solution ('burns all fat') based on folk wisdom.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text relies on Naturalness Bias/Folk wisdom ('Grandmother's advice'). It suggests 'hot water' is a miraculous, effortless way to burn 'all body fat'."
  },
  {
    "id": 399,
    "text": "Alert: Hackers can now access your camera just by sending you a GIF on WhatsApp.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text turns a harmless media format ('GIF') into a scary hacking vector.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias with 'Alert'. It creates fear about a common media type ('GIF') being a vehicle for total device compromise."
  },
  {
    "id": 400,
    "text": "A famous cardiologist says that skipping dinner is the best way to prevent heart attacks.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion relies on the authority of a 'famous cardiologist' promoting a specific diet habit.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias via a 'famous cardiologist'. It promotes a specific behavior ('skipping dinner') as the ultimate heart attack prevention."
  }
]