[
  {
    "id": 401,
    "text": "The new 6G spectrum allocation utilises terahertz waves that interfere with the synaptic transmission of serotonin, reducing mood stability by 15%.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs specific technical terminology ('terahertz waves', 'synaptic transmission') and quantifies the health impact to sound scientific.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline employs Illusory Correlation by asserting a direct causal link between '6G spectrum' and 'synaptic transmission of serotonin'. It uses pseudo-scientific jargon to create a false relationship between telecommunications technology and neurochemistry."
  },
  {
    "id": 402,
    "text": "Cooking rice in a pressure cooker breaks down the starch into complex sugars that are 40% harder for the pancreas to metabolise.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a chemical breakdown process and uses a percentage to argue against a common cooking method.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text implies Naturalness Bias by suggesting that the modern method of using a 'pressure cooker' makes food 'harder for the pancreas to metabolise' compared to traditional open-pot cooking. It critiques technological processing of food."
  },
  {
    "id": 403,
    "text": "Smart watches measure stress levels by analysing skin conductivity, but the electrical current used causes micro-burns in the dermis over time.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains a mechanism involving 'skin conductivity' and 'electrical current' to justify a safety warning.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by linking the 'electrical current' used by smart watches to 'micro-burns'. It posits a direct physical injury from a low-power consumer sensor without evidence."
  },
  {
    "id": 404,
    "text": "Drinking water immediately after eating fruits dilutes the gastric enzymes, slowing down the digestion process by approximately 45 minutes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses physiological terms ('gastric enzymes') and a specific time delay to validate a food rule.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline appeals to Naturalness Bias regarding digestion. It uses Illusory Correlation to claim that 'drinking water' physically 'dilutes gastric enzymes', a common but scientifically unsupported mechanism for slowing digestion."
  },
  {
    "id": 405,
    "text": "UPI payment gateways embed a geolocation tag in every transaction metadata log, which is stored for 10 years on government servers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline references specific data fields ('geolocation tag', 'metadata log') and retention periods.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a specific data retention policy involving 'geolocation tags'. It relies on privacy concerns and technical plausibility regarding government surveillance rather than cognitive biases."
  },
  {
    "id": 406,
    "text": "Consuming tea reheated in a microwave increases the concentration of catechins to toxic levels, damaging the liver's filtration cells.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text identifies specific chemical compounds ('catechins') and a physiological target ('filtration cells').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim demonstrates Naturalness Bias by framing the microwave (artificial) as a tool that turns tea 'toxic'. It uses Illusory Correlation to link this heating method to liver damage."
  },
  {
    "id": 407,
    "text": "Bluetooth keyboards transmit keystrokes on a 2.4GHz frequency that can be intercepted and decoded by standard Wi-Fi adapters within 50 metres.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim specifies frequencies and hardware capabilities to describe a technical vulnerability.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline details a radio frequency exploit ('2.4GHz interception'). It relies on technical fears of eavesdropping rather than naturalness or availability biases."
  },
  {
    "id": 408,
    "text": "Eating jaggery after meals increases the production of alkaline saliva, which neutralises stomach acid and improves digestion efficiency by 20%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a biological explanation involving pH levels and saliva production to support a habit.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Naturalness Bias/Traditional wisdom regarding 'jaggery'. It uses Illusory Correlation to claim it produces 'alkaline saliva' that significantly improves 'digestion efficiency'."
  },
  {
    "id": 409,
    "text": "Algorithmic trading bots on crypto exchanges artificially inflate prices by 0.5% every hour using 'wash trading' techniques to trap retail investors.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a specific financial manipulation technique ('wash trading') and quantifies the inflation rate.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim describes market manipulation via 'algorithmic trading bots'. It relies on economic cynicism and technical understanding of crypto markets."
  },
  {
    "id": 410,
    "text": "Applying alum (fitkari) to the skin constricts the pores so tightly that it prevents the excretion of toxins, leading to cystic acne in 30% of users.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale explains the mechanism of action ('constricts pores') and assigns a statistical risk.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline inverts Naturalness Bias by claiming 'alum' (a traditional remedy) causes 'cystic acne'. It uses Illusory Correlation to link pore constriction to 'toxin retention'."
  },
  {
    "id": 411,
    "text": "The latest iOS update includes a background process that scans photo libraries for copyrighted logos to report usage data to advertisers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim details a software process ('background scan') and its specific purpose to sound like a privacy leak.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text alleges a specific privacy violation in an 'iOS update'. It relies on the fear of corporate data mining for advertising."
  },
  {
    "id": 412,
    "text": "Sleeping on the left side compresses the stomach against the diaphragm, reducing lung capacity by 10% during the night.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses anatomical positioning and capacity metrics to argue against a sleeping posture.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim appeals to Naturalness Bias/Traditional health beliefs about sleeping posture. It uses Illusory Correlation to link 'sleeping on the left side' to reduced 'lung capacity'."
  },
  {
    "id": 413,
    "text": "Internet service providers inject invisible tracking pixels into HTTP headers to monitor user activity even in Incognito mode.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text references specific web protocols ('HTTP headers', 'tracking pixels') to create a technical privacy threat.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes 'invisible tracking pixels' used by ISPs. It relies on technical understanding of web tracking technologies."
  },
  {
    "id": 414,
    "text": "Eating raw onions daily increases the sulfur content in the blood, which repels mosquito-borne parasites by altering body odour chemistry.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale provides a chemical explanation ('sulfur content') for a biological effect.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Naturalness Bias by promoting 'raw onions' as a natural repellent. It uses Illusory Correlation to link blood sulfur content to repelling 'mosquito-borne parasites'."
  },
  {
    "id": 415,
    "text": "Digital electricity meters use a sampling rate that overestimates consumption by counting reactive power as active power, increasing bills by 15%.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses electrical engineering terms ('reactive power', 'active power') to explain billing discrepancies.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim explains a billing error via 'sampling rate' and power types. It relies on technical skepticism of digital utility meters."
  },
  {
    "id": 416,
    "text": "Drinking water from plastic bottles exposed to sunlight releases antimony, a metalloid that disrupts hormonal balance at levels above 5 ppb.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline specifies a chemical element ('antimony') and a concentration threshold (ppb) to validate the risk.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exhibits Naturalness Bias (plastic/sunlight interaction). It uses Illusory Correlation to link 'antimony' release to hormonal disruption at very low levels."
  },
  {
    "id": 417,
    "text": "Ride-hailing algorithms prioritise users with newer phone models, assigning them cars 20% faster than users with devices older than three years.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a discriminatory algorithmic rule based on device age and quantifies the impact.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes an algorithmic bias favoring 'newer phone models'. It relies on suspicions of planned obsolescence and unfair tech practices."
  },
  {
    "id": 418,
    "text": "Consuming milk and banana together creates a heavy protein complex that slows down the metabolic rate by 12% for six hours.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses biochemical concepts ('protein complex', 'metabolic rate') to support a food combining myth.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Naturalness Bias/Food combining myths. It uses Illusory Correlation to assert that 'milk and banana' form a 'heavy protein complex' that slows metabolism."
  },
  {
    "id": 419,
    "text": "Smart home voice assistants record audio buffers of 10 seconds before the 'wake word' is spoken to improve cloud processing latency.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains a technical reason ('processing latency') for an alleged privacy violation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline explains 'audio buffering' in smart speakers. It relies on technical fears of constant listening devices in the home."
  },
  {
    "id": 420,
    "text": "Walking on marble floors barefoot drains the body's kinetic energy through conduction, leading to chronic fatigue in 25% of housewives.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses physics terms ('conduction', 'kinetic energy') to explain a health condition.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text appeals to Naturalness Bias/Superstition regarding floors. It uses Illusory Correlation to link 'walking on marble' to draining 'kinetic energy' and causing fatigue."
  },
  {
    "id": 421,
    "text": "The new 5G modems in smartphones operate at a temperature that degrades the thermal paste on the CPU, reducing device lifespan by 18 months.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text links a specific hardware component ('5G modems') to material degradation ('thermal paste').",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim links '5G modems' to hardware degradation. It relies on technical arguments about heat management and component lifespan."
  },
  {
    "id": 422,
    "text": "Eating curd at night increases the production of phlegm because the lactobacillus bacteria become more active at lower ambient temperatures.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale proposes a microbiological mechanism involving temperature and bacterial activity.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Naturalness Bias/Ayurveda logic regarding 'curd at night'. It uses Illusory Correlation to link bacterial activity at night to 'phlegm production'."
  },
  {
    "id": 423,
    "text": "QR codes generated by free online tools often contain a redirect script that captures the user's IP address before loading the destination URL.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim describes a specific web exploit ('redirect script') to warn against free tools.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a 'redirect script' exploit in QR codes. It relies on cybersecurity awareness of malicious URLs."
  },
  {
    "id": 424,
    "text": "A clinical trial indicates that wearing gold jewellery improves blood circulation by ionising the iron in haemoglobin through skin contact.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a pseudo-scientific explanation involving ionisation and haemoglobin to validate a tradition.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim promotes Naturalness Bias/Traditional jewelry benefits. It uses Illusory Correlation to suggest gold 'ionises iron' in blood to improve circulation."
  },
  {
    "id": 425,
    "text": "Social media platforms use 'shadow banning' algorithms that detect political keywords and reduce post reach by 80% without notifying the user.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text quantifies the effect of a specific algorithmic suppression technique ('shadow banning').",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline quantifies 'shadow banning' on social media. It relies on the belief in algorithmic censorship and reach manipulation."
  },
  {
    "id": 426,
    "text": "Drinking water from a standing position causes the fluid to impact the stomach wall at high velocity, eroding the mucosal lining over time.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses fluid dynamics concepts ('velocity', 'erosion') to explain a health myth.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text appeals to Naturalness Bias regarding eating posture. It uses Illusory Correlation to claim water velocity 'erodes the mucosal lining' when standing."
  },
  {
    "id": 427,
    "text": "Contactless credit cards emit a continuous RFID signal that can be cloned by scanners up to 3 metres away using a high-gain antenna.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim specifies technical equipment and range parameters to describe a financial security threat.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim details an 'RFID signal' theft method. It relies on technical fears of wireless financial crime."
  },
  {
    "id": 428,
    "text": "Consuming holy basil (tulsi) leaves without chewing protects the teeth, as the leaves contain high levels of mercury that damage enamel if chewed.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites a specific chemical hazard ('mercury') to explain a traditional consumption method.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline inverts Naturalness Bias by stating 'tulsi leaves' (sacred plant) contain 'mercury'. It validates a specific traditional method (not chewing) with chemical logic."
  },
  {
    "id": 429,
    "text": "Cloud storage services scan all uploaded images using AI to detect and flag potential copyright infringements for automatic account suspension.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes an automated AI process and its punitive consequence to create anxiety about cloud usage.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes automated copyright scanning in the cloud. It relies on fears of algorithmic policing and account loss."
  },
  {
    "id": 430,
    "text": "Regular intake of spicy food weakens the lower esophageal sphincter, increasing the risk of acid reflux by 35% in adults over 30.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses anatomical terms ('esophageal sphincter') and statistics to warn against spicy food.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by linking 'spicy food' directly to 'esophageal sphincter' weakness. It explains acid reflux with a specific physiological mechanism."
  },
  {
    "id": 431,
    "text": "The new Aadhaar-based payment system uses a biometric hash that allows banks to share user identity data with third-party insurers without consent.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim references specific technical elements ('biometric hash') to construct a privacy conspiracy.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline alleges data sharing via a 'biometric hash'. It relies on privacy cynicism regarding national ID systems."
  },
  {
    "id": 432,
    "text": "Sitting for more than six hours a day reduces the production of lipoprotein lipase, an enzyme essential for breaking down fats, by 50%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies a specific enzyme and quantifies its reduction to explain the dangers of sitting.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text appeals to Naturalness Bias (sedentary lifestyle is unnatural). It uses Illusory Correlation to quantify the reduction of 'lipoprotein lipase' due to sitting."
  },
  {
    "id": 433,
    "text": "Mobile games use ultrasonic audio beacons to track viewing habits by syncing with TV commercials, creating a cross-device profile.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains a sophisticated tracking technology ('ultrasonic beacons') to sound technologically plausible.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim describes 'ultrasonic tracking' across devices. It relies on the plausibility of hidden signals used for ad profiling."
  },
  {
    "id": 434,
    "text": "Applying cow dung to skin infections creates a biofilm that suffocates anaerobic bacteria, speeding up the healing process by 40%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses microbiological terms ('biofilm', 'anaerobic bacteria') to validate a traditional remedy.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline strongly features Naturalness Bias by promoting 'cow dung' as a healer. It uses scientific terms like 'biofilm' to validate a traditional remedy."
  },
  {
    "id": 435,
    "text": "Operating systems reserve 20% of the CPU's processing power for a hidden 'telemetry' thread that sends usage data to the manufacturer.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim quantifies the resource usage ('20% of CPU') of a specific hidden process.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text alleges a 'hidden telemetry thread' consuming CPU. It relies on technical paranoia about software bloat and spying."
  },
  {
    "id": 436,
    "text": "Drinking chilled water contracts the blood vessels in the stomach, reducing nutrient absorption efficiency by 18% during digestion.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline proposes a physiological mechanism ('vessel contraction') and a statistic to argue against cold water.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by stating 'chilled water contracts blood vessels' to reduce nutrient absorption. It appeals to the Naturalness Bias idea that cold water is harmful to digestion."
  },
  {
    "id": 437,
    "text": "Virtual Private Networks (VPNs) log user DNS requests in a temporary cache that can be accessed by ISPs using deep packet inspection tools.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses technical networking terms ('DNS requests', 'deep packet inspection') to undermine VPN trust.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a 'DNS cache' vulnerability in VPNs. It relies on technical understanding of networking privacy leaks."
  },
  {
    "id": 438,
    "text": "Eating fermented foods boosts the production of serotonin in the gut, which accounts for 90% of the body's total supply, improving mental health.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale links gut biology to neurotransmitters ('serotonin') with a specific percentage claim.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text promotes Naturalness Bias by linking 'fermented foods' (traditional) to 'serotonin' production. It suggests diet is the primary driver of mental health."
  },
  {
    "id": 439,
    "text": "Public Wi-Fi networks in metro stations use a 'captive portal' that installs a persistent tracking cookie on the user's browser.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim describes a specific Wi-Fi mechanism ('captive portal') to explain how tracking occurs.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim details a 'captive portal' tracking method. It relies on technical fears of public Wi-Fi security."
  },
  {
    "id": 440,
    "text": "Using a mobile phone in the dark dilates the pupils, allowing 50% more blue light to enter the retina and damage photoreceptor cells.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses biological logic ('pupil dilation') to quantify the increased risk of screen usage.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by linking 'pupil dilation' in the dark to increased 'blue light' damage. It quantifies the risk to 'photoreceptor cells' based on this mechanism."
  },
  {
    "id": 441,
    "text": "Automated toll collection systems capture the vehicle's speed between points to issue speeding tickets automatically without radar guns.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a logical calculation method ('speed between points') to suggest hidden surveillance.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes 'average speed' calculation by toll systems. It relies on the plausibility of automated traffic enforcement."
  },
  {
    "id": 442,
    "text": "Consuming turmeric with black pepper increases the bioavailability of curcumin by 2000% due to the compound piperine.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses specific chemical names ('curcumin', 'piperine') and a massive percentage to sound authoritative.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim exhibits Naturalness Bias by highlighting the synergy of 'turmeric and black pepper'. It uses chemical names to scientifically validate a traditional combination."
  },
  {
    "id": 443,
    "text": "Deleted files on solid-state drives (SSDs) are not removed immediately but are marked as 'overwriteable', allowing recovery for up to 30 days.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains a file system behavior ('marked overwriteable') to create a data privacy concern.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline explains SSD data deletion mechanics. It relies on technical knowledge of file recovery to create a privacy concern."
  },
  {
    "id": 444,
    "text": "A study shows that regular fasting triggers autophagy, a cellular process that removes damaged proteins and reduces cancer risk by 25%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites a biological process ('autophagy') and a specific risk reduction statistic.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text promotes Naturalness Bias by framing 'fasting' (natural state) as a cancer preventative. It cites 'autophagy' as the biological mechanism."
  },
  {
    "id": 445,
    "text": "Facial recognition cameras in malls track customer dwell time and mood to generate a 'shopper value score' sold to retailers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a specific metric ('dwell time', 'value score') to explain commercial surveillance.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim describes retail surveillance using 'facial recognition'. It relies on the fear of being profiled and scored by commercial entities."
  },
  {
    "id": 446,
    "text": "Cooking vegetables in excess water leaches out water-soluble vitamins like B and C, reducing nutritional value by up to 60%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses nutritional science ('water-soluble vitamins') to validate a cooking tip.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline appeals to Naturalness Bias regarding nutrient preservation. It uses nutritional science to warn against 'over-cooking' vegetables."
  },
  {
    "id": 447,
    "text": "Smartphone gyroscopes are sensitive enough to pick up sound vibrations from nearby surfaces, allowing apps to eavesdrop without microphone access.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim proposes a novel technical method ('gyroscope sound vibrations') for spying.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text proposes a high-tech eavesdropping method using 'gyroscopes'. It relies on the plausibility of advanced sensor misuse."
  },
  {
    "id": 448,
    "text": "Eating papaya seeds destroys intestinal parasites by releasing proteolytic enzymes that dissolve their protective outer cuticle.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains the mechanism of action using biological terms ('proteolytic enzymes', 'cuticle').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim exhibits Naturalness Bias by promoting 'papaya seeds' as a parasite cure. It uses biological terms to explain how a natural food acts as medicine."
  },
  {
    "id": 449,
    "text": "Browser 'Incognito' modes only prevent local history storage; the ISP and websites can still track the session via the unique MAC address.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text clarifies the technical limits of Incognito mode, citing MAC addresses as the tracking vector.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline clarifies the limits of 'Incognito mode'. It relies on technical facts about MAC addresses and ISP tracking."
  },
  {
    "id": 450,
    "text": "Smart electricity meters communicate on a frequency of 900MHz, which can interfere with the operation of older cardiac pacemakers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale specifies a radio frequency and a medical device interaction to create a safety warning.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation by linking '900MHz' frequency to pacemaker interference. It posits a specific radio interaction to create a safety fear."
  },
  {
    "id": 451,
    "text": "Drinking alkaline water neutralises stomach acid, forcing the body to produce more hydrochloric acid to compensate, leading to chronic indigestion.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a homeostatic compensation argument ('produce more acid') to critique a health trend.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim counters Naturalness Bias/Fad diets by attacking 'alkaline water'. It uses Illusory Correlation to describe a 'rebound acid' effect leading to indigestion."
  },
  {
    "id": 452,
    "text": "Encrypted messaging apps use a centralized key server that government agencies can subpoena to decrypt message logs retroactively.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim describes a specific infrastructure weakness ('centralized key server') to undermine encryption.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline alleges a 'centralized key server' vulnerability. It relies on distrust of encryption implementation and government subpoenas."
  },
  {
    "id": 453,
    "text": "Consuming bitter gourd juice reduces insulin resistance by activating the AMP-activated protein kinase (AMPK) pathway in the liver.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text references a specific metabolic pathway (AMPK) to sound scientifically credible.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text promotes Naturalness Bias by offering 'bitter gourd juice' as a diabetes remedy. It uses the 'AMPK pathway' to sound scientifically credible."
  },
  {
    "id": 454,
    "text": "Digital signatures on PDF documents contain a timestamp metadata field that reveals the exact GPS location of the device at the moment of signing.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links specific metadata fields ('timestamp', 'GPS') to a privacy leak.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim details metadata leaks in 'Digital signatures'. It relies on technical fears of location tracking via document properties."
  },
  {
    "id": 455,
    "text": "Sleeping with artificial light exposure suppresses melatonin production by 50%, disrupting the circadian rhythm and increasing cancer risk.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale quantifies hormone suppression ('melatonin') to explain the health risk of light.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Naturalness Bias (artificial light is bad). It uses Illusory Correlation to link light exposure directly to 'cancer risk' via melatonin suppression."
  },
  {
    "id": 456,
    "text": "Wireless earbuds use a magnetic induction technology that creates a localized field of 0.5 Gauss near the brain, affecting cognitive focus.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim specifies a magnetic field strength ('0.5 Gauss') to create a health concern about technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation by linking 'magnetic induction' in earbuds to cognitive effects. It invents a specific field strength impact on the brain."
  },
  {
    "id": 457,
    "text": "Eating fruits with milk causes fermentation in the stomach due to the conflicting digestion times, producing toxins known as 'Ama' in Ayurveda.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains a digestive conflict mechanism and references a specific toxin name ('Ama').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim appeals to Naturalness Bias/Ayurveda ('Ama'). It uses Illusory Correlation to describe 'fermentation' in the stomach caused by mixing fruit and milk."
  },
  {
    "id": 458,
    "text": "Voice recognition software stores a 'voiceprint' biometric template that can be used to generate deepfake audio without the user's consent.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes the storage of biometric data ('voiceprint') and its potential misuse.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes 'voiceprint' storage for deepfakes. It relies on the fear of biometric data misuse and AI impersonation."
  },
  {
    "id": 459,
    "text": "Regular consumption of roasted gram increases protein absorption efficiency by 15% due to the denaturation of anti-nutritional factors.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses terms like 'denaturation' and 'anti-nutritional factors' to promote a food item.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text promotes Naturalness Bias by explaining how roasting improves 'gram' (chickpea). It uses scientific terms like 'anti-nutritional factors' to validate a traditional snack."
  },
  {
    "id": 460,
    "text": "Smart TVs use Automatic Content Recognition (ACR) to identify what is on screen and sell viewing data to marketing firms in real-time.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim identifies a specific technology (ACR) and its commercial application to explain privacy loss.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim identifies 'ACR' technology in Smart TVs. It relies on the plausibility of viewing data being sold to advertisers."
  },
  {
    "id": 461,
    "text": "Applying castor oil to the eyes dissolves cataracts by stimulating the lymphatic drainage system to remove protein aggregations.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text proposes a biological mechanism ('lymphatic drainage') for a home remedy.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Naturalness Bias by suggesting 'castor oil' can cure cataracts. It proposes a biological mechanism ('lymphatic drainage') for a home remedy."
  },
  {
    "id": 462,
    "text": "The 5G network architecture requires small cell towers every 200 metres, creating a continuous blanket of RF radiation in urban areas.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses infrastructure details ('small cell towers', '200 metres') to visualize the radiation threat.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation by visualizing a 'continuous blanket' of radiation from 5G. It links infrastructure density to an implied health threat."
  },
  {
    "id": 463,
    "text": "Eating almonds soaked overnight increases lipase enzyme activity, aiding in the breakdown of fats and improving digestion by 20%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale focuses on enzyme activity ('lipase') to validate a traditional eating habit.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim appeals to Naturalness Bias/Traditional wisdom ('soaked almonds'). It uses enzyme activity to explain the digestive benefit."
  },
  {
    "id": 464,
    "text": "Mobile operating systems silently upload the user's contact list to 'friend discovery' servers to map social connections for graph analysis.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim describes a background data process ('upload contact list') and its analytical purpose.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes 'contact list' uploading for social graphs. It relies on privacy concerns regarding background data collection."
  },
  {
    "id": 465,
    "text": "Drinking coconut water during menstruation balances electrolyte levels, reducing cramping intensity by 30% according to gynecological studies.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text references 'electrolyte levels' and specific studies to recommend a remedy.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text promotes Naturalness Bias by offering 'coconut water' for menstrual cramps. It cites 'electrolyte balance' to validate the remedy."
  },
  {
    "id": 466,
    "text": "Search engine algorithms penalise websites that do not use Google Analytics, pushing them down in search rankings by an average of 5 positions.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts a specific anti-competitive behavior in algorithms, quantified by ranking positions.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim alleges anti-competitive ranking penalties by search engines. It relies on suspicion of tech monopolies enforcing their own tools."
  },
  {
    "id": 467,
    "text": "Using ear candles creates a vacuum that physically sucks out earwax, but it can also rupture the eardrum due to negative pressure.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale explains the physics ('vacuum', 'negative pressure') of a controversial practice.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline addresses Naturalness Bias by discussing 'ear candles'. It uses physical reasoning ('vacuum') to explain both the purported benefit and the risk."
  },
  {
    "id": 468,
    "text": "Router firmware contains a 'backdoor' port 32764 that allows ISP technicians to access the local network for maintenance without a password.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim specifies a port number (32764) to make the security vulnerability sound authentic.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text details a specific 'backdoor' port in routers. It relies on technical cybersecurity knowledge to sound authentic."
  },
  {
    "id": 469,
    "text": "Applying onion juice to the scalp provides sulphur, which is a key component of keratin, effectively regenerating hair follicles.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text links a chemical element ('sulphur') to a biological structure ('keratin') to explain hair growth.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim exhibits Naturalness Bias by linking 'onion juice' (natural) to hair growth. It uses chemical logic ('sulphur') to explain the effect."
  },
  {
    "id": 470,
    "text": "Online banking portals use 'mouse tracking' scripts to record cursor movements, identifying user hesitation to detect potential fraud.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a behavioral biometric technique ('mouse tracking') used for surveillance.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes 'mouse tracking' for fraud detection. It relies on the plausibility of behavioral analysis technology."
  },
  {
    "id": 471,
    "text": "Consuming water stored in plastic bottles releases bisphenol A (BPA), which mimics estrogen and disrupts the endocrine system.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale identifies a chemical ('BPA') and its specific biological impact ('mimics estrogen').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Naturalness Bias (plastic is toxic). It uses Illusory Correlation to link 'BPA' to 'endocrine disruption', a common but often exaggerated health fear."
  },
  {
    "id": 472,
    "text": "GPS apps share real-time traffic data with insurance companies, who raise premiums for drivers who frequently exceed speed limits.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim suggests a direct data pipeline between apps and insurers to explain financial consequences.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim alleges data sharing between GPS apps and insurers. It relies on the fear of surveillance capitalism affecting personal finances."
  },
  {
    "id": 473,
    "text": "Eating fenugreek seeds lowers blood sugar by slowing down carbohydrate digestion and absorption in the small intestine.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the metabolic mechanism ('slowing digestion') of a diabetic remedy.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline promotes Naturalness Bias by offering 'fenugreek seeds' for diabetes. It explains the benefit via 'carbohydrate digestion' slowing."
  },
  {
    "id": 474,
    "text": "Video conferencing apps compress audio using a codec that removes frequencies above 15kHz, causing subconscious fatigue in listeners.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses audio engineering terms ('codec', '15kHz') to explain 'Zoom fatigue'.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation by linking 'audio compression' to 'subconscious fatigue'. It posits a technical cause for a psychological phenomenon."
  },
  {
    "id": 475,
    "text": "Practising yoga inversions increases blood flow to the pineal gland, stimulating the production of melatonin and improving sleep quality.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale links a physical exercise to a specific gland and hormone to validate the benefit.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim appeals to Naturalness Bias/Yoga benefits. It links 'inversions' to 'pineal gland' stimulation to explain improved sleep."
  },
  {
    "id": 476,
    "text": "Biometric attendance systems store fingerprint templates in an insecure SQL database that is vulnerable to injection attacks.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim mentions specific database technologies ('SQL', 'injection attacks') to describe a security flaw.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes 'SQL injection' risks in biometric systems. It relies on technical database security fears."
  },
  {
    "id": 477,
    "text": "Drinking hot lemon water dissolves uric acid crystals in the joints, reducing the symptoms of gout and arthritis.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text proposes a chemical mechanism ('dissolves crystals') for a simple home remedy.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by claiming 'hot lemon water' dissolves 'uric acid'. It offers a simple natural cure for a complex condition like gout."
  },
  {
    "id": 478,
    "text": "The new e-RUPI vouchers are programmable tokens that restrict spending to specific merchant category codes (MCCs).",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses financial tech jargon ('programmable tokens', 'MCCs') to explain usage restrictions.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim details 'programmable tokens' in e-RUPI. It relies on technical understanding of fintech restrictions."
  },
  {
    "id": 479,
    "text": "Applying turmeric to wounds promotes clotting by enhancing the fibrinogen activity in the blood plasma.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale explains the clotting effect using blood components ('fibrinogen').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline promotes Naturalness Bias by suggesting 'turmeric' enhances clotting. It uses biological terms ('fibrinogen') to validate a home remedy."
  },
  {
    "id": 480,
    "text": "Social media apps access the clipboard content every time they are opened to capture copied links or text for ad targeting.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim describes a specific OS behavior ('access clipboard') to explain how apps track interest.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes 'clipboard access' by apps. It relies on privacy awareness regarding OS permissions and data scraping."
  },
  {
    "id": 481,
    "text": "Eating curd with fish causes a chemical reaction that produces toxic peptides, leading to skin pigmentation disorders like vitiligo.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses chemical terms ('toxic peptides') to validate a dietary superstition.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim appeals to Naturalness Bias/Food taboos. It uses Illusory Correlation to link 'curd with fish' to 'toxic peptides' and skin disease."
  },
  {
    "id": 482,
    "text": "Smartphone batteries degrade faster when charged via USB ports on laptops because the current fluctuates between 0.5A and 0.9A.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites specific amperage fluctuations to explain battery damage.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline links USB charging to battery degradation. It relies on electrical engineering concepts regarding current fluctuation."
  },
  {
    "id": 483,
    "text": "Chewing gum stimulates the production of gastric acid, which can lead to gastritis if the stomach is empty.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses a physiological chain of events ('gastric acid production') to warn against gum.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation by linking 'chewing gum' to 'gastritis'. It creates a physiological chain of events to discourage the habit."
  },
  {
    "id": 484,
    "text": "Public charging stations use 'juice jacking' to install malware that captures keystrokes and sends them to a remote server.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim names a specific attack ('juice jacking') and its payload ('keystroke capture').",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim names 'juice jacking' as a threat. It relies on cybersecurity awareness of public charging risks."
  },
  {
    "id": 485,
    "text": "Walking barefoot stimulates the acupressure points on the soles, which are connected to the internal organs via nerve pathways.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the benefit using the framework of acupressure and nerve pathways.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline appeals to Naturalness Bias/Acupressure. It uses Illusory Correlation to link 'walking barefoot' to internal organ health via nerve pathways."
  },
  {
    "id": 486,
    "text": "Facial recognition systems have a higher error rate for darker skin tones due to the lack of diverse training data sets.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline attributes a technical failure ('error rate') to a specific cause ('training data bias').",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes racial bias in 'facial recognition'. It relies on technical understanding of AI training data limitations."
  },
  {
    "id": 487,
    "text": "Consuming honey heated above 40 degrees Celsius produces hydroxymethylfurfural (HMF), a compound that is toxic to humans.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale identifies a specific chemical ('HMF') produced by heat to warn against cooking honey.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim appeals to Naturalness Bias/Ayurveda (heated honey is toxic). It uses Illusory Correlation to identify 'HMF' as a dangerous toxin produced by cooking honey."
  },
  {
    "id": 488,
    "text": "Web browsers store a cache of visited sites that can be accessed by scripts on other pages using a 'history sniffing' vulnerability.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim describes a specific browser vulnerability ('history sniffing') to suggest privacy loss.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline details 'history sniffing' vulnerabilities. It relies on technical web security concepts."
  },
  {
    "id": 489,
    "text": "Eating banana flower reduces blood sugar levels by increasing the peripheral utilization of glucose in the muscle tissues.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the mechanism ('peripheral utilization') of a diabetic remedy.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text promotes Naturalness Bias by offering 'banana flower' for diabetes. It explains the mechanism via glucose utilization."
  },
  {
    "id": 490,
    "text": "Smart thermostats upload audio recordings of the home environment to the cloud for 'quality assurance' analysis by human reviewers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a data handling process ('human review') to create privacy anxiety.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim alleges 'human review' of smart thermostat audio. It relies on privacy fears regarding IoT data processing."
  },
  {
    "id": 491,
    "text": "Drinking water while standing allows it to pass directly to the duodenum without proper mixing with gastric juices, causing indigestion.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses anatomical terms ('duodenum', 'gastric juices') to explain a traditional rule.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline appeals to Naturalness Bias regarding drinking posture. It uses Illusory Correlation to claim standing allows water to bypass digestion, causing issues."
  },
  {
    "id": 492,
    "text": "Mobile network towers emit electromagnetic radiation that disrupts the orientation of migratory birds, leading to navigation errors.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim links technology to ecological damage using a specific mechanism ('orientation disruption').",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation by linking 'mobile towers' to bird navigation errors. It relies on environmental concerns about electromagnetic radiation."
  },
  {
    "id": 493,
    "text": "Applying coconut oil to the hair reduces protein loss by penetrating the hair shaft and binding to the keratin structure.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the benefit using structural biology concepts ('hair shaft', 'keratin binding').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim exhibits Naturalness Bias by promoting 'coconut oil' for hair. It uses structural biology ('protein loss') to explain the benefit."
  },
  {
    "id": 494,
    "text": "The new digital currency platform uses a blockchain ledger that makes every transaction publicly visible and traceable to the user.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses blockchain terminology ('ledger', 'traceable') to imply a lack of financial privacy.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes 'blockchain ledger' transparency. It relies on technical understanding of crypto traceability."
  },
  {
    "id": 495,
    "text": "Eating papaya seeds acts as a natural contraceptive by reducing the sperm count and motility due to the presence of caricin.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale identifies a chemical ('caricin') and a biological effect ('sperm motility') to validate the claim.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text promotes Naturalness Bias by offering 'papaya seeds' as a contraceptive. It cites 'caricin' to explain the biological effect."
  },
  {
    "id": 496,
    "text": "Voice assistants are always listening for the 'wake word' using a low-power processor that processes audio locally but logs triggers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains the hardware operation ('low-power processor') to describe how listening works.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim explains 'wake word' processing hardware. It relies on technical details of voice assistant architecture."
  },
  {
    "id": 497,
    "text": "Consuming fenugreek water daily reduces cholesterol by preventing the absorption of bile acids in the intestines.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text proposes a mechanism ('preventing bile acid absorption') for a health benefit.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Naturalness Bias by promoting 'fenugreek water' for cholesterol. It proposes a mechanism involving bile acid absorption."
  },
  {
    "id": 498,
    "text": "Internet service providers throttle bandwidth for video streaming services to manage network congestion during peak hours.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a network management practice ('throttling') to explain buffering.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes 'bandwidth throttling' by ISPs. It relies on net neutrality concerns and network management explanations."
  },
  {
    "id": 499,
    "text": "Rubbing nails together stimulates the nerves connected to the scalp, promoting blood circulation and hair growth.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale links a physical action to a physiological outcome ('blood circulation') via nerve connections.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim appeals to Naturalness Bias/Reflexology. It uses Illusory Correlation to link 'rubbing nails' to 'hair growth' via nerve stimulation."
  },
  {
    "id": 500,
    "text": "Smart meters transmit usage data every 15 minutes, allowing utility companies to deduce household activity patterns.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim cites a transmission interval ('every 15 minutes') to explain how privacy is compromised.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline details 'smart meter' data transmission. It relies on privacy fears regarding granular energy usage data."
  },
  {
    "id": 501,
    "text": "Shocking: Doctors reveal that this common kitchen spice is actually destroying your liver.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses 'Shocking' and the authority of 'Doctors' to create fear about a common item.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias via 'Shocking' and 'Doctors reveal'. It implies Naturalness Bias by attacking a 'common kitchen spice' (natural) as dangerous."
  },
  {
    "id": 502,
    "text": "Warning: The government is secretly recording all your phone calls to build a profile on you.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses 'Warning' and a conspiracy narrative ('secretly recording') to incite paranoia.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias with 'Warning'. It creates a paranoid narrative of total government surveillance ('recording all your calls')."
  },
  {
    "id": 503,
    "text": "A famous Bollywood actress claims that applying ghee to the navel is her secret to glowing skin.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim relies on celebrity endorsement ('famous actress') to validate a beauty tip.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias via a 'famous actress'. It exhibits Naturalness Bias by promoting 'ghee to the navel' (traditional) for beauty."
  },
  {
    "id": 504,
    "text": "Beware: Using this popular app gives hackers full access to your bank account instantly.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses 'Beware' and a catastrophic threat ('full access', 'instantly') to trigger action.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias with 'Beware'. It threatens immediate financial ruin ('full access', 'instantly') from a popular app."
  },
  {
    "id": 505,
    "text": "Ancient sages knew that drinking water from a copper vessel prevents all diseases.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text appeals to 'ancient sages' and offers a total preventative ('all diseases').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim appeals to Naturalness Bias/Ancient wisdom. It suggests 'copper vessel' water is a panacea ('prevents all diseases')."
  },
  {
    "id": 506,
    "text": "Alert: Your Smart TV camera is on and watching you right now, says a whistleblower.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses 'Alert' and the immediacy of 'right now' to create a sense of violation.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias with 'Alert'. It creates a sense of immediate violation ('watching you right now')."
  },
  {
    "id": 507,
    "text": "Stop eating bread! It is like glue in your stomach and causes cancer.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses a strong command ('Stop eating') and a simple, scary metaphor ('glue').",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias with the command 'Stop eating'. It shows Naturalness Bias (processed food is bad) and Illusory Correlation by comparing bread to 'glue' causing cancer."
  },
  {
    "id": 508,
    "text": "5G towers are killing birds and bees everywhere, imagine what they do to humans.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses emotional environmental imagery to imply a threat to human health.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Availability Bias via emotional imagery ('killing birds and bees'). It uses Illusory Correlation to imply 5G is lethal to humans based on this environmental claim."
  },
  {
    "id": 509,
    "text": "Grandmother's tip: Putting a drop of oil in the ear cures deafness overnight.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim appeals to traditional wisdom ('Grandmother's tip') and promises a miracle cure.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline relies on Naturalness Bias/Folk wisdom ('Grandmother's tip'). It promises a simple oil drop can cure deafness overnight."
  },
  {
    "id": 510,
    "text": "Urgent: Delete your Facebook account now or hackers will steal your identity.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline demands immediate action ('Delete... now') using a high-stakes threat.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias with 'Urgent'. It forces action ('Delete... now') using the threat of identity theft."
  },
  {
    "id": 511,
    "text": "A viral video shows how 5G radiation cooks an egg in minutes.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text references a 'viral video' to provide social proof for a scary visual claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Availability Bias via a 'viral video'. It uses Illusory Correlation to link '5G radiation' to thermal cooking of an egg."
  },
  {
    "id": 512,
    "text": "Doctors are hiding this simple fruit that cures diabetes in just 7 days.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the 'hidden cure' conspiracy trope to sell a natural remedy.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias/Conspiracy ('Doctors are hiding'). It promotes Naturalness Bias by offering a 'simple fruit' as a rapid cure for diabetes."
  },
  {
    "id": 513,
    "text": "If you type your password backward, the police are alerted immediately.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline offers a 'secret trick' that empowers the user with false security.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by offering a 'secret trick'. It empowers the user with a false safety mechanism."
  },
  {
    "id": 514,
    "text": "Eating curd at night turns to poison in your body, warn Ayurveda experts.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses strong language ('poison') and the authority of 'Ayurveda experts'.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The claim appeals to Naturalness Bias/Ayurveda. It uses Availability Bias ('warn experts') and Illusory Correlation to claim curd 'turns to poison' at night."
  },
  {
    "id": 515,
    "text": "The government will shut down the internet for 10 days to control the population.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim predicts a massive disruption to create fear of government control.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by predicting a massive event ('shut down the internet'). It taps into fear of government control."
  },
  {
    "id": 516,
    "text": "A famous cricketer says he never drinks cold water because it freezes the heart.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses celebrity authority and a visceral metaphor ('freezes the heart').",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias via a 'famous cricketer'. It uses Naturalness Bias (cold water is unnatural) and Illusory Correlation to claim it 'freezes the heart'."
  },
  {
    "id": 517,
    "text": "Warning: Do not answer calls from this number, your phone will blast.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses an impossible but terrifying threat ('phone will blast') to ensure sharing.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias with 'Warning'. It relies on an impossible threat ('phone will blast') to scare users."
  },
  {
    "id": 518,
    "text": "This one simple leaf removes all toxins from your kidneys instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim promises an instant, total detox ('removes all toxins') with a simple solution.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Naturalness Bias by offering a 'simple leaf' for total detox. It promises instant kidney cleansing."
  },
  {
    "id": 519,
    "text": "Your Wi-Fi router is emitting dangerous waves that are killing your plants.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses visible evidence (dying plants) to imply invisible danger to the home.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias by showing visible damage ('killing plants'). It uses Illusory Correlation to link router 'waves' to this biological harm."
  },
  {
    "id": 520,
    "text": "Top scientists admit that vaccines are designed to control your mind.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the 'admission' frame ('admit') to support a wild conspiracy theory.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias/Conspiracy ('scientists admit'). It implies Naturalness Bias by attacking vaccines (artificial) as mind control tools."
  },
  {
    "id": 521,
    "text": "Beware: Hackers can see you through your phone camera even when it's off.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim taps into the fear of constant, unavoidable surveillance.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias with 'Beware'. It reinforces the fear of unavoidable surveillance ('even when off')."
  },
  {
    "id": 522,
    "text": "Rubbing garlic on your feet cleans your blood and prevents heart attacks.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline promotes a bizarre folk remedy with a major health promise ('prevents heart attacks').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text promotes Naturalness Bias by using 'garlic' on feet. It uses Illusory Correlation to link this external application to 'cleaning blood'."
  },
  {
    "id": 523,
    "text": "A secret code allows you to listen to other people's phone calls instantly.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text appeals to curiosity and the desire for power ('listen to other people').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by offering a 'secret code'. It appeals to the desire to spy on others."
  },
  {
    "id": 524,
    "text": "Eating rice at night makes you fat instantly, says a famous fitness trainer.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses celebrity authority and appeals to vanity ('makes you fat').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Availability Bias via a 'famous trainer'. It uses Illusory Correlation to claim rice at night 'makes you fat instantly'."
  },
  {
    "id": 525,
    "text": "Alert: A new virus is deleting all photos on phones, update your antivirus now.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline threatens the loss of personal memories ('deleting all photos') to force action.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias with 'Alert'. It threatens the loss of photos to force an antivirus update."
  },
  {
    "id": 526,
    "text": "Drinking hot water with honey cures cancer in the early stages.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text offers a simple, comforting cure for a terrifying disease.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim exhibits Naturalness Bias by offering 'hot water with honey' as a cancer cure. It provides a simple, natural solution for a complex disease."
  },
  {
    "id": 527,
    "text": "The government is tracking your every move through the new digital ID card.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim focuses on the fear of state surveillance ('tracking your every move').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by asserting total tracking. It taps into the fear of the 'digital ID card'."
  },
  {
    "id": 528,
    "text": "Grandmother says never sleep with your head to the North or you will die early.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses a traditional superstition and a death threat ('die early') to enforce a rule.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text appeals to Naturalness Bias/Tradition ('Grandmother'). It uses Illusory Correlation to link sleeping direction to 'dying early'."
  },
  {
    "id": 529,
    "text": "Smart speakers record your private conversations and sell them to advertisers.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text creates anxiety about privacy in the home ('private conversations').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by claiming speakers 'record private conversations'. It validates the fear of home surveillance."
  },
  {
    "id": 530,
    "text": "Eating seeds of fruits causes appendicitis because they get stuck forever.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses a simple, visual logic ('get stuck forever') to explain a medical issue.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by claiming fruit seeds 'get stuck forever'. It uses a simple visual logic to explain appendicitis."
  },
  {
    "id": 531,
    "text": "Urgent: Don't open any video from unknown numbers, it's a hacker trick.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline creates a blanket rule ('Don't open any video') based on fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias with 'Urgent'. It creates a blanket fear of video files from unknown numbers."
  },
  {
    "id": 532,
    "text": "A famous yoga guru claims that clapping hands cures all heart problems.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the authority of a 'famous yoga guru' to promote a simple cure.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias via a 'famous yoga guru'. It exhibits Naturalness Bias by promoting 'clapping hands' as a cure-all for heart problems."
  },
  {
    "id": 533,
    "text": "Your keyboard tracks everything you type and sends it to the police.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim alleges total surveillance ('everything you type') by law enforcement.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by alleging police surveillance of 'everything you type'. It creates a paranoid atmosphere."
  },
  {
    "id": 534,
    "text": "Applying saliva to your eyes in the morning cures poor vision naturally.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline promotes a 'natural' and free remedy for a common problem.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text promotes Naturalness Bias by offering 'saliva' as a cure for poor vision. It suggests the body's own fluids are medicinal."
  },
  {
    "id": 535,
    "text": "Warning: 5G networks are designed to control human thoughts.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses 'Warning' and a sci-fi conspiracy ('control thoughts') to attack 5G.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias with 'Warning'. It employs a sci-fi conspiracy ('control thoughts') to attack 5G."
  },
  {
    "id": 536,
    "text": "Eating chicken causes hormonal imbalance and makes men infertile.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim targets masculinity and fertility fears to discourage eating chicken.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline implies Naturalness Bias (modern farming fear). It uses Illusory Correlation to link 'eating chicken' to male infertility."
  },
  {
    "id": 537,
    "text": "A leaked memo shows that social media apps are designed to make you addicted.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the 'leaked memo' trope to validate fears about addiction.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias via a 'leaked memo'. It validates the suspicion that apps are engineered for addiction."
  },
  {
    "id": 538,
    "text": "Drinking coconut water dissolves blood clots and prevents strokes.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text promises a major health benefit ('prevents strokes') from a common drink.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim promotes Naturalness Bias by offering 'coconut water' as a stroke preventative. It promises a major health benefit from a natural drink."
  },
  {
    "id": 539,
    "text": "Beware: ATMs are now taking photos of your face to track your spending.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim creates paranoia about everyday financial transactions.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias with 'Beware'. It creates paranoia about ATMs capturing biometric data."
  },
  {
    "id": 540,
    "text": "A famous actor reveals that he eats only raw food to stay young forever.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses celebrity behavior to promote an extreme diet.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias via a 'famous actor'. It exhibits Naturalness Bias by promoting a 'raw food' diet for eternal youth."
  },
  {
    "id": 541,
    "text": "Alert: A new WhatsApp bug allows strangers to read your private chats.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text threatens the privacy of personal communications ('private chats').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias with 'Alert'. It threatens the privacy of 'private chats' on WhatsApp."
  },
  {
    "id": 542,
    "text": "Putting onions in your socks while sleeping absorbs all the toxins from your body.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim offers a simple, passive detox method ('absorbs all toxins').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline promotes Naturalness Bias by using 'onions'. It uses Illusory Correlation to claim they 'absorb toxins' through the feet."
  },
  {
    "id": 543,
    "text": "The government is secretly installing chips in electric meters to spy on you.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline builds a conspiracy theory about government spying in the home.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by alleging secret chips in meters. It builds a conspiracy about government spying."
  },
  {
    "id": 544,
    "text": "Drinking water while standing causes knee pain and arthritis instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text validates a cultural belief with a threat of immediate pain.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim appeals to Naturalness Bias/Tradition regarding drinking posture. It uses Illusory Correlation to link standing to 'instant' knee pain."
  },
  {
    "id": 545,
    "text": "Your smartphone screen emits a light that makes you go blind slowly.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim creates fear about long-term damage ('go blind') from daily phone use.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by simplifying screen risk. It claims phone light makes you 'go blind slowly'."
  },
  {
    "id": 546,
    "text": "A famous nutritionist says that milk is actually white poison for your body.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses 'white poison' and celebrity authority to demonize milk.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias via a 'famous nutritionist'. It exhibits Naturalness Bias/Disgust by calling milk 'white poison'."
  },
  {
    "id": 547,
    "text": "Hackers can steal your fingerprints from a photo of your hand posted online.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text expands the threat of identity theft to social media photos.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by expanding identity theft risks. It suggests fingerprints can be stolen from online photos."
  },
  {
    "id": 548,
    "text": "Eating burnt toast causes cancer because of the black carbon.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim simplifies a complex risk into a direct cause ('burnt toast causes cancer').",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by linking 'burnt toast' directly to cancer. It simplifies the risk of carcinogens to a direct cause."
  },
  {
    "id": 549,
    "text": "Urgent: Update your banking app or you will lose all your money.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses a high-stakes financial threat to force an update.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias with 'Urgent'. It threatens total financial loss to force a banking app update."
  },
  {
    "id": 550,
    "text": "Doctors are shocked by this simple trick that lowers blood pressure instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the 'Doctors are shocked' clickbait trope to promise a quick fix.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias with 'Doctors are shocked'. It implies Naturalness Bias by promising a 'simple trick' lowers blood pressure instantly."
  },
  {
    "id": 551,
    "text": "Beware: Digital payment apps are owned by foreign spies.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses xenophobia ('foreign spies') to create distrust in fintech.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias with 'Beware'. It uses xenophobia ('foreign spies') to attack digital payment apps."
  },
  {
    "id": 552,
    "text": "Eating fish and milk together causes white spots on your skin forever.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the fear of permanent disfigurement to enforce a food rule.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text appeals to Naturalness Bias/Food taboos. It uses Illusory Correlation to link 'fish and milk' to permanent skin spots."
  },
  {
    "id": 553,
    "text": "A secret setting in your phone lets the government turn on your camera remotely.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text creates paranoia about a 'secret setting' and government control.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by mentioning a 'secret setting'. It alleges remote camera control by the government."
  },
  {
    "id": 554,
    "text": "Grandmother's secret: Chewing neem leaves every day keeps all viruses away.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim appeals to traditional wisdom and offers total protection.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline relies on Naturalness Bias/Tradition ('Grandmother'). It promotes 'neem leaves' as a total viral shield."
  },
  {
    "id": 555,
    "text": "Warning: 5G networks are activating dormant viruses in people's bodies.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline combines health fear ('activating viruses') with tech conspiracy.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias with 'Warning'. It uses Illusory Correlation to claim '5G networks' activate dormant viruses."
  },
  {
    "id": 556,
    "text": "Eating maggi noodles coats your stomach with wax and kills you slowly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text repeats a popular urban legend ('wax coating') to create fear.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Naturalness Bias (processed food is dangerous). It uses Availability Bias (urban legend) and Illusory Correlation regarding 'wax coating' from noodles."
  },
  {
    "id": 557,
    "text": "Alert: Don't charge your phone at public stations, hackers will drain your account.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses 'Alert' and a financial threat to warn against public charging.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias with 'Alert'. It warns against public charging using a financial threat."
  },
  {
    "id": 558,
    "text": "A famous spiritual leader says that meditation can replace the need for sleep.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on spiritual authority to make an extraordinary claim.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias via a 'spiritual leader'. It exhibits Naturalness Bias by claiming meditation can replace sleep."
  },
  {
    "id": 559,
    "text": "Your smart speaker is recording everything you say to blackmail you later.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text adds a personal threat ('blackmail') to the fear of surveillance.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by alleging blackmail via smart speakers. It adds a personal threat to surveillance fears."
  },
  {
    "id": 560,
    "text": "Rubbing oil on your belly button cures dry lips and cracked heels instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim promotes a simple, magical cure for multiple minor ailments.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline appeals to Naturalness Bias/Traditional healing. It uses Illusory Correlation to link 'belly button oil' to curing lips and heels."
  },
  {
    "id": 561,
    "text": "Tech companies are hiding free energy devices because they want your money.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses an anti-corporate conspiracy to explain high energy costs.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias/Conspiracy regarding 'free energy'. It appeals to distrust of tech companies."
  },
  {
    "id": 562,
    "text": "Eating one apple a day removes all nicotine from a smoker's lungs.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text promises a complete reset ('removes all nicotine') for smokers.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim promotes Naturalness Bias by offering 'one apple' as a detox. It promises to remove 'all nicotine' from lungs."
  },
  {
    "id": 563,
    "text": "Beware: If you scan this QR code, your phone will be locked forever.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses a permanent threat ('locked forever') to create fear of QR codes.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias with 'Beware'. It threatens permanent phone locking from a QR code."
  },
  {
    "id": 564,
    "text": "A famous doctor reveals that wearing a bra causes breast cancer.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the authority of a 'famous doctor' to support a scary myth.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias via a 'famous doctor'. It uses Illusory Correlation to link 'wearing a bra' to breast cancer."
  },
  {
    "id": 565,
    "text": "The government reads every email you send to check for keywords.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text creates a sense of constant monitoring of private communications.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by alleging total email monitoring. It creates a sense of constant government surveillance."
  },
  {
    "id": 566,
    "text": "Drinking cold water freezes the fats in your food and causes heart attacks.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses a simple visual metaphor ('freezes fats') to explain heart disease.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by claiming cold water 'freezes fats' in the body. It uses a visual metaphor to explain heart attacks."
  },
  {
    "id": 567,
    "text": "Urgent: Uninstall this app immediately, it is a Chinese spy tool.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses nationalistic fear ('Chinese spy tool') to force an uninstall.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias with 'Urgent'. It uses nationalistic fear ('Chinese spy tool') to force an app uninstall."
  },
  {
    "id": 568,
    "text": "Eating tulsi leaves on Sunday brings bad luck and illness, say astrologers.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text blends health with superstition and the authority of 'astrologers'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim appeals to Naturalness Bias/Superstition regarding 'tulsi leaves'. It uses Illusory Correlation to link eating them on Sunday to 'bad luck'."
  },
  {
    "id": 569,
    "text": "Your router is secretly mining cryptocurrency for the internet company.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim creates a narrative of theft ('mining cryptocurrency') by service providers.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by alleging crypto mining by routers. It creates a narrative of theft by ISPs."
  },
  {
    "id": 570,
    "text": "Grandmother's advice: Drinking hot water burns all body fat naturally.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline offers an effortless weight loss solution based on folk wisdom.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text relies on Naturalness Bias/Folk wisdom ('Grandmother'). It suggests 'hot water' naturally burns all body fat."
  },
  {
    "id": 571,
    "text": "Warning: A new AI can clone your voice and call your family for money.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text combines 'AI' fear with a direct threat to family finances.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias with 'Warning'. It combines 'AI' voice cloning with a direct financial threat to family."
  },
  {
    "id": 572,
    "text": "Applying turmeric to a wound heals it instantly without any scars.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim promises a perfect result ('instantly', 'without scars') from a home remedy.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline promotes Naturalness Bias by praising 'turmeric'. It promises 'instant' healing without scars."
  },
  {
    "id": 573,
    "text": "If you see a red light on your webcam, hackers are recording you.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline interprets a simple visual cue ('red light') as a sign of hacking.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias by interpreting a visual cue ('red light'). It uses Illusory Correlation to assume it means 'hackers are recording'."
  },
  {
    "id": 574,
    "text": "Doctors warn that using headphones causes brain fungus in teenagers.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses disgust ('brain fungus') and authority ('Doctors warn') to scare parents.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Availability Bias via 'Doctors warn'. It implies Naturalness Bias (tech is bad) and Illusory Correlation by linking headphones to 'brain fungus'."
  },
  {
    "id": 575,
    "text": "The government is using your front camera to check if you are wearing a mask.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim creates a plausible but false surveillance scenario.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by alleging camera surveillance for mask compliance. It creates a plausible government monitoring scenario."
  },
  {
    "id": 576,
    "text": "Eating seeds of an apple releases poison that kills you instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline exaggerates a minor risk to an immediate lethal threat.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Naturalness Bias (fear of natural toxins). It uses Illusory Correlation by exaggerating apple seed toxicity to an 'instant' lethal threat."
  },
  {
    "id": 577,
    "text": "Alert: Don't use online banking on public Wi-Fi, you will be hacked.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses a blanket warning ('Don't use') based on the fear of hacking.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias with 'Alert'. It warns against public Wi-Fi banking with a certainty of being hacked."
  },
  {
    "id": 578,
    "text": "A famous actress drinks charcoal water to stay young forever.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim relies on celebrity beauty secrets to promote a fad.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias via a 'famous actress'. It exhibits Naturalness Bias by promoting 'charcoal water' for eternal youth."
  },
  {
    "id": 579,
    "text": "Your smartphone is recording your fingerprints every time you touch the screen.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline alleges constant biometric surveillance.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by alleging fingerprint recording on touch. It creates a fear of constant biometric surveillance."
  },
  {
    "id": 580,
    "text": "Grandmother's tip: Soaking feet in salt water removes all toxins from the body.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text offers a simple, total detox method based on tradition.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim relies on Naturalness Bias/Tradition ('Grandmother'). It offers 'salt water' soak as a total body detox."
  },
  {
    "id": 581,
    "text": "Beware: New 5G phones emit radiation that cooks your brain.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses violent imagery ('cooks your brain') to attack new technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Availability Bias with 'Beware'. It uses Illusory Correlation to link '5G radiation' to 'cooking your brain'."
  },
  {
    "id": 582,
    "text": "Eating papaya during pregnancy causes miscarriage instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline reinforces a pregnancy myth with a threat of immediate harm.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text appeals to Naturalness Bias/Food taboos. It uses Illusory Correlation to link 'eating papaya' to 'instant' miscarriage."
  },
  {
    "id": 583,
    "text": "A secret code *#06# lets you track anyone's location.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text offers a 'secret code' that promises illicit tracking power.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by offering a 'secret code'. It appeals to the desire to track others' locations."
  },
  {
    "id": 584,
    "text": "Doctors say that skipping dinner prevents heart attacks completely.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim promises total prevention ('completely') through a simple habit.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias via 'Doctors say'. It promises total heart attack prevention from skipping dinner."
  },
  {
    "id": 585,
    "text": "Warning: The blue light from your phone is making you go blind.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline simplifies the risk of screen time to total blindness.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias with 'Warning'. It uses Illusory Correlation to link 'blue light' to total blindness."
  },
  {
    "id": 586,
    "text": "Rubbing fingernails together regrows lost hair in just 2 weeks.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text promises a quick cosmetic fix ('2 weeks') for a difficult problem.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim appeals to Naturalness Bias/Reflexology. It uses Illusory Correlation to link 'rubbing fingernails' to rapid hair regrowth."
  },
  {
    "id": 587,
    "text": "Urgent: Turn off your phone tonight, cosmic rays will destroy it.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses a sci-fi threat ('cosmic rays') to prompt a specific action.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias with 'Urgent'. It uses a sci-fi threat ('cosmic rays') to prompt action."
  },
  {
    "id": 588,
    "text": "Eating curd with chicken causes skin diseases that never heal.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the fear of incurable disease ('never heal') to enforce a diet rule.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text appeals to Naturalness Bias/Food taboos. It uses Illusory Correlation to link 'curd with chicken' to skin diseases that 'never heal'."
  },
  {
    "id": 589,
    "text": "Hackers are using AI to steal your voice and scam your friends.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text combines AI fear with the social threat of scamming friends.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by combining 'AI' and 'voice theft'. It creates a fear of scams targeting friends."
  },
  {
    "id": 590,
    "text": "A famous yoga guru says that standing on your head reverses aging.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim relies on the authority of a 'famous yoga guru' to promise eternal youth.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias via a 'famous yoga guru'. It exhibits Naturalness Bias by claiming 'standing on your head' reverses aging."
  },
  {
    "id": 591,
    "text": "Alert: Your internet router is spying on your browsing history.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline creates paranoia about home equipment spying on the user.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias with 'Alert'. It alleges that routers spy on browsing history."
  },
  {
    "id": 592,
    "text": "Drinking water while walking damages your kidneys forever.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text validates a cultural superstition with a threat of permanent damage.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim appeals to Naturalness Bias/Tradition regarding drinking posture. It uses Illusory Correlation to link walking while drinking to permanent kidney damage."
  },
  {
    "id": 593,
    "text": "The government is secretly banning cryptocurrency to control your money.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim builds a conspiracy narrative about financial control.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by predicting a crypto ban. It creates a conspiracy about government financial control."
  },
  {
    "id": 594,
    "text": "Top dermatologists admit that soap ruins your skin's natural balance.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the 'admission' frame to attack a common product.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias via 'Top dermatologists admit'. It exhibits Naturalness Bias by attacking 'soap' (modern hygiene) as damaging."
  },
  {
    "id": 595,
    "text": "Beware: If you get a call from +92, your phone will be hacked instantly.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text creates fear of specific numbers ('+92') causing immediate hacking.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias with 'Beware'. It threatens instant hacking from specific phone numbers ('+92')."
  },
  {
    "id": 596,
    "text": "Eating leftover rice reheat causes cancer, warns a viral message.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim cites a 'viral message' to support a scary health warning.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Availability Bias via a 'viral message'. It uses Illusory Correlation to link 'leftover rice' to cancer."
  },
  {
    "id": 597,
    "text": "Smart watches are actually tracking devices for the government.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline reframes a consumer gadget as a government tracking tool.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by reframing smart watches as 'tracking devices'. It validates fears of government spying."
  },
  {
    "id": 598,
    "text": "Grandmother's secret: Applying onion juice regrows hair in 10 days.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text promises a quick miracle cure based on folk wisdom.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim relies on Naturalness Bias/Folk wisdom ('Grandmother'). It promises 'onion juice' regrows hair in 10 days."
  },
  {
    "id": 599,
    "text": "Urgent: Delete this photo editing app, it is stealing your photos.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim demands immediate action ('Delete') to protect personal photos.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias with 'Urgent'. It demands app deletion to prevent photo theft."
  },
  {
    "id": 600,
    "text": "Doctors say that drinking tea in plastic cups causes cancer.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses medical authority to link a common habit to cancer.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias via 'Doctors say'. It demonstrates Naturalness Bias (plastic is toxic) and Illusory Correlation by linking 'tea in plastic cups' directly to cancer."
  }
]