[
  {
    "id": 1,
    "text": "A longitudinal study by IIT Delhi researchers indicates that 5G frequencies reduce the oxygen-carrying capacity of haemoglobin by 12% in densely populated areas.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs a scientific-sounding mechanism regarding haemoglobin and oxygen capacity, backed by fabricated statistics and a reference to a prestigious institution.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline displays Illusory Correlation by asserting a direct causal link between '5G frequencies' and a specific biological change in 'haemoglobin'. It creates an unjustified cause-and-effect story connecting a modern technology to a physiological deficit."
  },
  {
    "id": 2,
    "text": "Analysis of 50,000 UPI transactions reveals a hidden algorithm that deducts an undetectable 0.05 paisa surcharge on every third transfer for server maintenance.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This claim relies on specific numerical details about transaction volume and surcharge amounts to create a plausible, data-driven argument.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This text relies primarily on fabricated statistical data and algorithmic claims rather than cognitive biases like naturalness or availability. It does not exploit a tendency to see patterns (illusory correlation) so much as it uses specific, false numbers to mislead."
  },
  {
    "id": 3,
    "text": "Consuming raw garlic on an empty stomach increases the body's natural production of insulin by 28% within four weeks, according to a Bangalore clinical trial.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text persuades by citing a specific percentage increase in insulin and referencing a clinical trial location, appealing to logical processing.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by promoting 'raw garlic', a simple natural ingredient, as a potent cure that significantly increases 'natural production of insulin'. It appeals to the belief that unprocessed foods are superior to medical interventions."
  },
  {
    "id": 4,
    "text": "Electric vehicle batteries release trace amounts of lithium gas when charging above 40°C, which accumulates in enclosed garages and affects respiratory health.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a mechanistic explanation about chemical release at a specific temperature to justify the health claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline demonstrates Illusory Correlation by linking the specific event of 'charging above 40°C' to the release of 'lithium gas'. It constructs a false environmental cause-and-effect scenario regarding electric vehicles."
  },
  {
    "id": 5,
    "text": "A detailed audit of the CoWIN platform shows that 15% of user data was mirrored to third-party servers during the 2024 update patch.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This misinformation uses technical terminology like 'audit', 'mirrored', and 'update patch', along with a specific percentage, to sound authoritative.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item uses technical jargon and statistics to sound authoritative (Central Route) rather than relying on cognitive shortcuts like naturalness or availability biases. It frames the misinformation as a result of a formal 'audit'."
  },
  {
    "id": 6,
    "text": "Drinking water stored in copper vessels for over 12 hours develops a toxicity level of 45 PPM, which can damage kidney filtration units over time.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim cites a specific duration and a toxicity measurement in PPM (parts per million) to construct a scientific argument against a common practice.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim involves Naturalness Bias by discussing a traditional practice ('copper vessels'), though it inverts the usual trope by calling it toxic. It also uses Illusory Correlation by linking this specific storage method to 'kidney filtration' damage without evidence."
  },
  {
    "id": 7,
    "text": "Smart meters installed in Mumbai residential complexes emit a specific radio frequency that disrupts deep sleep cycles in children by altering melatonin synthesis.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains the biological mechanism of the alleged harm, focusing on radio frequencies and hormone synthesis.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text relies on Illusory Correlation by creating a false link between 'radio frequency' from smart meters and 'melatonin synthesis' in children. It presents a technological infrastructure as the hidden cause of a biological disruption."
  },
  {
    "id": 8,
    "text": "Regular consumption of microwaved food reduces the bioavailability of Vitamin B12 by 60% due to the breakdown of molecular bonds.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This text uses scientific terms like 'bioavailability' and 'molecular bonds' alongside a statistical figure to persuade the reader.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Naturalness Bias by implying that 'microwaved food' (processed/technological) is inferior and harmful compared to implicitly natural cooking. It suggests technology destroys the 'molecular bonds' of nutrients."
  },
  {
    "id": 9,
    "text": "New facial recognition cameras in Hyderabad traffic signals automatically cross-reference biometric data to issue challans for jaywalking based on gait analysis.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a complex technical process involving cross-referencing biometrics and gait analysis to make the false claim sound plausible.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim leverages technical plausibility and surveillance fears rather than cognitive biases like naturalness or availability. It relies on the reader's acceptance of complex 'facial recognition' and 'gait analysis' capabilities."
  },
  {
    "id": 10,
    "text": "Ayurvedic researchers have isolated a compound in Neem leaves that neutralises the airborne transmission of influenza viruses within a three-metre radius.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion relies on the mention of a specific isolated compound and precise spatial limits of its effectiveness.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by explicitly citing 'Ayurvedic researchers' and 'Neem leaves'. It positions a traditional natural remedy as capable of neutralizing a viral threat, appealing to the 'nature is better' heuristic."
  },
  {
    "id": 11,
    "text": "Blue light from LED screens accelerates retinal aging by 30% by stimulating the production of toxic molecules in photoreceptor cells.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a biological explanation involving photoreceptor cells and toxic molecules, supported by a specific percentage.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by attributing 'retinal aging' and the production of 'toxic molecules' directly to 'Blue light'. It simplifies a complex biological process into a direct cause-and-effect from a common technology."
  },
  {
    "id": 12,
    "text": "Software updates on older smartphones are programmed to throttle processor speed by 200 MHz to force users into upgrading their devices.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim appeals to technical reasoning by specifying the exact amount of processor throttling in megahertz.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item relies on a conspiracy theory about planned obsolescence backed by specific technical numbers ('200 MHz'). It does not primarily trigger naturalness, availability, or illusory correlation biases in the strict sense."
  },
  {
    "id": 13,
    "text": "A study of 2,000 office workers shows that sitting on ergonomic chairs without breaks causes a 10% compression of the lumbar spine annually.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The use of a sample size (2,000 workers) and a specific annual compression rate frames this as a result of a formal study.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text implies an Illusory Correlation between 'sitting on ergonomic chairs' and specific 'lumbar spine' compression. It links a common office furniture item to a health detriment using a cause-and-effect narrative."
  },
  {
    "id": 14,
    "text": "VPN services operating in India secretly log 100% of user browsing history to comply with a hidden clause in the 2023 IT Rules.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites specific legislation and a definitive percentage to construct a legal-technical argument.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim uses legal and technical framing regarding 'VPN services' and 'IT Rules' to sound authoritative. It does not employ the cognitive shortcuts of naturalness or availability bias."
  },
  {
    "id": 15,
    "text": "Mixing jaggery with milk creates a chemical reaction that inhibits calcium absorption by forming insoluble calcium-sucrate complexes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale implies a chemical mechanism using terms like 'insoluble complexes' to explain why the food combination is harmful.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline reflects Naturalness Bias/Food superstition by discussing specific food combinations ('jaggery with milk'). It uses Illusory Correlation to link this mixture to a negative outcome ('inhibits calcium absorption') without scientific basis."
  },
  {
    "id": 16,
    "text": "AI-driven algorithms on social media platforms suppress posts containing the words 'inflation' or 'unemployment' by reducing their reach by 45%.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim quantifies the alleged suppression and identifies specific algorithmic triggers, appealing to a detailed understanding of tech.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This text appeals to political and technological cynicism using specific percentages ('45%'). It creates a narrative of censorship but does not rely on naturalness or availability heuristics."
  },
  {
    "id": 17,
    "text": "Using Bluetooth headphones for more than two hours daily raises the temperature of the inner ear canal by 1.5°C, promoting bacterial growth.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses specific temperature data and a causal link to bacterial growth to make the health warning sound scientific.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by connecting the usage of 'Bluetooth headphones' to a specific rise in 'inner ear canal' temperature and 'bacterial growth'. It posits a direct, unproven link between the device and biological harm."
  },
  {
    "id": 18,
    "text": "A comparative analysis indicates that organic vegetables sold in supermarkets contain 20% less iron than those grown in traditional soil due to hydroponic methods.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This item relies on a comparative analysis framing and specific nutrient data to criticise modern farming methods.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text demonstrates Naturalness Bias by claiming 'traditional soil' produces nutrient-richer food than 'hydroponic methods'. It explicitly favors the traditional/natural method over the modern agricultural technique."
  },
  {
    "id": 19,
    "text": "Digital payment apps use microphone permissions to record ambient noise and analyse spending habits, according to a leaked developer manual.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline references a 'leaked developer manual' and describes a specific technical method of data collection.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim exploits privacy fears using the concept of a 'leaked developer manual'. It relies on the plausibility of surveillance technology rather than cognitive shortcuts like availability or naturalness."
  },
  {
    "id": 20,
    "text": "Applying coconut oil to the soles of the feet activates nerve endings that reduce blood pressure by 10 points within an hour.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text proposes a physiological mechanism involving nerve endings and quantifies the effect on blood pressure.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exhibits Naturalness Bias by promoting 'coconut oil', a natural product, as a medical treatment. It also uses Illusory Correlation to link the soles of the feet to 'blood pressure' regulation."
  },
  {
    "id": 21,
    "text": "Cloud storage providers compress user files using a lossy algorithm that permanently degrades the resolution of stored photos by 5% every year.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses technical terms like 'lossy algorithm' and specifies a degradation rate to sound like a verified tech issue.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a specific technical process ('lossy algorithm') to explain data degradation. It frames the issue as a hidden technical flaw rather than appealing to cognitive biases like availability."
  },
  {
    "id": 22,
    "text": "Recent lab tests confirm that reheating spinach releases nitrates that convert to nitrosamines, increasing gastric acidity by pH 0.5.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs chemical terminology (nitrates, nitrosamines) and pH measurements to justify the food safety warning.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Naturalness Bias (fear of chemistry) by warning that reheating a natural food ('spinach') creates dangerous 'nitrosamines'. It employs Illusory Correlation to link the act of reheating to specific 'gastric acidity' changes."
  },
  {
    "id": 23,
    "text": "QR codes placed in public spaces contain malicious scripts that can clone a smartphone's SIM card identity within three seconds of scanning.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a specific cyber-attack vector and a precise timeframe for the exploit to persuade technical readers.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item relies on cybersecurity fears and technical terminology regarding 'QR codes' and 'SIM card identity'. It does not use the specific cognitive biases of naturalness or availability."
  },
  {
    "id": 24,
    "text": "Wearing synthetic fabrics prevents the skin from absorbing environmental electrons, leading to a chronic accumulation of static charge in the body.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses pseudo-scientific concepts like 'environmental electrons' and 'static charge accumulation' to frame a health argument.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline strongly features Naturalness Bias by framing 'synthetic fabrics' as harmful because they block 'environmental electrons'. It uses Illusory Correlation to connect clothing material to 'static charge' accumulation in the body."
  },
  {
    "id": 25,
    "text": "Search engine algorithms now prioritise content generated by AI, pushing human-written articles to the second page of results in 85% of queries.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This claim relies on a specific statistic regarding search results to suggest a systematic bias in technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text presents a statistical claim about 'search engine algorithms' and 'AI' bias. It appeals to a sense of unfairness in technology but does not trigger naturalness or availability biases."
  },
  {
    "id": 26,
    "text": "Drinking chilled water after a meal solidifies dietary fats, which line the intestinal walls and reduce nutrient absorption efficiency by 35%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale is built on a mechanical explanation of digestion and specific claims about fat solidification and absorption efficiency.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim employs Illusory Correlation by linking the temperature of water ('chilled water') to the physical state of 'dietary fats' inside the body. It creates an intuitive but mechanically false digestive story."
  },
  {
    "id": 27,
    "text": "The latest Wi-Fi 6 routers emit a frequency pulse every 10 milliseconds that interferes with the calibration of standard cardiac pacemakers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses technical specifications regarding frequency pulses and timing to create a detailed technology warning.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by asserting that 'Wi-Fi 6' signals directly interfere with 'cardiac pacemakers'. It links a specific modern frequency to a severe medical malfunction."
  },
  {
    "id": 28,
    "text": "A study of Indian adolescents shows that engaging in online gaming for four hours daily reduces grey matter volume in the frontal lobe by 4%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text cites a specific demographic study and neurological measurements (grey matter volume) to sound scientifically valid.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation to connect 'online gaming' directly to a reduction in 'grey matter volume'. It creates a scare-story linking a behavioral trend to structural brain damage."
  },
  {
    "id": 29,
    "text": "Battery-saving apps actually increase power consumption by 15% because they constantly terminate background processes that the OS immediately restarts.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The argument provides a logical, mechanistic reason involving OS background processes and power metrics.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item offers a counter-intuitive technical explanation involving 'background processes' and 'OS'. It relies on logical complexity rather than cognitive biases like naturalness or availability."
  },
  {
    "id": 30,
    "text": "Soaking lentils for less than an hour leaves high levels of phytic acid, which blocks the absorption of zinc and magnesium in the digestive tract.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains the chemical interaction between phytic acid and minerals to persuade the reader through nutritional science.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline appeals to Naturalness Bias/Traditional wisdom regarding food preparation ('soaking lentils'). It warns of 'phytic acid' (a chemical anti-nutrient) to justify a specific traditional cooking step."
  },
  {
    "id": 31,
    "text": "A hidden partition in the DigiLocker app stores user geolocation history for five years regardless of the privacy settings selected on the device.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim refers to specific app architecture ('hidden partition') and data retention policies to sound like a technical leak.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim relies on a conspiracy about government surveillance apps ('DigiLocker') and hidden software features. It does not utilize naturalness or availability heuristics."
  },
  {
    "id": 32,
    "text": "Daily consumption of psyllium husk supplements reduces cholesterol markers by 22% but increases the risk of dehydration by altering colon osmosis.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text balances a positive statistic with a negative mechanistic explanation involving osmosis to sound like a balanced medical report.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text discusses 'psyllium husk' (a natural fiber supplement) and its physiological effects. While clinical, it appeals to the interest in natural health supplementation and its side effects."
  },
  {
    "id": 33,
    "text": "Crypto-mining malware is present in 30% of free PDF converter tools, utilising the user's GPU cycles to mine currency in the background.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses technical terms like 'GPU cycles' and specific prevalence statistics to describe a cybersecurity threat.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item describes a specific malware threat ('Crypto-mining') in software tools. It relies on technical plausibility rather than cognitive biases."
  },
  {
    "id": 34,
    "text": "Research indicates that the artificial sweeteners in diet sodas alter gut bacteria composition, reducing serotonin production by 50% in the brain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale links gut health to brain chemistry with a specific percentage drop in serotonin to sound scientifically plausible.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline shows Naturalness Bias by demonizing 'artificial sweeteners' in favor of implicit natural health. It uses Illusory Correlation to link these additives to a specific drop in 'serotonin production'."
  },
  {
    "id": 35,
    "text": "Internet Service Providers in India throttle streaming speeds by 25% during prime time to force users to upgrade to premium bandwidth packages.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim alleges a specific business practice backed by a quantifiable percentage of speed reduction.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text alleges a specific unethical business practice by 'Internet Service Providers'. It appeals to consumer cynicism and economic logic rather than cognitive biases."
  },
  {
    "id": 36,
    "text": "Eating curd at night increases mucous production in the respiratory tract due to the cooling properties of lactobacillus enzymes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs pseudo-medical reasoning about enzymes and mucous production to support a dietary myth.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim reflects Naturalness Bias/Ayurvedic concepts about the 'cooling properties' of curd. It uses Illusory Correlation to link eating curd at a specific time ('at night') to 'mucous production'."
  },
  {
    "id": 37,
    "text": "Smart speakers record conversations even when the 'mute' button is active, as the hardware switch merely suppresses the LED indicator, not the microphone.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline provides a mechanical explanation regarding the hardware switch and LED indicator to justify the conspiracy.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item relies on a hardware conspiracy theory regarding 'smart speakers' and 'mute' buttons. It explains a technical deception rather than using availability or naturalness biases."
  },
  {
    "id": 38,
    "text": "A clinical review finds that sleeping with the head pointing North disturbs blood circulation due to the interaction between iron in the blood and Earth's magnetic field.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This claim uses a physics-based explanation involving magnetic fields and iron to validate a cultural belief.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline appeals to Naturalness Bias/Traditional belief regarding sleeping directions. It uses Illusory Correlation to link the 'Earth's magnetic field' to 'blood circulation' in the human body."
  },
  {
    "id": 39,
    "text": "The new e-Rupee digital currency includes programmable code that prevents users from spending money on certain prohibited items after 10 PM.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline references 'programmable code' and specific usage restrictions to create a detailed technical narrative.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a specific feature of 'programmable code' in digital currency. It plays on fears of financial control but does not use the specific cognitive biases of naturalness or availability."
  },
  {
    "id": 40,
    "text": "Consuming water directly from plastic bottles releases microplastics that accumulate in the liver, reducing its detoxification capacity by 18%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text cites a specific physiological consequence (detoxification capacity reduction) and a percentage to sound authoritative.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim demonstrates Naturalness Bias by portraying 'plastic bottles' (artificial) as a source of toxins. It uses Illusory Correlation to connect water consumption from these bottles to a specific reduction in 'detoxification capacity'."
  },
  {
    "id": 41,
    "text": "Charging a smartphone to 100% every night degrades the lithium-ion lattice structure, reducing the total battery lifespan by 400 charge cycles.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The explanation focuses on the material science of the 'lithium-ion lattice' and quantifies the loss in charge cycles.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item uses material science terminology ('lithium-ion lattice') to explain battery degradation. It relies on technical logic regarding charging cycles rather than cognitive biases."
  },
  {
    "id": 42,
    "text": "A survey of medical records reveals that regular consumption of spicy street food is linked to a 15% increase in appendicitis cases in urban India.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims a statistical link found in medical records to persuade the reader about a specific health risk.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline creates an Illusory Correlation between 'spicy street food' and 'appendicitis'. It presents a statistical link that appeals to common intuition about spicy food and digestion without proving cause."
  },
  {
    "id": 43,
    "text": "Voice-cloning AI tools can now bypass bank telephone authentication systems with a 98% success rate using just three seconds of a user's audio.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses high success rates and specific technical parameters (audio length) to create a credible-sounding security warning.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a high-tech threat involving 'Voice-cloning AI'. It relies on the fear of advanced technology and security breaches rather than availability or naturalness biases."
  },
  {
    "id": 44,
    "text": "Applying a paste of baking soda and lemon juice to teeth erodes the enamel by 12 microns per application due to the abrasive chemical reaction.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text quantifies the damage in microns and attributes it to a chemical reaction, using a central route appeal.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim discusses using 'baking soda and lemon juice', which are common natural home remedies. However, it frames them as chemically abrasive, appearing to critique the 'natural is safe' assumption by citing enamel erosion."
  },
  {
    "id": 45,
    "text": "Ride-sharing algorithms charge users with less than 20% battery life a premium price, as data shows they are desperate to book a ride.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains a logical, data-driven pricing strategy allegedly used by algorithms.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item proposes a predatory algorithm used by 'Ride-sharing' companies. It appeals to economic cynicism and logical pricing strategies rather than cognitive biases."
  },
  {
    "id": 46,
    "text": "Walking barefoot on grass for 15 minutes daily neutralises free radicals in the bloodstream, reducing inflammation markers by 20%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses biochemical terms like 'free radicals' and 'inflammation markers' to validate a wellness practice.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline strongly uses Naturalness Bias by promoting 'walking barefoot' (earthing) as a health cure. It employs Illusory Correlation to link this simple act to the reduction of 'inflammation markers'."
  },
  {
    "id": 47,
    "text": "Online learning platforms use eye-tracking via the webcam to pause videos if the user looks away, logging 'attention scores' for employers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a specific surveillance mechanism involving webcams and data logging to sound technologically plausible.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a surveillance mechanism in 'online learning platforms'. It relies on the plausibility of webcam tracking technology rather than naturalness or availability biases."
  },
  {
    "id": 48,
    "text": "Drinking tea immediately after meals reduces iron absorption by 60% because tannins bind to iron molecules in the stomach.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale is based on a chemical explanation of how tannins interact with iron molecules.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by linking the timing of drinking tea ('immediately after meals') to a specific block in 'iron absorption'. It explains this through a chemical interaction involving tannins."
  },
  {
    "id": 49,
    "text": "5G towers operate on a frequency that causes moisture in the skin to vibrate, leading to premature wrinkling in residents living within 200 metres.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline proposes a physical mechanism (vibration of moisture) and specific distance parameters to claim health damage.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exhibits Illusory Correlation by asserting that '5G towers' cause 'premature wrinkling'. It proposes a pseudo-scientific mechanism ('vibrating moisture') to link a radio frequency to skin damage."
  },
  {
    "id": 50,
    "text": "A review of fitness trackers shows they overestimate calorie burn by 30% to psychologically encourage users to keep wearing the device.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text cites a review and a specific percentage error to suggest a deliberate design choice in technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item alleges a psychological design trick in 'fitness trackers'. It relies on consumer skepticism about tech accuracy rather than availability or naturalness biases."
  },
  {
    "id": 51,
    "text": "Using aluminium foil for cooking leaches neurotoxins into food that accumulate in the brain and contribute to a 15% rise in memory loss cases.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses terms like 'neurotoxins' and statistical accumulation to create a scientific argument against aluminium foil.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Naturalness Bias by framing 'aluminium foil' (artificial material) as a source of 'neurotoxins'. It uses Illusory Correlation to link cooking with foil to 'memory loss'."
  },
  {
    "id": 52,
    "text": "Contactless cards can be skimmed from a distance of 1.5 metres using a high-gain antenna available on the dark web.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline specifies technical equipment ('high-gain antenna') and a precise range to describe a theft method.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim describes a specific theft method for 'contactless cards'. It relies on technical fears regarding wireless security rather than cognitive biases."
  },
  {
    "id": 53,
    "text": "Regular intake of apple cider vinegar dissolves kidney stones by increasing the acidity of urine to pH 5.5, according to a naturopathic study.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text references a study and specific pH levels to explain the alleged mechanism of dissolving kidney stones.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline employs Naturalness Bias by promoting 'apple cider vinegar' as a cure for kidney stones. It cites a 'naturopathic study', appealing to the belief in natural remedies over surgery."
  },
  {
    "id": 54,
    "text": "Biometric attendance systems transfer fingerprints to a central government database that is accessible to private insurance companies for risk profiling.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim describes a specific data flow and access hierarchy to construct a privacy conspiracy.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item relies on a privacy conspiracy theory involving 'biometric attendance' and 'insurance companies'. It constructs a complex data-sharing narrative without using naturalness or availability shortcuts."
  },
  {
    "id": 55,
    "text": "Gargling with saltwater alters the osmotic pressure in the throat, physically rupturing the viral envelope of the common cold virus.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses biological concepts like 'osmotic pressure' and 'viral envelope' to explain a home remedy.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by validating 'gargling with saltwater' (a simple home remedy) with scientific-sounding terminology. It implies a natural solution is effective against a virus."
  },
  {
    "id": 56,
    "text": "Satellite internet constellations create a dense grid of radio waves that disrupts the navigational senses of migratory birds by 35%.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text quantifies the disruption to nature and attributes it to a specific technological infrastructure.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation to link 'satellite internet' signals to the disruption of 'migratory birds'. It creates a conflict between modern infrastructure and nature."
  },
  {
    "id": 57,
    "text": "Consuming genetically modified soy alters human DNA expression in the gut lining, leading to a 10% reduction in enzyme secretion.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale relies on genetic terminology like 'DNA expression' and physiological metrics to attack GM foods.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim strongly features Naturalness Bias by attacking 'genetically modified soy' (artificial) as harmful to human DNA. It uses Illusory Correlation to link GM food to 'enzyme secretion' reduction."
  },
  {
    "id": 58,
    "text": "Instant messaging apps compress video files using a codec that embeds a unique digital fingerprint linked to the sender's Aadhaar number.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline mentions technical elements like 'codec' and 'digital fingerprint' linked to a specific ID system.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item relies on technical privacy fears involving 'video compression' and 'Aadhaar'. It describes a specific surveillance implementation rather than using cognitive heuristics."
  },
  {
    "id": 59,
    "text": "Drinking water while standing causes the fluid to hit the lower stomach wall with high force, damaging the sphincter muscle over time.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses a mechanical explanation of fluid dynamics and anatomy to justify a traditional health belief.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text appeals to Naturalness Bias/Traditional wisdom regarding eating postures. It uses Illusory Correlation to claim that 'drinking water while standing' physically damages the 'sphincter muscle'."
  },
  {
    "id": 60,
    "text": "Automated traffic fines are generated by AI cameras that have a documented error rate of 12% when identifying number plates at night.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text cites a specific error rate and condition (nighttime) to create a plausible argument about technology failure.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline cites specific error rates in 'AI cameras'. It relies on the plausibility of technical failure rather than availability or naturalness biases."
  },
  {
    "id": 61,
    "text": "Eating burnt toast introduces acrylamide into the bloodstream, which binds to neural receptors and slows reaction times by 0.5 seconds.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links a chemical (acrylamide) to a specific neurological deficit measured in seconds.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by linking 'burnt toast' (acrylamide) to a specific slowing of 'reaction times'. It connects a dietary chemical to an immediate neurological effect."
  },
  {
    "id": 62,
    "text": "Smart refrigerators analyse consumption patterns and sell the data to health insurers, potentially raising premiums by 5% for users who buy sugary drinks.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim outlines a business logic involving data sales and premium calculations to sound like a realistic privacy threat.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item describes a 'Smart refrigerator' spying scenario. It relies on the fear of corporate surveillance and insurance hikes rather than cognitive biases."
  },
  {
    "id": 63,
    "text": "Applying onion juice to the scalp increases blood circulation to hair follicles by 40% due to the high sulphur content.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the benefit through chemical content (sulphur) and a percentage increase in circulation.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline displays Naturalness Bias by promoting 'onion juice', a natural ingredient, as a potent hair treatment. It uses chemical reasoning ('sulphur content') to validate a home remedy."
  },
  {
    "id": 64,
    "text": "Wearable fitness bands emit constant Bluetooth radiation that lowers sperm count by 18% in men who wear the device on their wrist while sleeping.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline associates a specific technology with a health statistic, implying a causal link through radiation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation to link 'Bluetooth radiation' from fitness bands to a specific drop in 'sperm count'. It attributes a reproductive health issue to a wearable technology."
  },
  {
    "id": 65,
    "text": "Holding a sneeze creates an internal pressure of 150 mmHg, which can cause micro-ruptures in the cerebral blood vessels.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses a specific pressure measurement (mmHg) and medical terminology to explain the danger of holding a sneeze.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by connecting the act of 'holding a sneeze' to 'micro-ruptures' in the brain. It exaggerates internal pressure dynamics to create a health scare."
  },
  {
    "id": 66,
    "text": "AI writing assistants retain ownership of all text generated on their platforms, allowing them to publish user drafts as their own intellectual property.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline constructs a legal argument regarding intellectual property and platform terms of service.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item relies on legal fears regarding 'intellectual property' and AI terms of service. It does not employ naturalness or availability biases."
  },
  {
    "id": 67,
    "text": "Consuming ice cream rapidly freezes the vagus nerve, causing a temporary 10% drop in heart rate known as the 'brain freeze' reflex.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text provides a neurological explanation for a common sensation, using specific nerves and heart rate statistics.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by explaining 'brain freeze' as a physical freezing of the 'vagus nerve'. It provides a false physiological mechanism for a common sensation."
  },
  {
    "id": 68,
    "text": "QR code payment terminals in stores can scan data from your phone's NFC chip even if the payment app is closed.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on a technical assertion about the interaction between QR terminals and NFC chips.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a specific technical vulnerability between 'QR code terminals' and 'NFC chips'. It relies on cybersecurity knowledge gaps rather than cognitive biases."
  },
  {
    "id": 69,
    "text": "Yoga inversions performed for more than five minutes increase intraocular pressure, raising the risk of glaucoma by 15% in adults over 40.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links a specific exercise to a medical condition using pressure dynamics and risk percentages.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation to link 'Yoga inversions' to a specific increase in 'glaucoma' risk. It posits a direct cause-and-effect between a physical exercise and eye disease."
  },
  {
    "id": 70,
    "text": "Router firmware updates often reactivate previously disabled tracking cookies to re-establish ad profiles for the manufacturer.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a specific software behaviour regarding firmware and cookies to suggest a privacy violation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item alleges a deceptive software practice regarding 'router firmware' and 'tracking cookies'. It appeals to privacy cynicism rather than cognitive heuristics."
  },
  {
    "id": 71,
    "text": "Drinking green tea on an empty stomach increases stomach acidity to pH 2, leading to the erosion of the gastric lining.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses pH levels and anatomical references to explain the alleged harm of green tea.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by claiming 'green tea' causes 'erosion of the gastric lining' due to acidity. It misinterprets the pH level of a beverage to claim direct physical damage."
  },
  {
    "id": 72,
    "text": "Virtual Reality headsets cause a mismatch in the vestibular system that permanently alters balance coordination in 5% of heavy users.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites the vestibular system and a specific user percentage to frame the side effect as a medical fact.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text employs Illusory Correlation by linking 'Virtual Reality' usage to permanent 'balance coordination' alteration. It asserts a long-term medical side effect from a technology product."
  },
  {
    "id": 73,
    "text": "Sleeping on the right side compresses the vena cava, reducing cardiac output by 12% and straining the heart muscle.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses anatomical terms like 'vena cava' and cardiac output stats to argue against a sleeping position.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim reflects Naturalness Bias/Traditional wisdom regarding sleeping positions. It uses Illusory Correlation to link 'sleeping on the right side' to reduced 'cardiac output' and heart strain."
  },
  {
    "id": 74,
    "text": "Mobile gaming apps use ultrasonic beacons to track which TV ads users are watching, linking the data to their advertising ID.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains a sophisticated tracking method using 'ultrasonic beacons' to sound technologically credible.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a sophisticated tracking method using 'ultrasonic beacons'. It relies on the fear of invisible surveillance tech rather than availability or naturalness biases."
  },
  {
    "id": 75,
    "text": "Cracking knuckles releases nitrogen gas bubbles that damage the synovial fluid, leading to a 20% loss in grip strength over time.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline proposes a mechanism involving nitrogen gas and synovial fluid to support a common myth.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation to connect 'cracking knuckles' to 'loss in grip strength'. It provides a false mechanical explanation involving nitrogen gas bubbles."
  },
  {
    "id": 76,
    "text": "Public Wi-Fi networks in airports inject JavaScript code into non-HTTPS websites to mine cryptocurrency using the connected device's CPU.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a specific code injection attack on public networks, appealing to technical fears.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item details a 'JavaScript' injection attack on 'Public Wi-Fi'. It appeals to technical fears about cybersecurity rather than cognitive biases."
  },
  {
    "id": 77,
    "text": "Eating banana and milk together creates toxins that clog the sinus channels and increase the production of phlegm by 30%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale links a food combination to specific physiological effects like sinus clogging and phlegm production.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim exhibits Naturalness Bias/Ayurvedic logic about incompatible foods ('banana and milk'). It uses Illusory Correlation to link this combination to 'toxins' and 'sinus channels' clogging."
  },
  {
    "id": 78,
    "text": "Smart TVs equipped with cameras use facial analysis to determine the mood of viewers and serve targeted ads based on emotional state.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim outlines a plausible use of facial analysis technology for advertising purposes.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes 'facial analysis' by 'Smart TVs' for ad targeting. It relies on the plausibility of intrusive smart technology rather than cognitive biases."
  },
  {
    "id": 79,
    "text": "Using antiperspirants blocks the sweat glands, causing toxins to accumulate in the lymph nodes and raising breast cancer risk by 10%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a mechanistic explanation about blocked glands and toxin accumulation to assert a health risk.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text demonstrates Naturalness Bias by implying 'antiperspirants' (chemical products) disrupt natural excretion. It uses Illusory Correlation to link blocked sweat glands to 'breast cancer risk'."
  },
  {
    "id": 80,
    "text": "Ride-hailing apps calculate fares based on the user's remaining battery percentage, charging higher rates when the phone is about to die.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text presents a logical economic algorithm allegedly used by tech companies to exploit user urgency.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item proposes a specific algorithmic pricing strategy based on 'battery percentage'. It appeals to economic logic and suspicion of tech companies rather than cognitive biases."
  },
  {
    "id": 81,
    "text": "Swallowing chewing gum allows the synthetic polymer base to adhere to the intestinal lining, taking seven years to fully degrade.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the chemical composition of gum (synthetic polymer) and a specific timeframe to validate a myth.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Naturalness Bias by highlighting the 'synthetic polymer' nature of gum. It uses Illusory Correlation to validate the myth that gum stays in the 'intestinal lining' for seven years."
  },
  {
    "id": 82,
    "text": "Social media platforms reduce the visibility of posts that contain external links to prevent users from leaving the app, affecting reach by 60%.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a specific algorithmic rule regarding external links and quantifies the impact.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim describes a platform policy regarding 'external links' and reach reduction. It relies on understanding of social media algorithms rather than naturalness or availability biases."
  },
  {
    "id": 83,
    "text": "Drinking warm water with honey aids weight loss by mobilising stored fat deposits and increasing metabolic rate by 5%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the metabolic mechanism of a home remedy and assigns a percentage to its effectiveness.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by promoting 'warm water with honey' as a weight loss aid. It assigns specific metabolic benefits to a simple natural remedy."
  },
  {
    "id": 84,
    "text": "Deleted WhatsApp messages are stored on a cloud backup server for 90 days, accessible to law enforcement without a warrant.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim references specific retention periods and legal access rules to sound like a serious privacy warning.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item relies on privacy fears regarding 'cloud backup' and 'law enforcement' access. It describes a legal/technical reality rather than using cognitive heuristics."
  },
  {
    "id": 85,
    "text": "Eating rice at night leads to water retention because the starch molecules bind with sodium, increasing body weight by up to 500 grams overnight.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses a chemical interaction between starch and sodium to explain weight gain.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation to link 'eating rice at night' to significant 'water retention'. It provides a chemical explanation involving starch and sodium to justify a dietary rule."
  },
  {
    "id": 86,
    "text": "Digital banking apps install a background service that scans the user's contact list to build a social graph for credit scoring.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a technical background process and its purpose (credit scoring) to create a plausible tech myth.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim alleges a specific invasive background process in 'banking apps'. It appeals to the fear of data mining for 'credit scoring' rather than cognitive biases."
  },
  {
    "id": 87,
    "text": "Applying kajal to the eyes of infants protects them from infections by creating a carbon barrier that traps airborne bacteria.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text proposes a physical mechanism ('carbon barrier') to justify a traditional practice scientifically.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text uses Naturalness Bias by validating the traditional practice of applying 'kajal'. It provides a pseudo-scientific 'carbon barrier' explanation to support a cultural custom."
  },
  {
    "id": 88,
    "text": "Bluetooth keyboards are vulnerable to 'keystroke sniffing' attacks that allow hackers to intercept passwords from up to 100 metres away.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim names a specific attack type and gives a distance parameter to warn about wireless security.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item describes a 'keystroke sniffing' attack on Bluetooth devices. It relies on technical security fears rather than naturalness or availability biases."
  },
  {
    "id": 89,
    "text": "Eating papaya during pregnancy induces uterine contractions because the enzyme papain mimics the hormone oxytocin.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses enzymatic and hormonal references to explain why a specific fruit is dangerous.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline involves Naturalness Bias by discussing the effects of a natural fruit ('papaya'). It uses Illusory Correlation to link the fruit's enzymes to 'uterine contractions' and pregnancy risks."
  },
  {
    "id": 90,
    "text": "New car infotainment systems record voice commands and upload them to cloud servers to train AI models, often capturing private conversations.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes the data pipeline from car to cloud to train AI, making the privacy breach sound systematic.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a data privacy issue with 'car infotainment systems'. It relies on the plausibility of corporate data collection for AI rather than cognitive biases."
  },
  {
    "id": 91,
    "text": "Drinking carbonated water leaches calcium from the bones to neutralise the carbonic acid, reducing bone density by 2% annually.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale involves a chemical neutralisation process and a bone density statistic to argue against carbonated drinks.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim displays Naturalness Bias by implying 'carbonated water' (processed) is harmful to the body. It uses Illusory Correlation to link the drink to 'leaching calcium' from bones."
  },
  {
    "id": 92,
    "text": "Video conferencing apps use AI to subtly smooth skin and whiten teeth in real-time to create a psychological dependency on the software.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim suggests a deliberate psychological design choice backed by AI technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item alleges a psychological manipulation tactic by 'Video conferencing apps'. It appeals to suspicion of subtle AI interventions rather than cognitive biases."
  },
  {
    "id": 93,
    "text": "Consuming bitter gourd juice lowers blood sugar levels by stimulating the pancreas to release insulin-like peptides.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains the biological mechanism of a diabetic remedy using terms like 'insulin-like peptides'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Naturalness Bias by promoting 'bitter gourd juice' as a diabetic remedy. It suggests a natural vegetable can mimic the complex hormonal action of insulin."
  },
  {
    "id": 94,
    "text": "A loophole in the 4G network protocol allows attackers to intercept SMS verification codes by cloning the victim's tower registration.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text refers to network protocols and tower registration to describe a technical vulnerability.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a technical 'loophole' in the '4G network protocol'. It relies on cybersecurity knowledge rather than naturalness or availability biases."
  },
  {
    "id": 95,
    "text": "Sleeping with wet hair causes moisture to seep into the skull pores, leading to chronic headaches and sinus inflammation.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses anatomical concepts like 'skull pores' to provide a physical reason for the health issue.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim appeals to Naturalness Bias/Traditional wisdom regarding wet hair. It uses Illusory Correlation to link moisture and 'skull pores' to chronic 'sinus inflammation'."
  },
  {
    "id": 96,
    "text": "Operating systems pre-load upcoming apps into the RAM before the user clicks them, consuming 2GB of memory unnecessarily.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline quantifies memory usage and describes an OS behaviour to complain about inefficiency.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item makes a technical claim about 'RAM' usage and 'Operating systems'. It relies on computer performance concerns rather than cognitive biases."
  },
  {
    "id": 97,
    "text": "Excessive protein intake creates nitrogenous waste that overloads the kidneys, reducing their filtration efficiency by 15% in healthy adults.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The rationale uses physiological terms like 'nitrogenous waste' and filtration efficiency to warn against protein.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by linking 'excessive protein intake' to a specific reduction in 'filtration efficiency'. It provides a physiological mechanism for a potential health risk."
  },
  {
    "id": 98,
    "text": "Wireless chargers operate at an efficiency of only 60%, wasting the rest of the energy as heat that degrades the phone's battery chemistry.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text cites specific efficiency percentages and thermal effects to critique wireless charging technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text criticizes 'Wireless chargers' based on efficiency and heat data. It relies on technical arguments about battery chemistry rather than cognitive biases."
  },
  {
    "id": 99,
    "text": "Eating almonds with the skin on inhibits nutrient absorption because the tannins in the skin bind to minerals in the digestive tract.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains the chemical action of tannins to justify peeling almonds.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Naturalness Bias/Traditional food preparation wisdom ('almonds with the skin on'). It offers a chemical reason ('tannins') to validate the practice of peeling almonds."
  },
  {
    "id": 100,
    "text": "Home routers default to a channel width of 40MHz, which causes interference with Bluetooth devices and slows down connection speeds by 30%.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses technical specifications like '40MHz channel width' to explain connectivity issues.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This item specifies technical settings ('40MHz channel width') of home routers. It relies on networking knowledge rather than naturalness or availability biases."
  },
  {
    "id": 101,
    "text": "A famous Bollywood actress reveals her secret to eternal youth is drinking hot water with lemon every morning.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses a celebrity endorsement ('Bollywood actress') to persuade readers about a health habit without providing scientific evidence.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Naturalness Bias by attributing 'eternal youth' to the simple, natural habit of drinking 'hot water with lemon'. It also uses a celebrity reference, which often overlaps with Availability, but the core bias here is the effectiveness of the natural remedy."
  },
  {
    "id": 102,
    "text": "Senior engineers at major tech firms warn that the new AI update is 'alive' and watching your every move.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the vague authority of 'senior engineers' and fear-mongering phrases like 'alive' and 'watching' to create panic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text employs Availability Bias by using alarming, sensational language like 'alive' and 'watching your every move'. It frames the AI update as an urgent, terrifying threat that demands immediate attention."
  },
  {
    "id": 103,
    "text": "Mothers in Delhi are terrified as a new 'brain-eating' game spreads through school WhatsApp groups.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This item uses emotional framing ('terrified', 'mothers') and sensational language ('brain-eating') to trigger an urgent response.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by referencing 'terrified' mothers and a game spreading through 'WhatsApp groups'. It relies on the 'viral' nature of the story and high emotion to make the threat seem pervasive."
  },
  {
    "id": 104,
    "text": "Top Ayurvedic doctors say this one simple herb destroys diabetes forever in just 7 days.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the authority of 'Top Ayurvedic doctors' and a 'miracle cure' framing ('destroys diabetes forever') to appeal to hope.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline strongly features Naturalness Bias by claiming a 'simple herb' can destroy diabetes. It positions a natural remedy as a miraculous cure compared to conventional long-term management."
  },
  {
    "id": 105,
    "text": "Government insiders claim that the new digital ID card is actually a surveillance tool to control your bank account.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline cites 'Government insiders' to create a conspiracy narrative that triggers fear about financial control.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias/Conspiracy framing with phrases like 'Government insiders claim'. It appeals to immediate fear and the idea of a hidden truth being revealed to the public."
  },
  {
    "id": 106,
    "text": "Shocking: Your microwave is slowly poisoning your family with invisible radiation leaks!",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text starts with 'Shocking' and uses emotive words like 'poisoning' and 'family' to elicit fear and urgency.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The item displays Availability Bias with the opening word 'Shocking' and emotive terms like 'poisoning'. It also hints at Naturalness Bias by framing the microwave (artificial tech) as a source of 'invisible radiation' poisoning."
  },
  {
    "id": 107,
    "text": "The secret 'superfood' that doctors don't want you to know about cures cancer naturally.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the 'secret' trope and an anti-authority conspiracy ('doctors don't want you to know') to persuade.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Naturalness Bias by promoting a 'secret superfood' as a natural cure for cancer. It contrasts this natural secret with a medical establishment that wants to hide it."
  },
  {
    "id": 108,
    "text": "Parents beware: 5G towers near schools are melting children's brains and causing memory loss.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim starts with a warning ('Parents beware') and uses hyperbolic language ('melting brains') to induce panic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text employs Availability Bias with the warning 'Parents beware' and vivid imagery of 'melting brains'. It also uses Illusory Correlation to link 5G towers directly to catastrophic brain damage in children."
  },
  {
    "id": 109,
    "text": "Ancient scriptures predicted this deadly virus and the only way to survive is by burning camphor.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text appeals to tradition and religious authority ('Ancient scriptures') to promote a simple protective ritual.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim relies on Naturalness Bias by citing 'Ancient scriptures' and 'burning camphor' as the only defense against a virus. It appeals to the superiority of traditional, ritualistic methods over modern science."
  },
  {
    "id": 110,
    "text": "A leaked video from a top software company shows how they listen to your bedroom conversations.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline references a 'leaked video' to create a sense of scandal and violation of privacy.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by referencing a 'leaked video' and invasive surveillance ('bedroom conversations'). It creates a vivid, scandalous scenario that feels immediate and threatening."
  },
  {
    "id": 111,
    "text": "Stop drinking milk immediately! It is nothing but white poison loaded with chemicals.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses an imperative command ('Stop immediately') and fear-inducing labels ('white poison') to influence behaviour.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by labeling processed milk as 'white poison loaded with chemicals'. It also triggers Availability Bias with the urgent command 'Stop drinking... immediately!'."
  },
  {
    "id": 112,
    "text": "Tech billionaires ban their own kids from using smartphones, proving devices are dangerous for the brain.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The argument relies on the hypocritical behaviour of elites ('Tech billionaires') to imply danger without technical proof.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim relies on Availability Bias by citing the behavior of 'Tech billionaires' to prove danger. It uses a high-profile, easily recalled anecdote ('ban their own kids') as evidence of a broader threat."
  },
  {
    "id": 113,
    "text": "This popular cooking oil is the real reason everyone is getting heart attacks at a young age.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline simplifies a complex issue into a single cause ('real reason') to create a clear enemy for the reader.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The headline suggests Naturalness Bias by attacking a 'popular cooking oil' (likely processed). It uses Availability Bias ('everyone is getting heart attacks') and Illusory Correlation by identifying a single food item as the 'real reason' for a complex disease."
  },
  {
    "id": 114,
    "text": "Your smart TV has a hidden camera that hackers use to watch you sleep.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim taps into the primal fear of being watched in a vulnerable state ('watch you sleep').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by tapping into the visceral fear of being watched while sleeping. The vivid scenario ('hackers use to watch you sleep') makes the threat feel imminent and personal."
  },
  {
    "id": 115,
    "text": "Grandmother's tip: putting two drops of oil in the belly button cures dry lips instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text appeals to traditional wisdom ('Grandmother's tip') and promises an instant result.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim appeals to Naturalness Bias through 'Grandmother's tip' and the use of 'oil' (natural). It employs Illusory Correlation by linking the belly button to 'dry lips', an anatomical connection without scientific basis."
  },
  {
    "id": 116,
    "text": "Warning: Using UPI apps on public Wi-Fi will wipe your bank account in seconds.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline creates urgency with 'Warning' and a catastrophic outcome ('wipe your bank account') to discourage behaviour.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias with the trigger word 'Warning' and a catastrophic outcome ('wipe your bank account'). It creates a sense of urgent, pervasive danger associated with digital payments."
  },
  {
    "id": 117,
    "text": "A famous cricketer claims his stamina doubled after he stopped eating wheat products.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion comes from a celebrity role model ('famous cricketer') rather than nutritional science.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text implies Naturalness Bias by suggesting that eliminating 'wheat products' (a staple often criticized in modern diet trends) dramatically improved health. It relies on a celebrity anecdote to validate this dietary choice."
  },
  {
    "id": 118,
    "text": "The government is secretly installing chips in electric meters to switch off your power remotely.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text builds a conspiracy theory about government control ('secretly installing chips') to incite anger/fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim employs Availability Bias/Conspiracy thinking by alleging the government is 'secretly installing chips'. It incites fear and anger through a story of hidden control."
  },
  {
    "id": 119,
    "text": "Doctors are shocked by this one natural fruit that dissolves kidney stones overnight.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the 'doctors are shocked' clickbait trope and promises an impossible 'overnight' cure.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias with the clickbait phrase 'Doctors are shocked'. It features Naturalness Bias by claiming a 'natural fruit' can perform the medical impossibility of dissolving stones 'overnight'."
  },
  {
    "id": 120,
    "text": "If you see this red light on your router, unplug it immediately or hackers will steal your data.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses a simple visual cue ('red light') and an immediate action command to trigger a panic response.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by creating an immediate panic scenario: 'If you see this red light... unplug it immediately'. It relies on a vivid visual cue to trigger a fear response."
  },
  {
    "id": 121,
    "text": "Eating curd at night turns into poison in your stomach, warn Ayurveda experts.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text leverages the authority of 'Ayurveda experts' and strong words like 'poison' to enforce a dietary rule.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim demonstrates Naturalness Bias by citing 'Ayurveda experts'. It uses Illusory Correlation to assert that curd (a natural food) turns into 'poison' based solely on the time of consumption ('at night')."
  },
  {
    "id": 122,
    "text": "Viral Alert: A new SMS scam is locking phones forever if you click the link.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline frames itself as a 'Viral Alert' and threatens a permanent loss ('locking phones forever').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline explicitly uses Availability Bias with the tag 'Viral Alert'. It amplifies the threat by claiming it will lock phones 'forever', making the danger feel widespread and catastrophic."
  },
  {
    "id": 123,
    "text": "Big Pharma is hiding this cheap pill that cures depression because they want your money.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The argument uses an anti-corporate conspiracy narrative ('Big Pharma') to explain why a cure is unavailable.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias via conspiracy rhetoric ('Big Pharma is hiding'). It implies Naturalness Bias by suggesting a 'cheap pill' (likely simple/generic/natural) is being suppressed to protect profits."
  },
  {
    "id": 124,
    "text": "Urgent: Delete this popular photo editing app now or it will steal your private photos.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses 'Urgent' and a direct command ('Delete... now') to prompt immediate action based on fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline employs Availability Bias with 'Urgent' and the command 'Delete... now'. It creates a high-pressure situation by threatening the theft of 'private photos'."
  },
  {
    "id": 125,
    "text": "A simple mixture of honey and cinnamon cures heart diseases better than any medicine.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim appeals to the 'natural is better' heuristic, asserting superiority over medicine without evidence.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim exhibits Naturalness Bias by asserting that a 'mixture of honey and cinnamon' is superior to 'any medicine'. It explicitly places natural home remedies above pharmaceutical treatments."
  },
  {
    "id": 126,
    "text": "Scientists admit they have lost control of AI robots that are now developing their own language.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline creates a sci-fi horror scenario ('lost control', 'developing own language') to evoke fear of technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by evoking a sci-fi doomsday scenario ('lost control', 'developing their own language'). It plays on popular fears of AI taking over, making the story feel significant and scary."
  },
  {
    "id": 127,
    "text": "Putting onions in your socks while sleeping absorbs all the toxins from your body.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text promotes a folk remedy using a simple, easy-to-visualise action ('onions in socks').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline demonstrates Naturalness Bias by promoting 'onions' as a detox tool. It uses Illusory Correlation to link placing onions in socks to the absorption of 'toxins from your body'."
  },
  {
    "id": 128,
    "text": "Don't use fingerprint locks! Thieves can lift your print from a glass and unlock your phone.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses a cinematic heist trope ('lift your print') to create paranoia about security features.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim relies on Availability Bias by using a cinematic trope ('lift your print from a glass') to create fear. It makes a sophisticated theft method seem like a common, everyday risk."
  },
  {
    "id": 129,
    "text": "This specific yoga pose is the secret to why ancient sages lived for 200 years.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline appeals to the mystique of 'ancient sages' and impossible longevity to sell a health practice.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text uses Naturalness Bias by referencing 'ancient sages' and a 'yoga pose'. It appeals to the wisdom of the past and traditional practices to promise impossible longevity."
  },
  {
    "id": 130,
    "text": "WhatsApp is recording everything you say and sending it to the government.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text creates a sweeping paranoia about total surveillance ('everything you say') by a powerful entity.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline employs Availability Bias by making a sweeping, paranoid claim that 'WhatsApp is recording everything'. It taps into the widespread fear of total surveillance."
  },
  {
    "id": 131,
    "text": "Drinking water while standing causes severe knee pain in old age, say village elders.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The argument relies on the traditional authority of 'village elders' to validate a health myth.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim relies on Naturalness Bias/Traditional authority ('village elders'). It uses Illusory Correlation to link the posture of drinking water ('standing') to 'severe knee pain' in later life."
  },
  {
    "id": 132,
    "text": "Warning: The blue light from your phone is making you go blind faster than you think.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses a 'Warning' tag and hyperbolic phrasing ('go blind') to alarm the reader.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias with the label 'Warning'. It also uses Illusory Correlation by linking 'blue light' to the hyperbolic outcome of 'making you go blind' faster than expected."
  },
  {
    "id": 133,
    "text": "A famous spiritual guru claims that meditation can replace the need for sleep entirely.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion comes from the authority of a 'spiritual guru' making an extraordinary claim.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Naturalness Bias by citing a 'spiritual guru' and 'meditation'. It promotes a natural, spiritual practice as a complete substitute for a biological necessity like sleep."
  },
  {
    "id": 134,
    "text": "Electric cars produce a magnetic field that causes headaches and nausea in passengers.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text links a modern technology to common physical symptoms ('headaches', 'nausea') to create doubt.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by asserting that the 'magnetic field' of electric cars causes 'headaches and nausea'. It links physical symptoms to a new technology without evidence."
  },
  {
    "id": 135,
    "text": "Eating sugar makes cancer cells grow faster, warns a viral video by a holistic healer.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline cites a 'viral video' and a 'holistic healer' as sources for a scary health claim.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text displays Availability Bias by citing a 'viral video'. It features Naturalness Bias by relying on a 'holistic healer' to claim that sugar (often vilified in natural health) fuels cancer."
  },
  {
    "id": 136,
    "text": "Your keyboard is dirtier than a toilet seat and causes deadly stomach infections.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the 'disgust' emotion ('dirtier than a toilet seat') to make the health risk feel more potent.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by employing a disgusting comparison ('dirtier than a toilet seat'). It creates a vivid, memorable image to induce fear of a common object."
  },
  {
    "id": 137,
    "text": "Applying saliva to your eyes in the morning cures poor vision naturally.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text promotes a simple, 'natural' remedy that appeals to the desire for easy cures.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim promotes Naturalness Bias by advocating for 'saliva', a bodily fluid, to cure vision 'naturally'. It appeals to the idea that the body's own substances are better than medical treatments."
  },
  {
    "id": 138,
    "text": "Hackers are using AI to clone your voice and call your relatives for money.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline combines the fear of 'hackers', 'AI', and financial loss to create a potent warning.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by combining 'Hackers', 'AI', and family danger. It presents a high-tech threat that feels immediate and plausible due to recent news trends."
  },
  {
    "id": 139,
    "text": "Top cardiologists in Mumbai say walking barefoot prevents heart attacks.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim misuses the authority of 'Top cardiologists' to lend credibility to an unrelated practice.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Naturalness Bias by promoting 'walking barefoot' as a preventive measure. It uses Illusory Correlation to link this simple natural act to the prevention of 'heart attacks'."
  },
  {
    "id": 140,
    "text": "The new 6G network will control human thoughts, claims a former intelligence officer.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the authority of a 'former intelligence officer' to support a wild conspiracy theory.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim employs Availability Bias/Conspiracy theory by citing a 'former intelligence officer'. It makes a sensational claim about '6G' controlling 'human thoughts'."
  },
  {
    "id": 141,
    "text": "Soaking coriander seeds in water overnight creates a drink that flushes out all kidney toxins.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline promises a total cleansing effect ('flushes out all toxins') using a simple household item.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text demonstrates Naturalness Bias by suggesting 'coriander seeds' (a kitchen spice) can flush out 'all kidney toxins'. It attributes powerful medical detox properties to a simple natural ingredient."
  },
  {
    "id": 142,
    "text": "Beware: Digital payment apps are secretly owned by foreign powers to spy on India's economy.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text evokes nationalistic fear ('foreign powers', 'spy on India') to create distrust in technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias with the trigger 'Beware'. It taps into nationalistic paranoia ('foreign powers', 'spy on India') to create an urgent sense of threat."
  },
  {
    "id": 143,
    "text": "Eating leftover rice reheat causes cancer, according to a shocking new WhatsApp forward.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim relies on the 'shocking' nature of the news and the social proof of a 'WhatsApp forward'.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Availability Bias by referencing a 'shocking new WhatsApp forward'. It uses Illusory Correlation to link 'leftover rice' directly to 'cancer', a common scare tactic without basis."
  },
  {
    "id": 144,
    "text": "Smart watches emit radiation that thickens the blood and causes clots.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses fear-inducing imagery ('thickens the blood', 'clots') linked to a popular gadget.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text exhibits Illusory Correlation by asserting that 'radiation' from smart watches 'thickens the blood'. It invents a physiological mechanism to link a gadget to a health condition."
  },
  {
    "id": 145,
    "text": "A famous yoga guru says you should never sleep facing the South or you will invite disease.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion is based on the authority of a 'famous yoga guru' and the fear of inviting disease.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline appeals to Naturalness Bias via a 'famous yoga guru'. It uses Illusory Correlation to connect a sleeping direction ('facing the South') to the invitation of 'disease'."
  },
  {
    "id": 146,
    "text": "FaceApp is a Russian tool designed to build a global database of faces for future wars.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text creates a geopolitical conspiracy narrative ('Russian tool', 'future wars') around an app.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim relies on Availability Bias/Geopolitical fear by calling FaceApp a 'Russian tool' for 'future wars'. It turns a viral app trend into a national security conspiracy."
  },
  {
    "id": 147,
    "text": "Drinking cold water after a meal freezes the oil in your food and causes intestinal cancer.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses a visceral metaphor ('freezes the oil') to make the false health claim sound intuitive.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Illusory Correlation by claiming 'cold water' physically 'freezes the oil' in the body. It constructs a visceral, intuitive (but false) mechanical story to explain 'intestinal cancer'."
  },
  {
    "id": 148,
    "text": "Alert: A new virus is spreading through email attachments that burns your computer's motherboard.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses 'Alert' and describes a physically destructive outcome ('burns your motherboard') to cause panic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias with the tag 'Alert'. It describes a physically impossible but scary outcome ('burns your computer's motherboard') to induce panic."
  },
  {
    "id": 149,
    "text": "Rubbing nails together for five minutes a day stimulates hair growth and prevents greying.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text promotes an easy, cost-free habit ('rubbing nails') with the promise of cosmetic benefits.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim promotes Naturalness Bias with a simple, body-based practice ('rubbing nails'). It uses Illusory Correlation to link this action to 'hair growth' and the prevention of greying."
  },
  {
    "id": 150,
    "text": "ATM keypads have a secret 'cancel' trick that prevents your card from being skimmed.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline offers a 'secret trick' that gives the user a false sense of control over technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by offering a 'secret... trick' that appeals to the desire for control. It suggests a simple hack can defeat sophisticated skimming attempts."
  },
  {
    "id": 151,
    "text": "Senior doctors confirm that wearing black clothes in summer absorbs heat that damages the liver.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim cites 'Senior doctors' to validate a superstitious belief about clothing colour and health.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline appeals to Naturalness Bias/Superstition regarding clothing and seasons. It uses Illusory Correlation to link 'black clothes' and heat absorption directly to 'liver' damage."
  },
  {
    "id": 152,
    "text": "Using a laptop on your lap makes you infertile due to the heat and Wi-Fi signals.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text targets a specific fear ('infertile') and links it to a common habit to create anxiety.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by linking 'Wi-Fi signals' and laptop heat to 'infertility'. It connects common technology usage to a severe reproductive consequence."
  },
  {
    "id": 153,
    "text": "A famous nutritionist reveals that skipping breakfast causes the brain to shrink.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion relies on a celebrity 'famous nutritionist' and a scary visual ('brain to shrink').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias by citing a 'famous nutritionist'. It uses Illusory Correlation to link 'skipping breakfast' to the scary visual of the 'brain to shrink'."
  },
  {
    "id": 154,
    "text": "The government reads all SMS messages containing the word 'protest' and marks the sender.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the fear of government surveillance and 'marking' citizens to deter specific speech.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline employs Availability Bias by invoking government surveillance fears. The idea that specific words like 'protest' trigger tracking makes the threat feel concrete and pervasive."
  },
  {
    "id": 155,
    "text": "Drinking tea in plastic cups dissolves the plastic and causes hormonal imbalance in men.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the fear of 'hormonal imbalance' caused by a common everyday object (plastic cups).",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim demonstrates Naturalness Bias by framing 'plastic cups' (artificial) as harmful. It uses Illusory Correlation to link the container material to 'hormonal imbalance in men'."
  },
  {
    "id": 156,
    "text": "Experts say that Bluetooth headsets are 'frying' the brains of the younger generation.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses vague 'Experts' and the emotive term 'frying' to criticise a technology trend.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias with the emotive word 'frying'. It uses Illusory Correlation to link 'Bluetooth headsets' to brain damage, validating fears about new technology."
  },
  {
    "id": 157,
    "text": "Eating one apple a day removes all traces of nicotine from the lungs of smokers.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline promises a miraculous 'clean slate' for smokers ('removes all traces') with a simple fruit.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Naturalness Bias by claiming 'one apple' (natural fruit) can remove 'all traces of nicotine'. It promises a complete, natural detox for a chemical addiction."
  },
  {
    "id": 158,
    "text": "Your internet router is secretly mining Bitcoin for the service provider, making your bill higher.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim creates a narrative of theft ('mining Bitcoin', 'making bill higher') to anger the consumer.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias/Conspiracy by stating the router is 'secretly mining Bitcoin'. It taps into the fear of hidden theft and rising bills."
  },
  {
    "id": 159,
    "text": "Applying turmeric paste to a wound heals it instantly because it is a natural antibiotic.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text appeals to the 'natural' heuristic and exaggerates the speed of healing ('instantly').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text strongly features Naturalness Bias by praising 'turmeric paste' as a 'natural antibiotic'. It claims it heals 'instantly', elevating a traditional remedy above normal medical expectations."
  },
  {
    "id": 160,
    "text": "QR codes are the 'Mark of the Beast' designed to track humans, warns a religious group.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline invokes religious fear and conspiracy rhetoric ('Mark of the Beast') against technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline employs Availability Bias by using the religious conspiracy term 'Mark of the Beast'. It frames a common technology (QR codes) as part of an apocalyptic narrative."
  },
  {
    "id": 161,
    "text": "Eating Maggi noodles coats the digestive tract with wax that takes three days to flush out.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses a persistent urban legend about 'wax' to create disgust towards a specific food product.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Naturalness Bias by attacking a processed food ('Maggi'). It uses Availability Bias (a persistent urban legend) and Illusory Correlation to link the noodles to a 'wax' coating that clogs the gut."
  },
  {
    "id": 162,
    "text": "Beware: Answering calls from numbers starting with +92 will copy all your phone data.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses a specific trigger ('+92') and a catastrophic threat ('copy all data') to spread panic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias with the trigger 'Beware' and a specific number prefix ('+92'). It creates a panic scenario about data theft from a simple phone call."
  },
  {
    "id": 163,
    "text": "A renowned heart surgeon says that coughing vigorously can stop a heart attack in progress.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion relies on the high status of a 'renowned heart surgeon' promoting a dangerous self-help tip.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Availability Bias by citing a 'renowned heart surgeon'. It employs Illusory Correlation by suggesting that 'coughing vigorously' can physically stop a 'heart attack'."
  },
  {
    "id": 164,
    "text": "Online games are designed with 'hypnotic sound waves' to make children addicted.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses mysterious terms like 'hypnotic sound waves' to explain addiction fears to parents.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Availability Bias by addressing parental fears about 'addiction'. It uses Illusory Correlation to attribute this to 'hypnotic sound waves', a pseudo-scientific mechanism."
  },
  {
    "id": 165,
    "text": "Drinking milk standing up causes the fluid to enter the wrong pipe and damage the lungs.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text simplifies anatomy ('wrong pipe') to validate a traditional rule about eating habits.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text appeals to Naturalness Bias/Traditional wisdom about eating habits. It uses Illusory Correlation to claim drinking 'standing up' sends fluid to the 'wrong pipe' and lungs."
  },
  {
    "id": 166,
    "text": "Hackers can access your front camera through the flashlight app to take photos of you.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim links a benign tool (flashlight) to a privacy violation (photos) to create paranoia.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by creating a paranoia about the 'front camera' and 'flashlight app'. It turns a benign tool into a spy device to trigger privacy fears."
  },
  {
    "id": 167,
    "text": "Top dermatologists admit that using expensive creams ruins your skin's natural balance.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the 'admission' framing ('admit') to suggest a conspiracy by the beauty industry.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim displays Naturalness Bias by asserting that 'expensive creams' (artificial) ruin the skin's 'natural balance'. It uses Availability Bias with the phrase 'Top dermatologists admit', implying a revealed secret."
  },
  {
    "id": 168,
    "text": "5G technology is actually a military weapon being tested on the civilian population.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text reframes a commercial technology as a 'military weapon' to incite fear and distrust.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text employs Availability Bias/Conspiracy by framing '5G' as a 'military weapon'. It relies on extreme, sensational language to create fear of the government and technology."
  },
  {
    "id": 169,
    "text": "Eating seeds of fruits causes appendicitis because they get stuck in the gut forever.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses a simple, visual logic ('get stuck forever') to explain a medical condition incorrectly.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by claiming fruit seeds 'get stuck in the gut forever'. It constructs a false mechanical cause for 'appendicitis' based on a simple visual logic."
  },
  {
    "id": 170,
    "text": "Your smartphone screen contains a subliminal flicker that makes you buy things you don't need.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline blames consumer behaviour on external control ('subliminal flicker') rather than personal choice.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by attributing consumer spending to a 'subliminal flicker'. It removes personal agency and blames a hidden technological mechanism."
  },
  {
    "id": 171,
    "text": "A famous TV doctor says you can cure thyroid issues by singing loudly for 15 minutes a day.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion relies on a 'famous TV doctor' offering an absurdly simple, non-medical cure.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias via a 'famous TV doctor'. It exhibits Naturalness Bias by suggesting a non-medical activity ('singing') can cure a hormonal issue like 'thyroid' problems."
  },
  {
    "id": 172,
    "text": "Urgent Warning: Do not accept friend requests from 'Angel Priya', it is a hacker bot.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses a specific name ('Angel Priya') and an 'Urgent Warning' to make the threat feel concrete.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline employs Availability Bias with 'Urgent Warning' and the specific name 'Angel Priya'. It leverages a well-known meme/viral story to create a sense of immediate cyber threat."
  },
  {
    "id": 173,
    "text": "Consuming salt after 6 PM causes water retention that makes you look fat instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline appeals to vanity ('look fat instantly') to promote a dietary restriction.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Availability Bias by appealing to vanity ('look fat instantly'). It uses Illusory Correlation to link the timing of salt intake ('after 6 PM') to immediate visible weight gain."
  },
  {
    "id": 174,
    "text": "The 'mute' button on Zoom is fake and your boss can still hear you.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim taps into workplace anxiety by asserting that privacy controls are 'fake'.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by tapping into workplace anxiety ('boss can still hear you'). It asserts that a common privacy feature ('mute button') is deceptive."
  },
  {
    "id": 175,
    "text": "Placing a slice of lemon on your bedside table clears your lungs of pollution while you sleep.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text offers a magical solution to a complex problem (pollution) using a simple household item.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline demonstrates Naturalness Bias by claiming a 'slice of lemon' can clear lungs. It uses Illusory Correlation to suggest that placing fruit nearby removes 'pollution' from the body."
  },
  {
    "id": 176,
    "text": "Tech companies are suppressing a new free energy device because it would bankrupt them.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the 'suppressed technology' conspiracy trope to explain why free energy doesn't exist.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim relies on Availability Bias/Conspiracy regarding 'suppressed... free energy'. It appeals to the idea that beneficial technology is being hidden by greedy corporations."
  },
  {
    "id": 177,
    "text": "Eating chocolate causes acne because the heat in the body pushes toxins to the skin.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses a vague concept ('heat in the body') to explain a common skin condition.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text uses Naturalness Bias/Traditional concepts like 'heat in the body'. It employs Illusory Correlation to link eating chocolate to 'acne' via this vague physiological mechanism."
  },
  {
    "id": 178,
    "text": "Deleting the 'System32' folder makes your computer run twice as fast, claim gaming experts.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text encourages a destructive action by framing it as a speed hack endorsed by 'gaming experts'.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by linking the deletion of 'System32' (a critical file) to making the computer 'run twice as fast'. It creates a false cause-and-effect that promises a benefit for a destructive action."
  },
  {
    "id": 179,
    "text": "Sleeping with your phone under the pillow fries your brain cells like an egg.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses a vivid simile ('like an egg') to make the radiation fear easy to visualise.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Availability Bias with the vivid imagery 'fries your brain cells'. It uses Illusory Correlation to link phone radiation to cooking an egg."
  },
  {
    "id": 180,
    "text": "Drinking coconut water every day dissolves blood clots and prevents strokes completely.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim promises total prevention ('prevents completely') of a serious condition using a tasty drink.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by claiming 'coconut water' can dissolve blood clots. It promises a natural food can completely prevent a serious medical event like a 'stroke'."
  },
  {
    "id": 181,
    "text": "A secret setting in your phone allows the government to turn on your camera remotely.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text builds paranoia about a 'secret setting' and government overreach.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by alleging a 'secret setting' for government spying. It taps into paranoia about remote surveillance of personal devices."
  },
  {
    "id": 182,
    "text": "Top scientists say that human DNA is changing because of all the processed food we eat.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline cites 'Top scientists' to make a vague, scary claim about fundamental biology ('DNA is changing').",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Naturalness Bias by blaming 'processed food' (artificial) for changing DNA. It uses Availability Bias ('Top scientists say') and Illusory Correlation to link diet to fundamental genetic alteration."
  },
  {
    "id": 183,
    "text": "Typing your PIN backwards at an ATM summons the police instantly.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim offers a false sense of security with a 'secret' safety feature ('summons police instantly').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by offering a dramatic safety hack ('summons police instantly'). It relies on the appeal of a secret emergency feature that is easily recalled."
  },
  {
    "id": 184,
    "text": "Never reheat chicken! It releases invisible toxins that cause food poisoning.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses a strict imperative ('Never reheat') and the fear of 'invisible toxins'.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The headline exhibits Availability Bias with the command 'Never reheat chicken!'. It uses Naturalness Bias (fear of 'invisible toxins') and Illusory Correlation to link reheating to poisoning."
  },
  {
    "id": 185,
    "text": "Internet cables in the ocean are emitting radiation that is killing whales.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline appeals to environmental concern and emotion ('killing whales') to attack infrastructure.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Availability Bias via emotional appeal ('killing whales'). It uses Illusory Correlation to connect 'internet cables' and radiation to marine deaths without evidence."
  },
  {
    "id": 186,
    "text": "A famous actor uses leech therapy to suck out the 'bad blood' and stay young.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion relies on celebrity behaviour and a grotesque visual ('suck out bad blood') to intrigue readers.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text displays Naturalness Bias by promoting 'leech therapy' (ancient/natural). It uses Availability Bias by citing a 'famous actor', relying on celebrity influence to validate a bizarre practice."
  },
  {
    "id": 187,
    "text": "Warning: A new AI virus can jump from your computer to your smart TV through the air.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses 'Warning' and describes a magical contagion ('jump through the air') to create tech fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias with 'Warning' and the concept of a virus jumping 'through the air'. It creates a magical, terrifying contagion scenario for technology."
  },
  {
    "id": 188,
    "text": "Eating tulsi leaves on a Sunday creates negative energy in the body, say astrologers.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text blends health with superstition ('negative energy') backed by the authority of 'astrologers'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim appeals to Naturalness Bias/Superstition regarding 'tulsi leaves'. It uses Illusory Correlation to link eating the plant on a 'Sunday' to 'negative energy' in the body."
  },
  {
    "id": 189,
    "text": "Your SIM card stores a copy of every photo you take, even if you delete it.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline creates anxiety about data permanence and privacy violation ('even if you delete it').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by asserting that data remains 'even if you delete it'. It taps into the anxiety that digital actions are permanent and constantly monitored."
  },
  {
    "id": 190,
    "text": "Drinking water from a plastic bottle left in a hot car causes immediate breast cancer.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses a high-fear outcome ('immediate breast cancer') linked to a common scenario.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Naturalness Bias (plastic = toxic). It uses Availability Bias ('immediate breast cancer') and Illusory Correlation to link warm plastic water bottles to a sudden onset of disease."
  },
  {
    "id": 191,
    "text": "The government is banning all private cryptocurrency to launch its own tracking coin.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text creates fear of financial loss and government control ('banning', 'tracking coin').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by predicting a government ban on 'private cryptocurrency'. It appeals to financial fear and the threat of a 'tracking coin'."
  },
  {
    "id": 192,
    "text": "Doctors hide this simple 2-minute exercise that restores 20/20 vision naturally.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the 'doctors hide' trope and promises a quick fix for a complex issue.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias with the 'Doctors hide this' trope. It exhibits Naturalness Bias by promising that a 'simple 2-minute exercise' can restore vision naturally."
  },
  {
    "id": 193,
    "text": "Sharing 'Good Morning' images on WhatsApp allows hackers to steal your contact list.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim turns a mundane daily activity ('Good Morning images') into a cybersecurity threat.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by turning a common habit ('Good Morning images') into a threat. It creates paranoia about everyday social interactions on WhatsApp."
  },
  {
    "id": 194,
    "text": "Chewing ice is a sign of severe mental instability, warns a leading psychologist.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text pathologises a common habit ('chewing ice') using the authority of a 'leading psychologist'.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Availability Bias by citing a 'leading psychologist'. It uses Illusory Correlation to link 'chewing ice' to 'severe mental instability', pathologizing a minor habit."
  },
  {
    "id": 195,
    "text": "Smart speakers are actually recording your prayers to sell the data to religious groups.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline targets religious sensitivity and privacy fears ('recording prayers').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses Availability Bias by claiming speakers are 'recording your prayers'. It targets specific religious sensitivities to make the privacy breach feel more personal and offensive."
  },
  {
    "id": 196,
    "text": "Eating fruit after a meal makes it rot in your stomach and produce toxic gas.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses a disgusting visual ('rot in your stomach') to enforce a food combining rule.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline demonstrates Naturalness Bias regarding food combining. It uses Illusory Correlation to claim fruit will 'rot in your stomach' if eaten after a meal, a scientifically false mechanism."
  },
  {
    "id": 197,
    "text": "Google Maps tracks your speed and automatically sends fines to the traffic police.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text creates paranoia about everyday tools ('Google Maps') acting as law enforcement agents.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by asserting 'Google Maps' sends automatic fines. It plays on the fear of automated surveillance and punishment in daily driving."
  },
  {
    "id": 198,
    "text": "A famous fitness trainer says you should never drink water during a workout or you will faint.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion comes from the authority of a 'fitness trainer' promoting a dangerous myth.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The text uses Availability Bias via a 'famous fitness trainer'. It uses Illusory Correlation to link 'drinking water' during a workout to the immediate consequence of 'fainting'."
  },
  {
    "id": 199,
    "text": "Using dark mode on your phone causes depression because it tricks the brain into thinking it is night.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline simplifies a psychological condition ('depression') into a simple cause ('dark mode').",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by linking 'dark mode' directly to 'depression'. It simplifies a complex mental health condition into a reaction to a phone setting."
  },
  {
    "id": 200,
    "text": "Swallowing watermelon seeds causes them to grow inside your stomach, blocking the intestines.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim appeals to a childhood fear ('seeds growing inside') to create a visceral reaction.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Availability Bias/Childhood fear. It uses Illusory Correlation by asserting that swallowed seeds will 'grow inside your stomach', a visceral biological impossibility."
  }
]