[
  {
    "id": 201,
    "text": "A spectral analysis of commercially sold turmeric powder reveals that 40% of samples contain lead chromate, which binds to haemoglobin and reduces oxygen transport.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a specific scientific method ('spectral analysis') and a chemical mechanism ('binds to haemoglobin'). The statistic '40% of samples' adds empirical weight to the food safety claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline presents a specific chemical contamination claim ('samples contain lead chromate'). It relies on a technical safety violation rather than cognitive biases about naturalness or availability."
  },
  {
    "id": 202,
    "text": "Log files from major Indian ISPs show that encrypted WhatsApp calls are decrypted on intermediate servers using a master key provided to the Department of Telecommunications.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim cites 'log files' and explains the technical method of surveillance: decryption on 'intermediate servers' via a 'master key'. This detailed network architecture description makes the privacy breach sound technically feasible.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This text details a technical surveillance method involving 'intermediate servers' and a 'master key'. It structures the argument around network architecture rather than bias-driven shortcuts."
  },
  {
    "id": 203,
    "text": "Clinical studies indicate that consuming karela (bitter gourd) juice daily thickens the blood plasma by 12%, increasing the load on the left ventricle.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text references 'Clinical studies' and quantifies the physiological change ('thickens... by 12%'). It connects a dietary habit to a specific cardiac stress ('load on the left ventricle').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is invoked by focusing on the consumption of 'karela (bitter gourd) juice', a traditional remedy. Illusory Correlation links this natural habit to a specific, quantified physiological harm ('thickens the blood plasma by 12%')."
  },
  {
    "id": 204,
    "text": "Smart meters installed in Mumbai transmit data via a high-frequency pulse that interferes with pacemaker calibration protocols within a 15-foot radius.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline specifies a transmission method ('high-frequency pulse') and a specific interference target ('pacemaker calibration protocols'). The defined '15-foot radius' adds a precise safety constraint.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a specific frequency interference ('high-frequency pulse') with medical devices. It relies on a technical proximity constraint ('15-foot radius') rather than cognitive biases."
  },
  {
    "id": 205,
    "text": "Biochemical research shows that reheating spinach converts its nitrate content into nitrosamines, which are potent carcinogens that attack the liver.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on 'biochemical research' to explain a chemical conversion process ('nitrates' to 'nitrosamines'). The mechanistic link to liver damage frames the advice as a scientific fact.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim relies on a chemical conversion process ('nitrate content into nitrosamines'). It presents a mechanistic toxicology argument rather than appealing to biases."
  },
  {
    "id": 206,
    "text": "An audit of the FASTag system reveals that RFID readers double-charge vehicles moving at speeds below 20km/h due to a sensor refresh rate error.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text attributes the financial loss to a technical flaw: 'sensor refresh rate error'. The specific condition ('speeds below 20km/h') makes the glitch sound like a plausible engineering oversight.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text attributes a billing error to a specific technical glitch ('sensor refresh rate error'). It frames the issue as a system bug."
  },
  {
    "id": 207,
    "text": "Dermatological tests confirm that soap containing triclosan disrupts the skin's acid mantle, raising the pH to 8.5 and inviting bacterial infections.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses technical terms like 'acid mantle' and specific pH values ('8.5'). The connection between the chemical 'triclosan' and the biological consequence is presented as a confirmed test result.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is present in the implied danger of the chemical 'triclosan' compared to natural skin balance. Illusory Correlation links this chemical to a specific 'pH' disruption and 'bacterial infections'."
  },
  {
    "id": 208,
    "text": "The source code of popular loan apps includes a permission bypass script that allows access to contact lists even when the user denies the request.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim identifies a specific piece of malware code ('permission bypass script'). It explains the technical functionality—overriding user denial—to validate the privacy concern.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline identifies a specific malicious code ('permission bypass script'). It explains the technical method of the privacy breach."
  },
  {
    "id": 209,
    "text": "A comparative study finds that milk from hybrid cows contains A1 beta-casein, which creates an opiate-like peptide called BCM-7 during digestion.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text cites specific proteins ('A1 beta-casein') and peptides ('BCM-7'). It explains the digestive byproduct mechanism to support the argument against hybrid cow milk.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias appears in the rejection of 'hybrid cows' in favor of implicit traditional breeds. Illusory Correlation creates a link between specific proteins and an 'opiate-like peptide' effect."
  },
  {
    "id": 210,
    "text": "Satellite imagery analysis proves that 5G towers create a thermal heat island effect, raising the ambient temperature of the surrounding 50 meters by 3°C.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses 'satellite imagery analysis' and precise measurements ('50 meters', '3°C'). It argues that the technology has a direct, measurable environmental impact.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This uses Illusory Correlation to connect '5G towers' to a localized 'thermal heat island effect'. It implies a direct environmental impact from radio infrastructure."
  },
  {
    "id": 211,
    "text": "Neuroscientific data indicates that scrolling through short-form videos for 30 minutes reduces grey matter density in the prefrontal cortex by 1.5%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim references 'neuroscientific data' and specific brain anatomy ('grey matter', 'prefrontal cortex'). The statistic '1.5%' quantifies the alleged neurological damage.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Illusory Correlation connects a behavioral habit ('scrolling... for 30 minutes') to precise brain damage ('reduces grey matter... by 1.5%'). It applies a specific biological decay rate to a digital activity."
  },
  {
    "id": 212,
    "text": "DigiLocker servers utilise a deduplication algorithm that inadvertently merges files from users with identical names and dates of birth.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a specific database process ('deduplication algorithm'). The explanation of how the error occurs (matching 'names and dates of birth') provides a logical reason for the alleged data leak.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a specific database error ('deduplication algorithm'). It relies on data management logic rather than cognitive biases."
  },
  {
    "id": 213,
    "text": "Research shows that cooking in pressure cookers destroys 90% of phytonutrients because the internal temperature exceeds the breakdown threshold of 120°C.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites a specific temperature threshold ('120°C') and a nutrient loss percentage ('90%'). It frames the cooking method as scientifically destructive to 'phytonutrients'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is shown in the rejection of modern 'pressure cookers' for destroying nutrients. Illusory Correlation claims a specific temperature threshold ('120°C') destroys '90% of phytonutrients'."
  },
  {
    "id": 214,
    "text": "Electric scooter battery management systems contain a dormant firmware bug that causes thermal runaway if the charging voltage fluctuates by more than 5%.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim identifies a specific technical cause: a 'dormant firmware bug' triggered by 'voltage fluctuations'. The term 'thermal runaway' adds technical accuracy to the explosion myth.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline attributes battery failure to a 'dormant firmware bug'. It relies on technical engineering concepts."
  },
  {
    "id": 215,
    "text": "Consuming curd at night increases mucus production in the respiratory tract due to the activation of kappa-casein at lower body temperatures.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text offers a biochemical explanation involving 'kappa-casein' and 'body temperatures'. It connects these factors to a physiological symptom ('mucus production') to validate the dietary restriction.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias reflects traditional dietary rules about 'Consuming curd at night'. Illusory Correlation links the time of day to 'mucus production' via a pseudo-scientific protein activation."
  },
  {
    "id": 216,
    "text": "VPN providers in India are legally required to install a 'backdoor' root certificate that allows government agencies to intercept HTTPS traffic.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline references a specific technical implementation: a 'backdoor root certificate'. It explains that this enables the interception of 'HTTPS traffic', creating a structured argument about privacy legislation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims a specific regulatory requirement for a 'backdoor root certificate'. It is a technical privacy argument."
  },
  {
    "id": 217,
    "text": "A 5-year study reveals that using mosquito repellents containing DEET causes neurotoxicity by inhibiting the enzyme acetylcholinesterase in the brain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim cites a longitudinal '5-year study' and names a specific enzyme, 'acetylcholinesterase'. The mechanism of 'inhibiting' this enzyme provides a toxicology-based argument for the health risk.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias appears in the fear of the chemical 'DEET'. Illusory Correlation links this repellent to 'neurotoxicity' via specific enzyme inhibition."
  },
  {
    "id": 218,
    "text": "Algorithm analysis confirms that food delivery apps artificially increase the estimated delivery time by 15 minutes to sell 'priority delivery' upgrades.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses 'algorithm analysis' to uncover a business logic. It quantifies the manipulation ('15 minutes') and provides the economic motive ('sell priority delivery'), making the claim sound like a verified exposé.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a business algorithm strategy ('artificially increase... estimated delivery time'). It relies on economic logic."
  },
  {
    "id": 219,
    "text": "Drinking water from clay pots reduces stomach acidity by neutralising protons, which slows down the digestion of complex carbohydrates.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains the chemistry: 'neutralising protons'. It links this to a metabolic consequence ('slows down digestion'), framing the traditional practice as having specific physiological effects.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias promotes 'clay pots' as a superior, traditional vessel. Illusory Correlation asserts a chemical benefit ('neutralising protons') that improves digestion."
  },
  {
    "id": 220,
    "text": "Face ID sensors project 30,000 infrared dots that penetrate the retina, causing a gradual degeneration of macula cells over 24 months.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses precise numbers ('30,000 dots') and biological terms ('macula cells'). The timeline ('over 24 months') and the mechanism ('penetrate the retina') present a detailed medical argument.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Illusory Correlation connects a specific technology ('Face ID sensors') to biological damage ('degeneration of macula cells'). It posits a direct harm from infrared projection."
  },
  {
    "id": 221,
    "text": "Laboratory analysis finds that commercial honey contains high-fructose corn syrup which alters the insulin sensitivity of hepatic cells.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text references 'laboratory analysis' and specific cell types ('hepatic cells'). The mechanism of altering 'insulin sensitivity' frames the adulteration claim in medical terms.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is present in the contrast between 'commercial honey' (adulterated) and the implicit pure honey. Illusory Correlation links 'high-fructose corn syrup' to a specific hepatic cell alteration."
  },
  {
    "id": 222,
    "text": "Online gaming servers use a latency-manipulation code that creates artificial lag for non-paying users to incentivise in-game purchases.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a technical method ('latency-manipulation code') used for a specific outcome ('artificial lag'). The economic rationale ('incentivise... purchases') makes the conspiracy plausible.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a 'latency-manipulation code' for economic gain. It is a technical conspiracy about gaming fairness."
  },
  {
    "id": 223,
    "text": "Research indicates that applying kajal (kohl) inside the waterline blocks the Meibomian glands, leading to dry eye syndrome in 65% of daily users.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim identifies specific anatomical structures ('Meibomian glands') and a resultant condition ('dry eye syndrome'). The statistic '65% of daily users' adds a data-driven dimension.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This uses Illusory Correlation to link a cosmetic product ('kajal') to a specific medical condition ('dry eye syndrome') via gland blockage. It frames a common habit as a direct cause of disease."
  },
  {
    "id": 224,
    "text": "Hidden partitions in smart TV storage drives cache voice data for 7 days before uploading it to cloud servers during system updates.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text details the storage architecture ('hidden partitions') and the operational process ('cache... before uploading'). This technical explanation supports the spying allegation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text details a hidden storage mechanism ('hidden partitions') for spying. It relies on technical architecture claims."
  },
  {
    "id": 225,
    "text": "A clinical trial demonstrates that eating soaked walnuts increases the synthesis of serotonin in the brain stem by 20% within two hours.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites a 'clinical trial' and a specific neurotransmitter ('serotonin'). The quantification ('by 20%') and timeframe ('within two hours') provide a structured medical benefit claim.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias favors 'soaked walnuts' as a traditional health booster. Illusory Correlation quantifies the benefit ('serotonin... by 20%'), creating a direct link between food and neurotransmitters."
  },
  {
    "id": 226,
    "text": "Traffic cameras in Bengaluru use gait analysis algorithms to identify pedestrians even when their faces are covered by masks.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains the technology: 'gait analysis algorithms'. It addresses a specific limitation (masks) and explains how the system overcomes it, making the surveillance capability sound advanced and real.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a specific surveillance technology ('gait analysis'). It relies on claims about biometric capabilities."
  },
  {
    "id": 227,
    "text": "Consuming tea with paratha inhibits the enzyme pepsin, preventing the breakdown of gluten and causing bloating in 80% of individuals.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text identifies a specific enzyme interaction ('inhibits... pepsin'). It connects this mechanism to a digestive symptom ('bloating') and validates it with a statistic ('80%').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias reflects traditional food combination rules ('tea with paratha'). Illusory Correlation links this mix to 'inhibits... pepsin' and 'bloating'."
  },
  {
    "id": 228,
    "text": "Mobile operating systems log the unique SSID of every Wi-Fi network a user connects to, creating a physical location history map stored in the device kernel.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses technical terms like 'SSID' and 'device kernel'. It explains how connection data is transformed into a 'location history map', providing a technical basis for the tracking claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims a specific tracking method involving 'SSID' logs. It is a technical privacy argument."
  },
  {
    "id": 229,
    "text": "A study of 1,500 patients confirms that drinking water while standing causes a rapid fluid impact on the lower stomach wall, damaging the sphincter muscle.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim cites a sample size ('1,500 patients') and anatomical details ('sphincter muscle'). The mechanical explanation of 'rapid fluid impact' attempts to scientifically justify the cultural belief.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is invoked through the traditional prohibition of 'drinking water while standing'. Illusory Correlation asserts this causes 'rapid fluid impact' that damages muscles."
  },
  {
    "id": 230,
    "text": "Generative AI tools embed a unique cryptographic watermark in every output that links the generated text to the user's IP address.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a specific forensic technique: 'cryptographic watermark'. The assertion that this 'links... to the user's IP address' provides a technical explanation for how anonymity is compromised.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a specific forensic tag ('cryptographic watermark'). It is a technical attribution claim."
  },
  {
    "id": 231,
    "text": "Analysis of hair samples shows that using sulphate-free shampoos leads to a buildup of silicone on the scalp, blocking follicles and causing hair thinning.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses 'analysis of hair samples' as evidence. It explains the chemical mechanism ('buildup of silicone') and its physical effect ('blocking follicles') to counter the marketing of sulphate-free products.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Illusory Correlation is used to link 'sulphate-free shampoos' to a negative outcome ('buildup of silicone'). It contradicts the usual naturalness marketing by claiming the alternative causes physical blockage."
  },
  {
    "id": 232,
    "text": "Cybersecurity researchers find that cheap smart bulbs contain unpatched firmware vulnerabilities that allow hackers to access the home Wi-Fi password.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim attributes the risk to 'unpatched firmware vulnerabilities'. It explains the attack vector—using the bulb as a gateway to the 'Wi-Fi password'—making the threat technically logical.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim attributes a security risk to 'unpatched firmware vulnerabilities'. It relies on cybersecurity concepts."
  },
  {
    "id": 233,
    "text": "Consuming raw sprouts exposes the gut to Salmonella bacteria that survive in the seed coat, leading to chronic low-grade inflammation.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text identifies a specific pathogen ('Salmonella') and its reservoir ('seed coat'). The connection to 'chronic low-grade inflammation' presents a medical consequence beyond acute food poisoning.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This presents a biological hazard ('Salmonella') in a specific food. It relies on food safety mechanisms."
  },
  {
    "id": 234,
    "text": "The Unified Payments Interface (UPI) protocol includes a 'transaction reversal' backdoor accessible only to bank administrators for freezing funds without user consent.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline alleges a specific feature in the 'UPI protocol'.Describing it as a 'backdoor' for 'freezing funds' constructs a structured argument about centralized financial control.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline alleges a 'transaction reversal' backdoor. It is a financial technology conspiracy."
  },
  {
    "id": 235,
    "text": "Medical research indicates that sleeping with the head covered restricts oxygen flow, increasing carbon dioxide re-inhalation levels by 30%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses gas exchange mechanics ('carbon dioxide re-inhalation'). The statistic '30%' quantifies the impact, making the advice against covering the head sound physiologically sound.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias reflects traditional sleep hygiene advice. Illusory Correlation links 'sleeping with the head covered' to specific 'carbon dioxide re-inhalation levels'."
  },
  {
    "id": 236,
    "text": "Bluetooth 5.0 signals operate at a resonance frequency that vibrates the dental amalgam in fillings, causing micro-fractures in the tooth enamel.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text applies physics concepts ('resonance frequency') to dentistry. It argues that the signal physically 'vibrates' the fillings, leading to 'micro-fractures', providing a mechanistic danger.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Illusory Correlation connects 'Bluetooth 5.0' signals to physical 'micro-fractures' in teeth. It exploits the fear of invisible waves causing physical damage."
  },
  {
    "id": 237,
    "text": "A controlled dietary study reveals that combining fish and radish produces a specific toxin that triggers autoimmune reactions in the skin.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline references a 'controlled dietary study'. It asserts the production of a 'specific toxin' to explain why the combination supposedly leads to 'autoimmune reactions'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias relies on Ayurvedic dietary restrictions ('combining fish and radish'). Illusory Correlation claims this mix produces a 'specific toxin' leading to skin issues."
  },
  {
    "id": 238,
    "text": "Network packet analysis shows that smart speakers transmit audio data even when the mute button is physically engaged, using a secondary backup circuit.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim cites 'network packet analysis' as proof. It explains the method of bypass—a 'secondary backup circuit'—to argue that physical privacy switches are ineffective.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a 'secondary backup circuit' for surveillance. It is a hardware conspiracy claim."
  },
  {
    "id": 239,
    "text": "Physiological tests confirm that walking barefoot on cold tiles causes a reflex vasoconstriction in the uterus, leading to severe menstrual cramps.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a specific physiological reflex ('vasoconstriction'). It connects the thermal stimulus of 'cold tiles' to a specific organ ('uterus') to validate the health warning.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias reflects traditional warnings about cold and the body. Illusory Correlation links 'walking barefoot' to 'vasoconstriction in the uterus'."
  },
  {
    "id": 240,
    "text": "Ride-sharing algorithms profile users based on their battery percentage; those with less than 10% charge are shown prices 20% higher.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a predatory pricing logic based on 'battery percentage'. The specific numbers ('10% charge', '20% higher') create a structured economic argument for the claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims a specific algorithmic pricing model based on battery life. It relies on economic exploitation logic."
  },
  {
    "id": 241,
    "text": "An analysis of 500 samples of 'brown sugar' sold in markets reveals it is merely white sugar coloured with molasses, offering no difference in glycemic index.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses 'analysis of 500 samples' to debunk a product. It uses the technical metric 'glycemic index' to argue that the health benefits are chemically non-existent.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline debunks a product ('brown sugar') using chemical analysis. It relies on nutritional science concepts."
  },
  {
    "id": 242,
    "text": "Wearable ECG monitors store heart rhythm data in an unencrypted plain text format that can be read by any malicious app installed on the same phone.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text identifies a security flaw: 'unencrypted plain text format'. It explains the vulnerability—access by 'any malicious app'—to construct a detailed data privacy argument.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a data security flaw ('plain text format'). It relies on cybersecurity principles."
  },
  {
    "id": 243,
    "text": "Research shows that using aluminium foil to wrap hot food causes leaching of the metal, which deposits in the bones and displaces calcium.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains the chemical process ('leaching') and the biological consequence ('displaces calcium'). This mechanistic explanation attempts to validate the health risk of aluminium foil.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is shown in the rejection of modern 'aluminium foil'. Illusory Correlation links the metal to 'leaching' and displacing calcium in bones."
  },
  {
    "id": 244,
    "text": "The new e-Passport chips contain a writable memory sector that allows immigration officials to add derogatory flags without the holder's knowledge.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim specifies a technical feature: 'writable memory sector'. It explains the function—adding 'derogatory flags'—to support a narrative about government control and secrecy.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline alleges a specific chip feature ('writable memory sector'). It is a government control conspiracy."
  },
  {
    "id": 245,
    "text": "A study concludes that drinking coffee on an empty stomach stimulates the secretion of hydrochloric acid, which damages the stomach lining over 5 years.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text references a 'study' and specific gastric secretions ('hydrochloric acid'). The longitudinal timeframe ('over 5 years') adds a serious, chronic dimension to the health warning.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias reflects dietary rules about 'empty stomach'. Illusory Correlation links coffee to 'hydrochloric acid' secretion that damages the stomach."
  },
  {
    "id": 246,
    "text": "QR code scanners in payment apps execute a background script that scrapes the browser history for keywords related to high-value purchases.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes the mechanism: a 'background script'. It explains the purpose—scraping for 'high-value purchases'—to provide a commercial logic for the alleged spying.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This describes a 'background script' for data scraping. It is a technical privacy claim."
  },
  {
    "id": 247,
    "text": "Using plastic containers in the microwave releases dioxins that bind to the fat globules in food, increasing the risk of breast cancer.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim names a specific carcinogen ('dioxins') and describes how it enters the body ('bind to fat globules'). This chemical explanation supports the cancer risk claim.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias appears in the fear of 'plastic containers'. Illusory Correlation links microwave use to 'dioxins' and 'breast cancer'."
  },
  {
    "id": 248,
    "text": "Metadata analysis reveals that online learning platforms track the eye movements of students via webcam to measure attention spans and sell the data.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text cites 'metadata analysis' and describes a specific biometric tracking method ('eye movements'). The motive ('sell the data') completes the structured argument about privacy violation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a biometric tracking method ('eye movements') for commercial gain. It is a technical privacy argument."
  },
  {
    "id": 249,
    "text": "Clinical evidence suggests that holding urine for long periods causes backflow into the ureters, introducing bacteria that lead to kidney infections.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline offers a mechanical explanation: 'backflow into the ureters'. It links this process to a specific pathology ('kidney infections'), framing the advice as medical fact.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This provides a mechanical explanation for a health issue ('backflow... introducing bacteria'). It relies on anatomical logic."
  },
  {
    "id": 250,
    "text": "5G modems in smartphones use a 'beamforming' technique that focuses radio waves directly towards the user's head, increasing localized thermal heating.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim correctly identifies a 5G technology ('beamforming') but misrepresents its effect. It argues this causes 'localized thermal heating', using technical jargon to create a plausible health threat.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Illusory Correlation connects '5G modems' to 'localized thermal heating' in the head. It misinterprets radio technology as a physical heat source."
  },
  {
    "id": 251,
    "text": "A comparative analysis of cooking oils shows that refined oil contains trans fats that solidify at body temperature, clogging the arteries within 10 years.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses 'comparative analysis' and physical properties ('solidify at body temperature'). The specific timeline ('within 10 years') adds a measurable prognosis to the health claim.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias attacks 'refined oil' in favor of implicit natural options. Illusory Correlation claims these oils 'solidify at body temperature' to clog arteries."
  },
  {
    "id": 252,
    "text": "Hardware tear-downs of smart TVs reveal a dedicated microphone module that operates independently of the main circuit board to record ambient audio.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites 'hardware tear-downs' as physical evidence. The description of an 'independent' module explains how recording happens even when the TV is off, adding technical credibility.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline identifies a 'dedicated microphone module'. It relies on hardware evidence for a spying claim."
  },
  {
    "id": 253,
    "text": "A study of 2000 office workers links sitting cross-legged to a 25% increase in varicose veins due to the compression of the peroneal nerve.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim references a specific sample size and anatomical structure ('peroneal nerve'). The statistic ('25% increase') quantifies the risk, making the posture advice sound scientifically derived.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Illusory Correlation connects 'sitting cross-legged' to 'varicose veins'. It posits a direct mechanical cause ('compression of the peroneal nerve') for a complex condition."
  },
  {
    "id": 254,
    "text": "Cloud storage terms of service include a clause allowing the provider to use user photos to train facial recognition AI without explicit consent.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text points to a specific legal document ('terms of service'). It explains the usage ('train facial recognition AI') to create a structured legal/technical argument about data rights.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This cites 'terms of service' regarding AI training. It is a legal/technical data rights claim."
  },
  {
    "id": 255,
    "text": "Consuming ice water closes the pyloric valve of the stomach, trapping food and causing fermentation that leads to severe acidity.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline names a specific anatomical part ('pyloric valve'). It describes a mechanical sequence ('trapping food', 'fermentation') to explain the digestive issue scientifically.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias reflects traditional advice against 'ice water'. Illusory Correlation claims it 'closes the pyloric valve', leading to fermentation."
  },
  {
    "id": 256,
    "text": "Firmware analysis of popular fitness bands shows they transmit GPS coordinates every 60 seconds to third-party ad servers, regardless of user settings.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on 'firmware analysis' and specific transmission intervals ('every 60 seconds'). The destination ('third-party ad servers') provides a logical motive for the data leak.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a firmware behavior ('transmit GPS coordinates'). It is a technical privacy violation claim."
  },
  {
    "id": 257,
    "text": "A dermatological study finds that parabens in moisturizers mimic estrogen, binding to receptors and disrupting the hormonal balance in 40% of women.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the biochemical action: 'mimic estrogen', 'binding to receptors'. The statistic ('40% of women') gives the claim about hormonal disruption a clinical veneer.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is present in the fear of synthetic 'parabens'. Illusory Correlation links them to 'disrupting the hormonal balance' by mimicking estrogen."
  },
  {
    "id": 258,
    "text": "Browser fingerprinting techniques allow websites to identify users with 99% accuracy by analyzing installed fonts and screen resolution alone.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains the method: 'analyzing installed fonts'. The high accuracy rate ('99%') is used to emphasize the effectiveness of this technical surveillance method.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This explains 'browser fingerprinting' techniques. It relies on technical tracking concepts."
  },
  {
    "id": 259,
    "text": "Eating fruits immediately after a meal causes them to ferment in the stomach, producing alcohol that damages the liver lining.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim proposes a chemical process ('ferment... producing alcohol') occurring in the stomach. It links this to specific organ damage ('liver lining') to validate the dietary rule.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias reflects dietary rules about fruit timing. Illusory Correlation claims fruits 'ferment... producing alcohol' in the stomach."
  },
  {
    "id": 260,
    "text": "The implementation of the Digital Rupee utilises a 'programmable currency' feature that allows the central bank to restrict spending on specific goods.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text refers to a specific technical feature ('programmable currency'). It explains the capability ('restrict spending') to construct an argument about government control of personal finance.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes 'programmable currency' features. It relies on economic control theories."
  },
  {
    "id": 261,
    "text": "Research confirms that reusing cooking oil creates free radicals that oxidise cholesterol, leading to immediate arterial inflammation.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses chemical terms like 'free radicals' and 'oxidise cholesterol'. It asserts a direct causal link to 'arterial inflammation', making the health warning sound scientifically robust.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This uses chemical concepts ('free radicals', 'oxidise') to explain the harm of reusing oil. It presents a biochemical argument."
  },
  {
    "id": 262,
    "text": "Operating system logs show that voice assistants silently activate for 3 seconds after keywords like 'buy' or 'want' are detected in conversation.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim specifies a trigger ('keywords like buy') and a duration ('3 seconds'). This operational detail provides a plausible technical explanation for targeted ad delivery.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text specifies a technical trigger ('keywords like buy'). It relies on operational details of voice assistants."
  },
  {
    "id": 263,
    "text": "A study of traditional remedies finds that putting two drops of warm ghee in the nose lubricates the olfactory nerve and improves memory by 15%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text connects a physical action ('lubricates the olfactory nerve') to a cognitive benefit. The quantification ('improves memory by 15%') attempts to validate the Ayurvedic practice with data.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias promotes the traditional use of 'ghee'. Illusory Correlation links putting it in the nose to 'improves memory by 15%'."
  },
  {
    "id": 264,
    "text": "Tech experts identify a vulnerability in 4G SIM cards that allows remote cloning if the user replies to a specific binary SMS string.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a specific attack vector: 'binary SMS string'. It explains the consequence—'remote cloning'—to create a technically structured security warning.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a 'binary SMS string' attack. It is a technical cybersecurity warning."
  },
  {
    "id": 265,
    "text": "Consuming protein shakes without exercise leads to the accumulation of uric acid in the kidneys, causing stones in 30% of users.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim identifies a chemical byproduct ('uric acid') and a specific organ ('kidneys'). The statistic ('30% of users') provides a measured risk assessment for the lifestyle choice.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias appears in the critique of processed 'protein shakes'. Illusory Correlation links them to 'stones' via uric acid accumulation."
  },
  {
    "id": 266,
    "text": "Artificial Intelligence hiring tools use facial analysis to reject candidates who show 'micro-expressions' of anxiety during video interviews.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes the AI's method: detecting 'micro-expressions'. It explains the criteria for rejection ('anxiety'), creating a plausible narrative about automated bias in hiring.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This describes 'facial analysis' in hiring. It is a claim about AI bias and technology."
  },
  {
    "id": 267,
    "text": "A clinical report states that wearing tight jeans compresses the femoral cutaneous nerve, leading to permanent numbness in the thighs.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline names a specific nerve ('femoral cutaneous nerve'). It connects the clothing choice to a neurological outcome ('permanent numbness'), framing it as a medical condition.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline attributes 'numbness' to mechanical compression ('tight jeans'). It relies on physiological logic."
  },
  {
    "id": 268,
    "text": "Data packet inspection reveals that smart fridges upload the inventory list to insurance databases to calculate health risk scores.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim describes a data flow: fridge inventory to 'insurance databases'. It provides the economic purpose—calculating 'health risk scores'—to explain the privacy violation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim connects 'smart fridges' to insurance data. It relies on IoT privacy concerns."
  },
  {
    "id": 269,
    "text": "Drinking water from a copper vessel leads to copper accumulation in the liver, which inhibits the enzyme necessary for detoxifying alcohol.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses a biochemical argument: inhibition of a specific 'enzyme'. It links 'copper accumulation' to a functional liver deficit, countering a popular health trend with pseudo-science.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This text counters a Naturalness Bias by claiming a traditional practice ('copper vessel') causes harm ('copper accumulation'). It uses a toxicological argument."
  },
  {
    "id": 270,
    "text": "A forensic analysis of deleted tweets shows that they are archived in a hidden 'shadow database' accessible to law enforcement agencies upon request.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses terms like 'forensic analysis' and 'shadow database'. It explains the data retention policy to support the claim that deletion is merely a UI feature, not a data removal.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a 'shadow database' for deleted content. It is a technical data retention claim."
  },
  {
    "id": 271,
    "text": "Research indicates that eating curd with onion produces a chemical reaction that creates psoriasis patches on the skin over six months.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts a 'chemical reaction' between specific foods. The connection to a specific skin condition ('psoriasis') and the timeline ('over six months') frames it as a medical finding.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias reflects traditional food incompatibility beliefs. Illusory Correlation links 'curd with onion' to the specific skin condition 'psoriasis'."
  },
  {
    "id": 272,
    "text": "Mobile network providers use 'silent SMS' or 'Type 0' messages to ping a phone and triangulate its exact location without the user knowing.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text identifies a real technical protocol ('Type 0 messages'). It explains how this is used for 'triangulation', adding technical depth to the surveillance theory.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This identifies a specific protocol ('Silent SMS') for triangulation. It is a technical surveillance claim."
  },
  {
    "id": 273,
    "text": "A study finds that sleeping with a mobile phone near the head alters brain wave patterns during REM sleep, reducing memory retention by 18%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites a specific sleep phase ('REM sleep') and a cognitive metric ('memory retention'). The statistic ('18%') quantifies the alleged harm, making the warning sound scientific.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Illusory Correlation connects a phone's proximity to 'alters brain wave patterns'. It posits a direct interference with 'REM sleep'."
  },
  {
    "id": 274,
    "text": "Code reviews of dating apps reveal an 'attractiveness score' algorithm that hides profiles of highly rated users from non-paying members.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim describes an internal metric ('attractiveness score'). It explains the algorithmic logic—hiding profiles to drive payments—providing a rational business explanation for the user experience.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes an 'attractiveness score' algorithm. It relies on business logic within app development."
  },
  {
    "id": 275,
    "text": "Medical analysis shows that drinking tea on an empty stomach disrupts the acid-alkaline balance, causing metabolic acidosis in 45% of people.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses terms like 'acid-alkaline balance' and 'metabolic acidosis'. The statistic ('45% of people') attempts to validate the common dietary advice with clinical data.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias reflects dietary rules about 'tea on an empty stomach'. Illusory Correlation links this to 'metabolic acidosis', a severe medical condition."
  },
  {
    "id": 276,
    "text": "The latest Wi-Fi encryption standard contains a mathematical flaw that allows quantum computers to decrypt traffic in under 10 seconds.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies a specific weakness: 'mathematical flaw'. It connects this to 'quantum computers' and a time frame ('under 10 seconds') to sound like a high-tech security warning.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text identifies a 'mathematical flaw' in encryption. It relies on high-tech computing concepts."
  },
  {
    "id": 277,
    "text": "A study of 500 cardiac patients links the consumption of refined oil to a 30% increase in arterial plaque density due to lipid oxidation.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim references a specific patient group and a mechanism ('lipid oxidation'). The statistic ('30% increase') links the dietary choice to a measurable cardiac risk.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias attacks 'refined oil' in favor of natural fats. Illusory Correlation links consumption to specific 'arterial plaque density'."
  },
  {
    "id": 278,
    "text": "Smart car telemetry systems upload driving data, including speed and braking patterns, to a shared server used by insurance firms to deny claims.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text details the data points: 'speed and braking patterns'. It explains the economic consequence—denying claims—making the data sharing sound like a plausible corporate strategy.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes 'telemetry systems' sharing data with insurance. It is a privacy/business model claim."
  },
  {
    "id": 279,
    "text": "Applying toothpaste on burns seals the heat inside the skin tissues, causing deeper secondary burns and permanent scarring.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains the physical mechanism: 'seals the heat'. It describes the pathological result ('secondary burns'), using a logical argument to advise against a home remedy.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This explains the mechanism of harm for a home remedy ('seals the heat'). It uses a physical/medical argument."
  },
  {
    "id": 280,
    "text": "Internal documents from ISP associations discuss throttling streaming speeds by 40% during peak hours to force users into higher-tier plans.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim cites 'internal documents' as evidence. It quantifies the throttling ('40%') and provides the business motive ('force users into higher-tier plans'), constructing a rational conspiracy.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim alleges intentional 'throttling' by ISPs. It is a business conspiracy about service quality."
  },
  {
    "id": 281,
    "text": "Eating banana and egg together creates a heavy protein compound that takes 8 hours to digest, causing gut fermentation.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a 'heavy protein compound' and specifies a digestion time ('8 hours'). The mechanism of 'gut fermentation' attempts to scientifically validate the food combination myth.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias involves rules about food combinations ('banana and egg'). Illusory Correlation claims this creates a 'heavy protein compound' that ferments."
  },
  {
    "id": 282,
    "text": "Facial recognition kiosks at airports perform a deep-scan of the iris that identifies genetic markers for certain diseases without a blood test.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes an advanced capability: identifying 'genetic markers' via the iris. This technical explanation suggests that biometric surveillance extends to medical profiling.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes an advanced biometric capability ('deep-scan of the iris'). It relies on futuristic surveillance fears."
  },
  {
    "id": 283,
    "text": "Research finds that microwaving breast milk destroys 98% of its immunoglobulin A antibodies due to uneven heating hotspots.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim names specific antibodies ('immunoglobulin A'). It explains the cause ('uneven heating hotspots') and quantifies the loss ('98%'), providing a detailed scientific argument.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias rejects modern 'microwaving' for breast milk. Illusory Correlation quantifies the destruction of 'antibodies' to validated the preference."
  },
  {
    "id": 284,
    "text": "A vulnerability in the Bluetooth protocol allows hackers to inject audio commands into wireless earbuds to control the paired smartphone.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text identifies the method: 'inject audio commands'. It explains the consequence—controlling the 'paired smartphone'—to construct a technically plausible security threat.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline identifies a 'Bluetooth protocol' vulnerability. It relies on technical security concepts."
  },
  {
    "id": 285,
    "text": "Clinical analysis shows that swallowing chewing gum creates a synthetic mesh in the intestines that blocks nutrient absorption for weeks.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a physical blockage: 'synthetic mesh'. It asserts a functional impact ('blocks nutrient absorption') to give a medical reason for the warning.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is seen in the fear of synthetic 'chewing gum'. Illusory Correlation claims it creates a 'synthetic mesh' that blocks digestion."
  },
  {
    "id": 286,
    "text": "Algorithm audits reveal that social media apps drain the battery by 10% more when the user is in a location with high ad-targeting value.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim connects 'battery drain' to 'ad-targeting value'. The statistic ('10% more') implies a programmed behavior driven by commercial location data.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This links 'battery drain' to location tracking. It is a technical claim about app behavior."
  },
  {
    "id": 287,
    "text": "A study of 1000 women links the use of hair dye to a 20% increase in bladder cancer risk due to the absorption of aromatic amines.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text references a specific chemical class ('aromatic amines'). The sample size ('1000 women') and risk calculation ('20% increase') provide a structured epidemiological argument.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias appears in the fear of chemical 'hair dye'. Illusory Correlation links 'aromatic amines' to a specific 'bladder cancer' risk."
  },
  {
    "id": 288,
    "text": "Smart speakers record ultrasonic frequencies emitted by other household devices to build a profile of the user's electronic ownership.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains the surveillance method: capturing 'ultrasonic frequencies'. The purpose—building a 'profile of electronic ownership'—offers a marketing logic for the technical claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes recording 'ultrasonic frequencies'. It relies on technical surveillance methods."
  },
  {
    "id": 289,
    "text": "Drinking water immediately after meals dilutes the digestive enzymes, delaying the breakdown of proteins by approximately 45 minutes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on enzyme mechanics ('dilutes... enzymes'). The specific time delay ('45 minutes') adds precision to the digestion-based argument.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias reflects traditional rules about water with meals. Illusory Correlation claims it 'dilutes the digestive enzymes', delaying digestion."
  },
  {
    "id": 290,
    "text": "Digital billboards use hidden cameras and gaze-tracking software to measure how long passersby look at an ad to charge advertisers accordingly.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes the technology: 'gaze-tracking software'. It explains the business model—charging based on attention time—making the surveillance claim economically rational.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes 'gaze-tracking software' in billboards. It relies on advanced advertising technology claims."
  },
  {
    "id": 291,
    "text": "A biochemical study confirms that combining milk and fish produces a specific allergen that triggers vitiligo in genetically predisposed individuals.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline references a 'biochemical study'. It explains the mechanism ('specific allergen') and targets a subgroup ('genetically predisposed') to make the myth sound scientifically nuanced.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias involves traditional food incompatibility ('milk and fish'). Illusory Correlation claims this produces an allergen causing 'vitiligo'."
  },
  {
    "id": 292,
    "text": "The new 6G network standards include a frequency band that can penetrate concrete walls to create high-resolution 3D maps of indoor spaces.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim attributes the capability to 'new 6G network standards'. It explains the physics—penetrating walls to create '3D maps'—to construct a privacy threat based on future tech.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline attributes mapping capabilities to '6G network standards'. It relies on future tech speculation."
  },
  {
    "id": 293,
    "text": "Consuming cold drinks during menstruation causes blood to thicken in the uterine wall, leading to cysts over a 5-year period.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text proposes a physical effect ('blood to thicken') caused by temperature. The long-term consequence ('cysts over a 5-year period') frames the advice as a preventative medical measure.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias reflects traditional beliefs about 'cold drinks' and menstruation. Illusory Correlation links this to 'blood to thicken' and 'cysts'."
  },
  {
    "id": 294,
    "text": "Email providers use automated scripts to scan attachments for financial keywords, selling the aggregated data to credit scoring agencies.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes the process: 'automated scripts' scanning for 'financial keywords'. The sale to 'credit scoring agencies' provides a plausible economic motive for the privacy breach.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This describes 'automated scripts' scanning email. It is a data privacy claim."
  },
  {
    "id": 295,
    "text": "Research shows that eating burnt toast introduces acrylamide into the bloodstream, which binds to DNA and increases mutation rates.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim identifies a real chemical ('acrylamide'). It explains the biological mechanism ('binds to DNA') to support the assertion about increased 'mutation rates'.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim identifies 'acrylamide' in burnt food. It uses a chemical toxicology argument."
  },
  {
    "id": 296,
    "text": "An investigation into ride-hailing apps finds that the 'panic button' feature is a placebo that simply logs the event without alerting authorities.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the term 'placebo' to describe a software feature. It asserts that the function is limited to 'logging the event', explaining the alleged failure of safety systems.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text calls a safety feature a 'placebo'. It relies on software functionality auditing."
  },
  {
    "id": 297,
    "text": "A clinical study indicates that using antiperspirants prevents the release of toxins through sweat, causing them to accumulate in the lymph nodes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline offers a physiological blockage theory: preventing 'release of toxins'. The accumulation in 'lymph nodes' is presented as a direct medical consequence.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias appears in the rejection of 'antiperspirants' for blocking natural sweat. Illusory Correlation links this blockage to toxin accumulation in 'lymph nodes'."
  },
  {
    "id": 298,
    "text": "Public Wi-Fi networks in airports inject a persistent tracking cookie into the browser header that remains active even after disconnecting.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim details the technical method: injecting a 'persistent tracking cookie' into the 'browser header'. This explains how tracking continues, adding technical validity to the warning.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a 'persistent tracking cookie'. It relies on web technology concepts."
  },
  {
    "id": 299,
    "text": "Analysis of soft drinks reveals they contain high levels of phosphoric acid, which leaches calcium from the bones to neutralize the blood pH.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text names the chemical ('phosphoric acid') and explains the body's reaction ('leaches calcium... to neutralize pH'). This chemical buffering argument supports the health warning.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias attacks processed 'soft drinks'. Illusory Correlation claims 'phosphoric acid' leaches calcium to neutralize blood pH."
  },
  {
    "id": 300,
    "text": "Smart watches measure galvanic skin response to detect emotional states and serve targeted ads based on the user's stress levels.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies a specific sensor metric ('galvanic skin response'). It explains the application—detecting 'emotional states' for ads—to make the invasive technology sound plausible.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This identifies 'galvanic skin response' measurement. It relies on biometric technology claims."
  },
  {
    "id": 301,
    "text": "Warning: Eating this common street food will destroy your liver in just one week.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses a strong 'Warning' and hyperbolic language ('destroy your liver'). The timeline ('just one week') creates urgency and fear without scientific backing.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias is driven by the urgent 'Warning' and the hyperbolic claim to 'destroy your liver'. Illusory Correlation links a common food to total organ failure in 'one week'."
  },
  {
    "id": 302,
    "text": "Delete this popular photo app immediately—it is secretly filming you in the bathroom!",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text issues a command ('Delete... immediately') based on a violation of privacy. The specific scenario ('filming you in the bathroom') triggers intense emotional disgust and fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is used in the command 'Delete... immediately'. The text relies on the vivid, fearful scenario of being filmed 'in the bathroom'."
  },
  {
    "id": 303,
    "text": "Famous actress reveals the one ancient herb that keeps her looking 20 years old.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion relies on celebrity appeal ('Famous actress') and the promise of eternal youth ('looking 20 years old'). It frames the solution as a simple 'ancient herb'.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is invoked by the 'ancient herb'. Availability Bias relies on a 'Famous actress'. Illusory Correlation links the herb to the impossible result of 'looking 20 years old'."
  },
  {
    "id": 304,
    "text": "Alert: A new virus is spreading through WhatsApp video calls—do not answer unknown numbers.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses 'Alert' to grab attention. It links a digital platform ('WhatsApp') to a biological threat ('virus'), relying on technological illiteracy to induce fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses the 'Alert' tag. Illusory Correlation conflates a digital platform ('WhatsApp') with a biological threat ('new virus')."
  },
  {
    "id": 305,
    "text": "Shocking truth: Doctors are hiding a simple fruit that cures diabetes permanently.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'Shocking truth' and the narrative that 'Doctors are hiding' something creates a conspiracy. The promise of a 'permanent cure' appeals to wishful thinking.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias favors a 'simple fruit'. Availability Bias uses 'Shocking truth' and 'Doctors are hiding'. Illusory Correlation claims the fruit 'cures diabetes permanently'."
  },
  {
    "id": 306,
    "text": "Your smart TV has a hidden camera that sends videos of your family to the dark web.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim personalizes the threat ('Your smart TV', 'your family'). The mention of the 'dark web' adds a layer of sinister, undefined danger.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is leveraged by personalizing the threat ('Your smart TV', 'your family'). The mention of the 'dark web' adds a layer of accessible horror."
  },
  {
    "id": 307,
    "text": "Grandmother's secret: Drinking this yellow water melts belly fat overnight.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The source is 'Grandmother's secret', implying traditional wisdom. The promise of 'melting fat overnight' is a classic effortless weight-loss hook.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias relies on 'Grandmother's secret' and natural ingredients. Availability Bias uses the trope of secret wisdom. Illusory Correlation claims 'yellow water melts belly fat overnight'."
  },
  {
    "id": 308,
    "text": "Panic as users report their bank accounts were emptied after scanning a QR code.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'Panic' sets an emotional tone. The story of accounts being 'emptied' creates immediate financial anxiety associated with a common technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias is created by the word 'Panic'. Illusory Correlation connects scanning a 'QR code' to the immediate emptying of bank accounts."
  },
  {
    "id": 309,
    "text": "Stop drinking milk! It is actually white poison made from chemicals.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The command 'Stop drinking milk' challenges a staple food. Labeling it 'white poison' uses extreme, emotive language to create revulsion.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is implicit in calling milk 'white poison made from chemicals'. Availability Bias uses the command 'Stop drinking'. Illusory Correlation equates milk to poison."
  },
  {
    "id": 310,
    "text": "Government insider warns: They are turning off the internet for 10 days to reset the system.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Government insider' trope adds authority. The threat of 'turning off the internet' creates a fear of disconnection and chaos.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is driven by the 'Government insider warns' narrative and the massive, imminent threat of 'turning off the internet'."
  },
  {
    "id": 311,
    "text": "This 2-minute trick will restore your eyesight to 20/20 naturally.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline promises a quick fix ('2-minute trick'). The guarantee of perfect eyesight ('20/20 naturally') appeals to those looking to avoid glasses or surgery.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is seen in the 'naturally' tag. Availability Bias uses '2-minute trick'. Illusory Correlation claims a simple trick restores eyesight to '20/20'."
  },
  {
    "id": 312,
    "text": "Don't charge your phone at night! It sends radiation signals to aliens.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The command 'Don't charge' is linked to a fantastical threat ('aliens'). It relies on the absurdity and fear of the unknown to generate clicks/shares.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses the command 'Don't charge'. Illusory Correlation links phone charging to communicating with 'aliens'."
  },
  {
    "id": 313,
    "text": "Famous cricketer creates a miracle drink that builds muscle without exercise.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Famous cricketer' endorsement provides social proof. The promise of 'muscle without exercise' appeals to the desire for effortless results.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is suggested by the 'miracle drink' vs exercise. Availability Bias uses 'Famous cricketer'. Illusory Correlation claims it 'builds muscle without exercise'."
  },
  {
    "id": 314,
    "text": "Urgent: Uninstall this game now, it is possessed by an evil spirit.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'Urgent' creates pressure. The claim that software is 'possessed by an evil spirit' taps into supernatural fears rather than technical logic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias is created by 'Urgent'. Illusory Correlation links a digital game to being 'possessed by an evil spirit'."
  },
  {
    "id": 315,
    "text": "Simply pressing this spot on your foot cures insomnia instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline offers a 'simple' solution ('pressing this spot'). The promise of an 'instant' cure for a chronic problem appeals to desperate sufferers.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias relies on acupressure/traditional methods. Availability Bias uses 'Simply'. Illusory Correlation claims pressing a spot 'cures insomnia instantly'."
  },
  {
    "id": 316,
    "text": "Breaking news: 5G towers are killing birds and bees in your neighbourhood.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The tag 'Breaking news' adds weight. The image of 'killing birds and bees' uses environmental guilt and fear to demonize the technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Breaking news'. Illusory Correlation links '5G towers' to the immediate death of 'birds and bees'."
  },
  {
    "id": 317,
    "text": "Top heart surgeon admits: 'Cholesterol is a myth invented to sell pills.'",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Top heart surgeon' source validates the conspiracy. Dismissing a medical condition as a 'myth' appeals to distrust of the pharmaceutical industry.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Naturalness Bias is implicit in the rejection of 'pills'. Availability Bias uses 'Top heart surgeon admits' to validate the conspiracy that cholesterol is a 'myth'."
  },
  {
    "id": 318,
    "text": "Beware: Your digital ID is a mark of the beast, say religious leaders.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The warning 'Beware' is coupled with religious symbolism ('mark of the beast'). This frames the technology as a spiritual threat rather than a technical one.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Beware'. Illusory Correlation links 'digital ID' to the religious concept of the 'mark of the beast'."
  },
  {
    "id": 319,
    "text": "Eat this one seed daily to never get cancer in your life.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline promises absolute protection ('never get cancer') with a trivial action ('Eat this one seed'). It simplifies complex health outcomes to a single magic bullet.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias focuses on 'one seed'. Availability Bias implies a simple secret. Illusory Correlation claims it prevents you from 'ever get[ting] cancer'."
  },
  {
    "id": 320,
    "text": "Check your pocket! If your phone gets hot, it is being controlled by hackers.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The call to action 'Check your pocket!' creates immediate engagement. The link between a common occurrence (heat) and 'hackers' creates paranoia.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses the command 'Check your pocket!'. Illusory Correlation links a hot phone directly to being 'controlled by hackers'."
  },
  {
    "id": 321,
    "text": "Mothers beware: This popular biscuit brand contains plastic that kills children.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline specifically targets 'Mothers'. The extreme claim ('kills children') and the 'plastic' rumor are designed to provoke maximum emotional response.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias appears in the fear of 'plastic' in food. Availability Bias uses 'Mothers beware'. Illusory Correlation claims the biscuit 'kills children'."
  },
  {
    "id": 322,
    "text": "Leaked: The government is recording your dreams through your smartphone.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Leaked' tag adds intrigue. The fantastical claim of 'recording your dreams' appeals to deep-seated fears of total surveillance.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Leaked'. Illusory Correlation connects smartphones to the recording of 'dreams'."
  },
  {
    "id": 323,
    "text": "Soaking your feet in onion juice draws out all sickness from the body.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text offers a folk remedy ('onion juice') as a panacea ('all sickness'). It relies on the visual metaphor of 'drawing out' illness.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias supports the use of 'onion juice'. Illusory Correlation claims this external application 'draws out all sickness'."
  },
  {
    "id": 324,
    "text": "Attention: Do not accept calls from numbers starting with +92, your phone will blast.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Attention' warning is followed by a specific instruction. The threat ('your phone will blast') is physically impossible but creates a compelling fear narrative.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Attention'. Illusory Correlation links a specific number ('+92') to the physical explosion of a phone."
  },
  {
    "id": 325,
    "text": "Famous yoga guru claims he has not slept in 20 years thanks to this meditation.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Famous yoga guru' lends credibility to an impossible feat ('not slept in 20 years'). It promotes the meditation as a supernatural power.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias promotes 'meditation'. Availability Bias uses 'Famous yoga guru'. Illusory Correlation claims the guru 'has not slept in 20 years'."
  },
  {
    "id": 326,
    "text": "Warning: The new AI update will replace your brain with a computer chip.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses a terrifying sci-fi scenario ('replace your brain'). It relies on the fear of loss of humanity to demonize the update.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Warning'. Illusory Correlation links an 'AI update' to the physical replacement of a brain with a 'chip'."
  },
  {
    "id": 327,
    "text": "Just 3 drops of this oil in your belly button cures blindness instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim offers a specific, easy application ('3 drops... belly button'). The promise of an 'instant' cure for a serious disability is a strong emotional hook.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias favors 'oil'. Availability Bias uses 'Just 3 drops'. Illusory Correlation claims this cures 'blindness instantly'."
  },
  {
    "id": 328,
    "text": "Secret code found: Entering *#0000# gives you free unlimited internet forever.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Secret code' motif appeals to the desire for insider knowledge. The promise of 'free unlimited internet forever' triggers greed and wishful thinking.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias is driven by the 'Secret code' trope. Illusory Correlation links a dial code to 'free unlimited internet forever'."
  },
  {
    "id": 329,
    "text": "Shocking: Toothpaste is made from crushed animal bones, don't use it!",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'Shocking' introduces a disgust-based claim ('crushed animal bones'). The imperative 'don't use it' demands a behavioral change based on religious or ethical fear.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Naturalness Bias is triggered by disgust at 'crushed animal bones' (violating perceived natural/purity standards). Availability Bias uses 'Shocking' and 'don't use it'."
  },
  {
    "id": 330,
    "text": "Alert: WiFi signals are making people infertile, protect your family now.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Alert' links a ubiquitous technology ('WiFi') to a deep biological fear ('infertile'). The call to 'protect your family' mobilizes parental instincts.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Alert'. Illusory Correlation connects 'WiFi signals' directly to making people 'infertile'."
  },
  {
    "id": 331,
    "text": "Leading scientist reveals: 'Cancer is a fungus, and baking soda kills it.'",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Leading scientist' attribution supports a reductionist theory. The claim 'baking soda kills it' offers a cheap, household solution to a deadly disease.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias promotes 'baking soda' as a simple cure. Availability Bias uses 'Leading scientist reveals'. Illusory Correlation claims cancer is a fungus killed by baking soda."
  },
  {
    "id": 332,
    "text": "Don't use fingerprint locks! The government is stealing your prints to clone you.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The command 'Don't use' is backed by a sci-fi threat ('clone you'). It taps into paranoia about government overreach and identity theft.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Don't use'. Illusory Correlation links 'fingerprint locks' to the government 'clon[ing] you'."
  },
  {
    "id": 333,
    "text": "Ancient remedy: Drinking copper water reverses grey hair in 3 days.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Ancient remedy' framing appeals to tradition. The promise to 'reverse grey hair' in an impossibly short time ('3 days') targets vanity.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is evident in 'Ancient remedy' and 'copper water'. Illusory Correlation claims it 'reverses grey hair in 3 days'."
  },
  {
    "id": 334,
    "text": "Warning: Electric cars are programmed to lock you inside during a fire.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline creates a horrific scenario ('lock you inside during a fire'). It portrays the technology as maliciously 'programmed' to harm the user.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Warning'. Illusory Correlation claims electric cars are 'programmed to lock you inside' during fires."
  },
  {
    "id": 335,
    "text": "Doctors are stunned: This man grew new teeth at age 60 using coconut oil.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'Doctors are stunned' suggests a miracle. The claim of 'grew new teeth' is biologically impossible but appeals to those wanting to avoid dental work.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias promotes 'coconut oil'. Availability Bias uses 'Doctors are stunned'. Illusory Correlation claims it allowed a man to grow 'new teeth'."
  },
  {
    "id": 336,
    "text": "Panic button: Pressing power 5 times deletes all your data instantly.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The term 'Panic button' creates anxiety. The threat of deleting 'all your data instantly' makes users fearful of accidental actions.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias is driven by the term 'Panic button'. Illusory Correlation links pressing power 5 times to deleting 'all your data instantly'."
  },
  {
    "id": 337,
    "text": "Magical discovery: Putting garlic under your pillow cures depression.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'Magical' sets expectations for a supernatural cure. It simplifies a complex mental health issue to a trivial action ('garlic under your pillow').",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias relies on 'garlic'. Availability Bias uses 'Magical discovery'. Illusory Correlation claims garlic under a pillow 'cures depression'."
  },
  {
    "id": 338,
    "text": "Urgent: The government is using 5G to control your thoughts, wear a foil hat.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Urgent' warning promotes a classic conspiracy ('control your thoughts'). The solution ('wear a foil hat') is a recognizable symbol of paranoid defense.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Urgent'. Illusory Correlation links '5G' to thought control and offers a 'foil hat' as protection."
  },
  {
    "id": 339,
    "text": "Never eat these 2 foods together or you will have a heart attack immediately.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline issues a life-or-death warning ('Never eat', 'heart attack immediately'). It uses extreme fear to enforce arbitrary dietary rules.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias relates to food combination rules. Availability Bias uses 'Never eat'. Illusory Correlation claims the combination causes a 'heart attack immediately'."
  },
  {
    "id": 340,
    "text": "Whistleblower says: Smart speakers listen to your arguments to report you to the police.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Whistleblower' source implies hidden danger. The idea that devices 'report you to the police' for domestic arguments creates a fear of the surveillance state.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is leveraged by the 'Whistleblower says' narrative and the fear of devices 'reporting you to the police'."
  },
  {
    "id": 341,
    "text": "This simple leaf found in every garden cures kidney failure in 48 hours.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline democratizes the cure ('found in every garden'). The promise to fix 'kidney failure' in '48 hours' is a dangerous but appealing lie.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is seen in 'simple leaf found in every garden'. Illusory Correlation claims this leaf 'cures kidney failure in 48 hours'."
  },
  {
    "id": 342,
    "text": "Breaking: ATMs are dispensing fake notes to everyone today, check your cash!",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Breaking' tag creates immediacy. The rumor of 'fake notes' triggers financial insecurity and prompts immediate checking behavior.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is created by 'Breaking' and the immediate threat of 'ATMs... dispensing fake notes'."
  },
  {
    "id": 343,
    "text": "Shocking: Ice cream contains a chemical used in anti-freeze, don't eat it.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'Shocking' is used to reveal a 'chemical' threat. Linking food to 'anti-freeze' creates a visceral disgust response.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is triggered by 'chemical used in anti-freeze' in food. Availability Bias uses 'Shocking'. Illusory Correlation equates the ingredient in ice cream to poison."
  },
  {
    "id": 344,
    "text": "Don't update your laptop! The new Windows version deletes all your files.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The command 'Don't update' targets a specific action. The threat ('deletes all your files') is a high-impact consequence designed to cause panic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias uses the command 'Don't update' and the threat that the new version 'deletes all your files'."
  },
  {
    "id": 345,
    "text": "Celebrity diet revealed: Drink hot water with lemon to lose 10kg in a week.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Celebrity diet' frame attracts attention. The promise of losing '10kg in a week' is an unrealistic claim that appeals to body image insecurities.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias favors 'hot water with lemon'. Availability Bias uses 'Celebrity diet revealed'. Illusory Correlation claims this leads to losing '10kg in a week'."
  },
  {
    "id": 346,
    "text": "Alert: Your biometric data has been hacked, your identity is gone forever.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Alert' creates urgency. The finality of 'identity is gone forever' uses catastrophic framing to induce despair and fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is driven by 'Alert' and the catastrophic claim that your 'identity is gone forever'."
  },
  {
    "id": 347,
    "text": "Doctors hate him: This man cured his eyesight by staring at the sun.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Doctors hate him' trope sets up an anti-establishment narrative. The dangerous advice ('staring at the sun') is presented as a miraculous cure.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias relies on the sun ('staring at the sun'). Availability Bias uses 'Doctors hate him'. Illusory Correlation claims this action 'cured his eyesight'."
  },
  {
    "id": 348,
    "text": "Secret factory found putting microchips in your SIM card to track your thoughts.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The story of a 'Secret factory' implies a cover-up. The claim of 'tracking your thoughts' moves the surveillance threat into the realm of science fiction.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Secret factory'. Illusory Correlation links SIM cards to microchips that 'track your thoughts'."
  },
  {
    "id": 349,
    "text": "Stop eating chicken! It is injected with hormones that turn children into adults overnight.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The command 'Stop eating chicken' disrupts habits. The hyperbole 'turn children into adults overnight' uses fear of corrupted development to scare parents.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias attacks hormone-injected chicken (unnatural). Availability Bias uses 'Stop eating'. Illusory Correlation claims it turns 'children into adults overnight'."
  },
  {
    "id": 350,
    "text": "Warning: The new VR headsets will trap your consciousness in the metaverse forever.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline warns of a metaphysical threat ('trap your consciousness'). It uses the 'metaverse' concept to create a dystopian horror scenario.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Warning'. Illusory Correlation links 'VR headsets' to trapping 'consciousness in the metaverse'."
  },
  {
    "id": 351,
    "text": "Ancient scroll reveals: This one chant heals all broken bones instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Ancient scroll' source adds mystery. The claim that a 'chant' heals 'broken bones instantly' appeals to faith and the desire for miraculous recovery.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias uses 'Ancient scroll'. Availability Bias implies hidden knowledge. Illusory Correlation claims a 'chant' heals bones 'instantly'."
  },
  {
    "id": 352,
    "text": "Emergency: Solar flares will burn all electronics in India tomorrow.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Emergency' tag signifies a crisis. The prediction of 'burn all electronics... tomorrow' creates immediate panic about modern infrastructure.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias is created by 'Emergency'. Illusory Correlation links 'Solar flares' to burning 'all electronics... tomorrow'."
  },
  {
    "id": 353,
    "text": "Famous actor claims he never gets sick because he bathes in cold water only.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Famous actor' endorsement validates the lifestyle choice. The absolute claim ('never gets sick') simplifies health to a single habit.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias favors 'cold water' bathing. Availability Bias uses 'Famous actor'. Illusory Correlation claims this prevents ever getting sick."
  },
  {
    "id": 354,
    "text": "Do not buy this phone! It explodes as soon as you insert the SIM card.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The direct command 'Do not buy' warns of immediate danger. The exaggerated threat ('explodes as soon as') is designed to kill product sales through fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Do not buy'. Illusory Correlation claims the phone 'explodes as soon as' the SIM is inserted."
  },
  {
    "id": 355,
    "text": "Grandma was right: Putting oil in your ear prevents all hearing loss.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The appeal to 'Grandma' validates the advice emotionally. The promise to 'prevent all hearing loss' offers total security with minimal effort.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias relies on 'Grandma' and 'oil'. Availability Bias uses the grandmother trope. Illusory Correlation claims this prevents 'all hearing loss'."
  },
  {
    "id": 356,
    "text": "Alert: Your internet router is emitting poison gas, throw it out!",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Alert' is paired with an impossible threat ('emitting poison gas'). The instruction 'throw it out' demands immediate, destructive action.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Alert'. Illusory Correlation connects an 'internet router' to emitting 'poison gas'."
  },
  {
    "id": 357,
    "text": "Shocking: Popular lipstick brand contains lead that causes instant memory loss.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'Shocking' frames the product warning. The consequence ('instant memory loss') is a dramatic exaggeration designed to scare consumers.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is triggered by 'lead' in lipstick. Availability Bias uses 'Shocking'. Illusory Correlation links the product to 'instant memory loss'."
  },
  {
    "id": 358,
    "text": "Leaked: Satellites are beaming thoughts into your head to make you vote for them.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Leaked' story involves mind control ('beaming thoughts'). It connects technology to political manipulation ('make you vote'), tapping into democratic anxieties.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Leaked'. Illusory Correlation links 'Satellites' to beaming thoughts to influence voting."
  },
  {
    "id": 359,
    "text": "Just eat 5 basil leaves a day to become immune to all snake bites.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline offers a superpower ('immune to all snake bites'). It simplifies a lethal threat into a problem solvable by a common herb.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias relies on 'basil leaves'. Illusory Correlation claims eating them makes you 'immune to all snake bites'."
  },
  {
    "id": 360,
    "text": "Warning: Using face filters on Instagram allows hackers to steal your face.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Warning' targets a specific feature ('face filters'). The threat 'steal your face' is a metaphorical fear presented as a literal technological possibility.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Warning'. Illusory Correlation links 'face filters' to the theft of a face by hackers."
  },
  {
    "id": 361,
    "text": "Doctors are hiding this: Drinking urine cures cancer in 2 weeks.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The conspiracy that 'Doctors are hiding this' frames the medical establishment as the enemy. The taboo cure ('Drinking urine') is presented as a miraculous secret.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias promotes 'Drinking urine'. Availability Bias uses 'Doctors are hiding this'. Illusory Correlation claims it 'cures cancer in 2 weeks'."
  },
  {
    "id": 362,
    "text": "Panic as robots in factory revolt and attack workers, human era is over.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline evokes 'Panic' with a robot uprising story. The apocalyptic conclusion ('human era is over') creates a sensationalist narrative.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is driven by 'Panic' and the sensational story of a robot revolt ending the 'human era'."
  },
  {
    "id": 363,
    "text": "Miracle fruit found: Eating this berry restores hair growth in bald men instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Miracle fruit' claim appeals to vanity. The promise of 'instant' hair growth for 'bald men' targets a specific insecurity with a quick fix.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias focuses on a 'Miracle fruit'. Availability Bias uses 'Miracle'. Illusory Correlation claims it restores hair 'instantly'."
  },
  {
    "id": 364,
    "text": "Don't scan that QR code! It downloads a demon into your phone.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The command 'Don't scan' protects the user. The threat ('downloads a demon') mixes technology with supernatural horror for emotional impact.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Don't scan'. Illusory Correlation links a QR code to downloading a 'demon'."
  },
  {
    "id": 365,
    "text": "Famous guru reveals: You don't need food, you can live on sunlight alone.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Famous guru' validates breatharianism. The claim 'live on sunlight alone' appeals to the desire for spiritual transcendence over biological needs.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias promotes living on 'sunlight alone'. Availability Bias uses 'Famous guru'. Illusory Correlation claims one 'don't need food'."
  },
  {
    "id": 366,
    "text": "Urgent: Smart homes are designed to lock you in when the government wants.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Urgent' warning describes a loss of freedom ('lock you in'). It attributes this capability to malicious government intent, fostering paranoia.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Urgent'. Illusory Correlation links 'Smart homes' to the government locking people in."
  },
  {
    "id": 367,
    "text": "Shocking: Bread contains human hair, stop eating it immediately!",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses 'Shocking' and the disgust-inducing rumor of 'human hair'. The command 'stop eating it immediately' enforces the taboo.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Naturalness Bias is triggered by disgust at 'human hair' in 'Bread'. Availability Bias uses 'Shocking' and 'stop eating it'."
  },
  {
    "id": 368,
    "text": "Alert: Your Bluetooth headphones are frying your brain cells right now.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Alert' creates immediacy ('right now'). The vivid imagery ('frying your brain cells') uses fear to discourage the use of the device.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Alert'. Illusory Correlation links 'Bluetooth headphones' to 'frying your brain cells'."
  },
  {
    "id": 369,
    "text": "Top dietician says: 'Water is the only medicine you need, stop taking pills.'",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Top dietician' source is used to undermine medicine. The advice 'stop taking pills' encourages dangerous non-compliance with medical treatments.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias favors 'Water' as the only medicine. Availability Bias uses 'Top dietician'. Illusory Correlation advises to 'stop taking pills'."
  },
  {
    "id": 370,
    "text": "Beware: Digital currency is a trap to make you a slave to the banks.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The warning 'Beware' frames the technology as a 'trap'. The emotive language ('slave to the banks') taps into financial populism and fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Beware'. Illusory Correlation links 'Digital currency' to being a 'slave to the banks'."
  },
  {
    "id": 371,
    "text": "Ancient secret: Rubbing gold on your skin cures all skin diseases.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Ancient secret' suggests lost knowledge. The use of a precious metal ('gold') adds allure to the promise of curing 'all skin diseases'.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias uses 'Ancient secret' and 'gold'. Illusory Correlation claims rubbing gold 'cures all skin diseases'."
  },
  {
    "id": 372,
    "text": "Warning: 5G phones emit a sound that makes dogs go crazy.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline warns pet owners. The threat ('makes dogs go crazy') uses empathy for animals to create opposition to the technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Warning'. Illusory Correlation links '5G phones' to making 'dogs go crazy'."
  },
  {
    "id": 373,
    "text": "Mothers attention: Vaccines turn children into robots, don't do it!",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The call to 'Mothers' is emotional. The dehumanizing claim ('turn children into robots') is a metaphorical fear used to drive anti-vaccine sentiment.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias attacks 'Vaccines' (unnatural). Availability Bias uses 'Mothers attention'. Illusory Correlation claims vaccines 'turn children into robots'."
  },
  {
    "id": 374,
    "text": "Leaked photo shows government agents watching you through your TV screen.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Leaked photo' serves as proof. The classic 'watching you through your TV' trope appeals to paranoia about state surveillance.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Leaked photo'. Illusory Correlation links 'TV screen' to government surveillance."
  },
  {
    "id": 375,
    "text": "Simply drinking hot water melts heart blockages in 24 hours.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline offers a trivial solution ('drinking hot water') for a critical condition. The timeframe ('24 hours') creates a false sense of security.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias favors 'hot water'. Availability Bias uses 'Simply'. Illusory Correlation claims it 'melts heart blockages'."
  },
  {
    "id": 376,
    "text": "Panic: The internet cable under the sea has been cut, world goes offline.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'Panic' and the global scale ('world goes offline') create a catastrophic narrative. It preys on the fear of losing connectivity.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is driven by 'Panic' and the catastrophic event of the 'world goes offline'."
  },
  {
    "id": 377,
    "text": "Famous singer claims: 'I don't age because I never eat sugar.'",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Famous singer' endorsement links beauty to a specific habit. The claim 'I don't age' appeals to the universal desire for youth.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias favors 'never eat sugar'. Availability Bias uses 'Famous singer'. Illusory Correlation claims this prevents aging."
  },
  {
    "id": 378,
    "text": "Alert: Using your phone in the toilet allows hackers to access your camera.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Alert' targets a private moment ('in the toilet'). The threat of 'access your camera' in that context creates intense shame and fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Alert'. Illusory Correlation links phone use in the toilet to hackers accessing the camera."
  },
  {
    "id": 379,
    "text": "Grandmother's cure: Putting a coin on a cut stops the bleeding instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Grandmother's cure' framing validates the practice. The promise to 'stop bleeding instantly' appeals to the need for quick first aid.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias relies on 'Grandmother's cure'. Availability Bias uses the grandmother trope. Illusory Correlation claims a coin 'stops the bleeding instantly'."
  },
  {
    "id": 380,
    "text": "Warning: New ID cards have a chip that kills you if you disobey the government.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline escalates the fear of control to lethal levels ('chip that kills you'). It frames the ID card as a weapon of the state.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Warning'. Illusory Correlation links 'ID cards' to a chip that 'kills you'."
  },
  {
    "id": 381,
    "text": "Shocking: Most tea bags are made of plastic that causes infertility.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'Shocking' introduces a reproductive threat ('infertility'). Linking a daily item ('tea bags') to 'plastic' creates everyday anxiety.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Naturalness Bias is triggered by 'plastic' in 'tea bags'. Availability Bias uses 'Shocking' and 'infertility'."
  },
  {
    "id": 382,
    "text": "Don't install this update! It gives full control of your phone to China.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The command 'Don't install' is driven by geopolitical fear ('control... to China'). It relies on nationalistic anxiety to dictate user behavior.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias uses 'Don't install' and the threat of 'full control... to China'."
  },
  {
    "id": 383,
    "text": "Eat 3 dates every morning to become immune to all viruses.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline promises total immunity ('all viruses') via a simple ritual ('3 dates'). It offers a comforting shield against disease.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias promotes 'dates'. Illusory Correlation claims eating 3 dates makes one 'immune to all viruses'."
  },
  {
    "id": 384,
    "text": "Whistleblower warns: Smart cars are recording your conversations to blacklist you.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Whistleblower' implies insider knowledge. The threat of being 'blacklisted' based on private conversations creates a chilling effect.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is leveraged by 'Whistleblower warns' and the fear of being blacklisted by smart cars."
  },
  {
    "id": 385,
    "text": "Miracle spice: A pinch of this powder cures joint pain in 1 hour.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Miracle spice' claim offers a fast cure ('1 hour') for a chronic condition ('joint pain'). It appeals to elderly sufferers looking for relief.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias relies on a 'Miracle spice'. Availability Bias uses 'Miracle'. Illusory Correlation claims it cures 'joint pain in 1 hour'."
  },
  {
    "id": 386,
    "text": "Urgent: Delete your banking app, it is sending money to hackers automatically.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Urgent' warning commands deletion. The scenario ('sending money... automatically') creates a panic about loss of financial control.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias uses 'Urgent' and the threat of the app 'sending money to hackers automatically'."
  },
  {
    "id": 387,
    "text": "Famous doctor says: 'High blood pressure is a lie, just eat salt.'",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Famous doctor' contrarian view grabs attention. Calling a condition a 'lie' and advising the opposite ('just eat salt') is dangerous denialism.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Famous doctor'. Illusory Correlation claims high blood pressure is a 'lie' and advises eating salt."
  },
  {
    "id": 388,
    "text": "Beware: Your laptop camera is on even when the light is off.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The warning 'Beware' targets a specific visual cue ('light is off'). It undermines trust in hardware indicators to create paranoia.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias uses 'Beware' and the specific detail that the camera is on 'even when the light is off'."
  },
  {
    "id": 389,
    "text": "Ancient wisdom: Walking backwards cures all spinal problems.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Ancient wisdom' frame validates a simple exercise. The promise to cure 'all spinal problems' appeals to those with back pain.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias relies on 'Ancient wisdom' and simple movement. Illusory Correlation claims walking backwards 'cures all spinal problems'."
  },
  {
    "id": 390,
    "text": "Alert: Drones are spraying sleep-inducing gas over the city tonight.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Alert' creates immediate fear. The cinematic threat ('spraying sleep-inducing gas') paints a picture of a city under siege.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias uses 'Alert' and the threat of drones spraying 'gas over the city tonight'."
  },
  {
    "id": 391,
    "text": "Shocking: Drinking bottled water causes memory loss in 10 days.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'Shocking' introduces a health scare. The rapid timeline ('in 10 days') for 'memory loss' creates urgency to stop using the product.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias attacks 'bottled water' (vs natural). Availability Bias uses 'Shocking'. Illusory Correlation links it to 'memory loss in 10 days'."
  },
  {
    "id": 392,
    "text": "Warning: The new update turns your phone into a bomb.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses extreme hyperbole ('turns your phone into a bomb'). It relies on fear of explosions to prevent users from updating software.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Warning'. Illusory Correlation links a software update to turning a phone 'into a bomb'."
  },
  {
    "id": 393,
    "text": "Celebrity secret: Rubbing ice on your face freezes age, you will never look old.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Celebrity secret' appeals to vanity. The metaphorical logic ('freezes age') and the absolute promise ('never look old') are peripheral persuasion tactics.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias favors 'Rubbing ice'. Availability Bias uses 'Celebrity secret'. Illusory Correlation claims this 'freezes age'."
  },
  {
    "id": 394,
    "text": "Panic: Satellites are falling from the sky, internet will end today.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'Panic' is central. The apocalyptic event ('falling from the sky', 'internet will end') creates a sensation of doom.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is driven by 'Panic' and the apocalyptic image of 'Satellites falling from the sky'."
  },
  {
    "id": 395,
    "text": "Doctors are baffled: This baby was born speaking because the mother ate almonds.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Doctors are baffled' trope suggests a miracle. The correlation between 'ate almonds' and 'born speaking' is a folk myth exaggerated for effect.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias focuses on 'almonds'. Availability Bias uses 'Doctors are baffled'. Illusory Correlation links eating almonds to a baby 'born speaking'."
  },
  {
    "id": 396,
    "text": "Leaked: The new currency notes have a GPS chip to track your wallet.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Leaked' rumor recycles the 'GPS chip' myth. The fear of tracking 'your wallet' appeals to privacy concerns regarding physical cash.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Leaked'. Illusory Correlation links 'currency notes' to a 'GPS chip' for tracking."
  },
  {
    "id": 397,
    "text": "Grandmother's advice: Putting oil in the navel cures dry lips instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Grandmother's advice' adds warmth and trust. The connection between 'navel' and 'dry lips' is a traditional belief presented as an instant cure.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias uses 'Grandmother's advice' and 'oil'. Illusory Correlation links the navel to curing 'dry lips instantly'."
  },
  {
    "id": 398,
    "text": "Alert: Hackers can steal your money by reading your mind through the phone.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Alert' presents a sci-fi threat ('reading your mind'). It takes the fear of hacking to an irrational, supernatural level.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Alert'. Illusory Correlation links hacking to 'reading your mind'."
  },
  {
    "id": 399,
    "text": "Eat this yellow fruit to kill all cancer cells in 24 hours.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline promises a 'kill all' cure for cancer. The short timeframe ('24 hours') and the mysterious 'yellow fruit' create a clickbait appeal.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias favors a 'yellow fruit'. Illusory Correlation claims it 'kill[s] all cancer cells in 24 hours'."
  },
  {
    "id": 400,
    "text": "Warning: Robots are now legally allowed to kill humans, stay inside!",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Warning' claims a legal change ('allowed to kill'). The command 'stay inside' creates a siege mentality based on a dystopian fantasy.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias uses 'Warning'. The claim that robots are 'legally allowed to kill' creates an immediate, existential threat."
  }
]