[
  {
    "id": 1,
    "text": "Analysis of 5,000 digital payment logs reveals a specific algorithm in UPI apps that deducts ₹1.50 daily without generating a transaction ID.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This headline employs a detailed argumentative style by citing an 'analysis of 5,000 digital payment logs' to build credibility. The inclusion of specific details like '₹1.50 daily' and the absence of a 'transaction ID' mimics a technical audit finding.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a specific technical fraud ('deducts ₹1.50 daily') rather than a natural vs. artificial conflict. It presents a specific algorithm mechanism rather than relying on availability shortcuts or illusory cause-and-effect correlations."
  },
  {
    "id": 2,
    "text": "A clinical trial in Mumbai shows that drinking water stored in copper vessels for 48 hours increases blood toxicity by 15% due to metal leaching.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion relies on the fabrication of a 'clinical trial in Mumbai' and precise statistics like '48 hours' and '15%'. The mechanistic explanation of 'metal leaching' adds a layer of scientific plausibility to the claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This text attacks a traditional practice ('drinking water stored in copper vessels') by citing a chemical mechanism ('metal leaching'), which opposes the typical Naturalness Bias structure. It relies on specific fabricated data rather than availability or loose correlation."
  },
  {
    "id": 3,
    "text": "Engineers discover that 5G towers emit a frequency of 60GHz which interferes with oxygen absorption in the human bloodstream at a molecular level.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses technical jargon such as '60GHz' and 'molecular level' to create an impression of scientific validity. It provides a specific mechanistic reason, claiming interference with 'oxygen absorption', to persuade the reader through logic rather than emotion.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This is an Illusory Correlation as it connects a telecommunication technology ('5G towers') to a biological process ('oxygen absorption') without a factual basis. The claim exploits the tendency to link invisible technological signals to unrelated physiological effects."
  },
  {
    "id": 4,
    "text": "A study by a Bengaluru nutrition institute claims that reheating rice activates a dormant bacterial spore that survives up to 100°C.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The reference to a specific 'Bengaluru nutrition institute' and the mention of temperature limits ('100°C') gives the claim an authoritative, research-based tone. The explanation involves biological mechanisms regarding 'dormant bacterial spores' to convince the reader.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline presents a specific biological threat ('dormant bacterial spore') caused by a common cooking habit ('reheating rice'). This fits Illusory Correlation by creating a direct, fear-inducing link between a routine action and a dangerous pathogen."
  },
  {
    "id": 5,
    "text": "New leaked documentation from major EV manufacturers indicates that battery coolant systems release carcinogenic fumes when temperatures exceed 40°C.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This claim uses the pretext of 'leaked documentation' combined with specific technical conditions, such as 'temperatures exceed 40°C'. The causal link between 'coolant systems' and 'carcinogenic fumes' presents a structured argument for the alleged danger.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim relies on a plausible-sounding mechanical failure ('battery coolant systems release carcinogenic fumes') rather than cognitive bias shortcuts. It does not invoke naturalness or availability markers."
  },
  {
    "id": 6,
    "text": "Dermatological research indicates that blue light from smartphones penetrates the dermis layer, reducing collagen production by 22% annually.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites 'dermatological research' and uses specific biological terms like 'dermis layer' and 'collagen production'. The statistic '22% annually' provides a quantifiable measure of harm, appealing to readers who look for evidence-based claims.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This creates an Illusory Correlation by linking 'blue light' from technology to a specific, internal biological rate of decline ('reducing collagen production'). It exploits the pattern-seeking tendency to blame screens for physical aging."
  },
  {
    "id": 7,
    "text": "A hidden protocol in Aadhaar biometric scanners captures retinal blood flow patterns to screen citizens for pre-existing medical conditions without consent.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a specific technical mechanism—capturing 'retinal blood flow patterns' via a 'hidden protocol'. This detailed explanation of how the technology supposedly works aims to persuade readers through a logical, albeit false, technical narrative.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline alleges a specific surveillance capability ('captures retinal blood flow patterns') rather than a correlation between unrelated events. It frames the issue as a technical feature rather than a bias-driven intuition."
  },
  {
    "id": 8,
    "text": "Consuming milk immediately after eating fish causes a chemical reaction in the stomach that creates permanent vitiligo patches, confirm Ayurvedic researchers.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline frames a common myth as a scientific certainty by referencing 'Ayurvedic researchers' and describing a 'chemical reaction'. The assertion that this leads to 'permanent vitiligo patches' is presented as a direct physiological consequence.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The Naturalness Bias is evident in the reference to 'Ayurvedic researchers', validating a traditional dietary restriction. Illusory Correlation is used to link a specific food combination ('milk immediately after eating fish') to an unrelated skin condition ('vitiligo patches')."
  },
  {
    "id": 9,
    "text": "Smart meters installed in Delhi residential areas record audio snippets of 10 seconds every hour to calibrate ambient noise sensors.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This claim uses precise operational details, such as recording '10 seconds every hour', to sound authentic. The technical justification provided is that the audio is used to 'calibrate ambient noise sensors', making the invasion of privacy seem like a system feature.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims a direct function of the device ('record audio snippets') for a technical reason. It operates as a conspiracy theory about capability rather than a cognitive bias error in judging correlations or naturalness."
  },
  {
    "id": 10,
    "text": "A comparative study of 200 patients shows that generic paracetamol manufactured in India contains 10% less active ingredient than international brands.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites a 'comparative study of 200 patients' to provide an empirical basis for the claim. The specific figure of '10% less active ingredient' presents the misinformation as a measurable fact derived from analysis.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline compares efficacy based on manufacturing origin ('generic... vs international'), which is a quality claim. It does not exploit naturalness preferences or illusory cause-and-effect links."
  },
  {
    "id": 11,
    "text": "AI-driven algorithmic trading bots on Indian stock apps artificially inflate penny stock prices by 0.5% daily to trap retail investors.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains a specific method of market manipulation involving 'algorithmic trading bots' and a precise rate of '0.5% daily'. This detailed economic mechanism appeals to readers looking for a logical explanation of market movements.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This describes a specific market manipulation technique ('artificially inflate penny stock prices'). It relies on economic logic rather than cognitive biases like availability or naturalness."
  },
  {
    "id": 12,
    "text": "Laboratory tests confirm that commercially available sanitizers dissolve the protective lipid layer of the skin, increasing virus absorption by 30%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "By citing 'laboratory tests' and using biological terminology like 'lipid layer', the headline establishes a scientific tone. The statistic 'increasing virus absorption by 30%' offers a quantifiable consequence to the detailed physiological argument.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is triggered by the fear that a modern chemical product ('commercially available sanitizers') destroys the body's natural barrier ('lipid layer'). Illusory Correlation connects this hygiene product to a counter-intuitive increase in 'virus absorption'."
  },
  {
    "id": 13,
    "text": "Software updates for older smartphones include a code segment that purposefully increases battery consumption by 15% to force hardware upgrades.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies a specific cause ('code segment') and a measurable effect ('increases battery consumption by 15%'). This structured argument suggests a deliberate, engineered obsolescence backed by technical modification.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim alleges a deliberate engineering choice ('code segment that purposefully increases battery consumption'). It focuses on corporate malice and planned obsolescence rather than cognitive bias shortcuts."
  },
  {
    "id": 14,
    "text": "Eating soaked almonds without peeling the skin releases measurable amounts of tannin that block iron absorption in the intestine.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on a nutritional mechanism, explaining that 'tannin' from unpeeled skins blocks 'iron absorption'. The use of terms like 'measurable amounts' and 'intestine' frames the misinformation as a biological fact.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The focus on 'soaked almonds' and the specific effect of 'unpeeled skin' reflects a Naturalness Bias regarding traditional food preparation. Illusory Correlation is present in the specific, asserted link between the skin's tannin and 'block iron absorption'."
  },
  {
    "id": 15,
    "text": "Metadata analysis of popular instant messaging apps reveals that end-to-end encryption does not apply to files larger than 5MB.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses technical concepts like 'metadata analysis' and 'end-to-end encryption' to sound authoritative. The specific exemption for 'files larger than 5MB' adds a precise, rule-based detail that mimics a technical limitation report.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This is a technical claim about the limitations of 'end-to-end encryption' based on file size. It relies on technical plausibility rather than cognitive biases."
  },
  {
    "id": 16,
    "text": "Regular consumption of microwaved food alters blood chemistry, leading to a 12% decrease in haemoglobin levels over six months.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This item presents a longitudinal effect ('over six months') and a specific physiological change ('12% decrease in haemoglobin'). The claim is structured as a medical finding connecting a specific habit to blood chemistry.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is shown by framing modern cooking ('microwaved food') as inherently harmful to 'blood chemistry'. Illusory Correlation appears in the specific, unjustified link between microwaves and a 'decrease in haemoglobin'."
  },
  {
    "id": 17,
    "text": "Cybersecurity experts identify a vulnerability in Wi-Fi routers that allows hackers to access smart TV microphones through the HDMI-CEC protocol.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites 'cybersecurity experts' and names a specific technical standard, 'HDMI-CEC protocol', as the attack vector. This provides a mechanistic explanation for how the alleged hacking is technically possible.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a specific cybersecurity vulnerability ('HDMI-CEC protocol') rather than relying on intuitive cognitive biases. It frames the threat as a technical exploit."
  },
  {
    "id": 18,
    "text": "A study of urban Indian populations links the use of non-stick cookware to a 40% rise in thyroid disorders due to PFOA accumulation.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim references a specific chemical ('PFOA') and a statistical correlation ('40% rise') found in a 'study of urban Indian populations'. This approach mimics an epidemiological report.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is present in the fear of synthetic 'non-stick cookware' and its chemical ('PFOA') effects. Illusory Correlation links this cookware to a specific rise in 'thyroid disorders' without established causality."
  },
  {
    "id": 19,
    "text": "Telecom data packets transmit a sub-signal that resets the circadian rhythm in the human brain, causing chronic insomnia in 3G and 4G users.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text proposes a technical mechanism where 'sub-signals' in data packets interact with the 'circadian rhythm'. This pseudo-scientific explanation attempts to provide a biological reason for sleep issues among technology users.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This is an Illusory Correlation, linking digital 'data packets' to a fundamental biological process ('circadian rhythm'). It exploits the tendency to attribute health issues like 'insomnia' to invisible technological signals."
  },
  {
    "id": 20,
    "text": "Combining citrus fruits with yoghurt creates a toxic compound that damages the lining of the stomach and reduces protein digestion efficiency.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a chemical interaction ('creates a toxic compound') and its specific physiological effects on the 'lining of the stomach'. It uses a structured argument about digestion efficiency to persuade the reader.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is invoked through the focus on food compatibility, a common theme in traditional medicine. Illusory Correlation is used to claim that mixing 'citrus fruits with yoghurt' creates a 'toxic compound', a classic false cause narrative."
  },
  {
    "id": 21,
    "text": "An independent audit of EdTech platforms reveals that their AI tutors are programmed to introduce errors in 5% of answers to prolong student engagement.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim cites an 'independent audit' and provides a specific percentage ('5% of answers') to quantify the alleged manipulation. The rationale given—to 'prolong student engagement'—provides a logical motive for the technical design.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline asserts a deliberate programming choice ('programmed to introduce errors') for a business goal. It operates on suspicion of corporate motives rather than cognitive bias shortcuts."
  },
  {
    "id": 22,
    "text": "Medical analysis confirms that wearing Bluetooth headphones for more than three hours daily increases the temperature of the ear canal by 2°C, promoting fungal growth.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses 'medical analysis' and precise measurements ('three hours', '2°C') to sound objective. The causal chain leading to 'fungal growth' is presented as a direct result of thermal changes.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias appears in the fear that modern tech ('Bluetooth headphones') disrupts the body's natural state. Illusory Correlation links the device usage to a specific, grotesque outcome ('fungal growth') via temperature change."
  },
  {
    "id": 23,
    "text": "Source code analysis of the CoWIN portal shows that user data is automatically mirrored to third-party servers hosted in foreign jurisdictions.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion relies on 'source code analysis' to validate the claim of data mirroring. The mention of 'third-party servers' and 'foreign jurisdictions' adds specific technical and legal details to the argument.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This is a claim about data privacy and server locations ('mirrored to third-party servers'). It relies on technical and legal concerns rather than cognitive biases."
  },
  {
    "id": 24,
    "text": "Research indicates that drinking cold water after a meal solidifies oily foods within the oesophagus, leading to arterial blockage over time.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline offers a physical explanation of how cold water 'solidifies oily foods'. It connects this mechanism to a long-term health consequence, 'arterial blockage', framing it as a research finding.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is reflected in the traditional dietary advice regarding 'cold water' and digestion. Illusory Correlation connects this habit to a severe, long-term condition ('arterial blockage') through a simplistic physical mechanism."
  },
  {
    "id": 25,
    "text": "Facial recognition cameras in Indian airports utilise a specific infrared spectrum that can identify an individual’s stress levels by measuring micro-sweat production.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the technology's capability through a specific mechanism: using 'infrared spectrum' to measure 'micro-sweat production'. This detailed technical description makes the surveillance claim appear plausible.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text describes a technological capability ('identify an individual’s stress levels') using specific sensors. It does not rely on naturalness or availability biases, but on surveillance fears."
  },
  {
    "id": 26,
    "text": "A study of 1,000 diabetic patients finds that substituting sugar with jaggery spikes insulin levels exactly as much as refined white sugar.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline references a sample size ('1,000 diabetic patients') to establish statistical validity. The claim counters a common belief with a precise comparative finding about 'insulin levels'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline directly addresses Naturalness Bias by comparing 'jaggery' (natural) to 'refined white sugar' (processed). It uses a study to counter the bias, or perhaps reinforce a nuanced view of natural sweeteners."
  },
  {
    "id": 27,
    "text": "Cloud storage providers compress user photos using a lossy algorithm that permanently alters the pixel data, making facial recognition easier for government databases.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This item describes a technical process ('lossy algorithm') and its specific effect on 'pixel data'. The argument connects file compression to a functional outcome for 'government databases', providing a reasoned explanation for the claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim focuses on a technical process ('lossy algorithm') and its surveillance implication. It does not leverage naturalness or availability biases."
  },
  {
    "id": 28,
    "text": "Ayurvedic practitioners state that sleeping with the head pointing North creates a magnetic repulsion with the Earth’s field, disrupting blood circulation in the brain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a physics-based explanation involving 'magnetic repulsion' and the 'Earth’s field'. It links this mechanism to a physiological impact on 'blood circulation', giving the cultural belief a pseudo-scientific grounding.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is explicitly invoked by citing 'Ayurvedic practitioners' and discussing alignment with the 'Earth’s field'. Illusory Correlation links sleeping direction to 'blood circulation in the brain', a pattern-seeking superstition."
  },
  {
    "id": 29,
    "text": "Digital payment apps use the gyroscope sensor in smartphones to track physical movement and determine if a user is walking or driving during a transaction.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim specifies a hardware component, the 'gyroscope sensor', and explains its function in tracking 'physical movement'. This technical detail makes the surveillance allegation sound like a feasible feature of the app.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This describes a specific use of hardware sensors ('gyroscope') for tracking. It is a technical privacy claim rather than a bias-driven judgment."
  },
  {
    "id": 30,
    "text": "Clinical reports suggest that the chemicals used in non-stick mask coatings release nanoparticles when inhaled, accumulating in lung tissue.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites 'clinical reports' and describes the release of 'nanoparticles' from mask coatings. The mechanism of inhalation and accumulation in 'lung tissue' provides a detailed path for the alleged health risk.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is present in the fear of synthetic materials ('chemicals used in non-stick mask coatings'). Illusory Correlation links these coatings to 'nanoparticles' accumulating in 'lung tissue', creating a specific health scare."
  },
  {
    "id": 31,
    "text": "An analysis of the new e-Rupee code reveals a programmable expiration date feature that allows the central bank to invalidate currency not spent within 90 days.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline refers to an 'analysis of the... code' to uncover a specific 'programmable expiration date feature'. The inclusion of a precise timeframe ('90 days') adds detail to the argument about digital currency control.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline alleges a programmed feature ('expiration date') in a digital currency. It relies on economic control fears rather than cognitive biases."
  },
  {
    "id": 32,
    "text": "Consuming bananas on an empty stomach increases magnesium levels in the blood too rapidly, disrupting the calcium balance and straining the heart.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text provides a biochemical reason for the advice, citing 'magnesium levels' and 'calcium balance'. The explanation of the strain on the heart is presented as a direct physiological consequence of this nutrient imbalance.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is seen in the strict dietary rule about eating 'bananas on an empty stomach'. Illusory Correlation links this common food habit to a severe physiological breakdown ('straining the heart')."
  },
  {
    "id": 33,
    "text": "Network engineers confirm that 5G bandwidth is divided into slices, with a dedicated high-speed lane reserved exclusively for government surveillance traffic.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses technical terminology like 'bandwidth', 'slices', and 'dedicated high-speed lane'. Attributing the information to 'network engineers' and explaining the network architecture gives the conspiracy theory a technical structure.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims a specific network architecture feature ('bandwidth is divided into slices') for surveillance. It is a technical conspiracy theory."
  },
  {
    "id": 34,
    "text": "A 10-year study shows that individuals who skip breakfast have a 25% slower metabolic rate, leading to irreversible weight gain regardless of calorie intake.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a longitudinal '10-year study' and a specific percentage ('25% slower') to validate the claim. The argument asserts that metabolic rate changes override 'calorie intake', using scientific concepts to persuade.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This creates an Illusory Correlation between a specific habit ('skip breakfast') and a permanent physiological change ('irreversible weight gain'). It simplifies complex metabolism into a single cause-and-effect rule."
  },
  {
    "id": 35,
    "text": "Smart home assistants record conversation fragments even after the wake word is deactivated to improve their voice recognition models.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline provides a functional reason for the alleged spying: to 'improve their voice recognition models'. This logic makes the claim about recording without the 'wake word' seem like a plausible engineering decision.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline asserts a functional reason for spying ('improve their voice recognition models'). It operates on privacy concerns rather than cognitive bias shortcuts."
  },
  {
    "id": 36,
    "text": "Drinking water while standing allows the fluid to bypass the kidney filtration process, depositing impurities directly into the bladder.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text offers an anatomical explanation, claiming that posture affects the 'kidney filtration process'. The idea that fluid deposits 'impurities directly into the bladder' frames the myth as a biological mechanism.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias reflects the traditional/Ayurvedic preference for specific postures while eating/drinking. Illusory Correlation links 'drinking water while standing' to a complete bypass of the 'kidney filtration process'."
  },
  {
    "id": 37,
    "text": "Forensic data recovery from discarded SSDs proves that 'deleted' files remain recoverable for up to five years unless the drive is magnetically degaussed.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses technical terms like 'forensic data recovery', 'SSDs', and 'magnetically degaussed'. The specific duration of 'five years' adds a precise constraint to the argument about data permanence.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This is a technical claim about data persistence ('deleted files remain recoverable'). It relies on understanding of digital storage rather than cognitive biases."
  },
  {
    "id": 38,
    "text": "Researchers identify a peptide in genetically modified wheat that binds to gut lining cells, causing chronic inflammation in 80% of consumers.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim identifies a specific agent, a 'peptide', and describes its action of binding to 'gut lining cells'. The statistic '80% of consumers' implies a widespread, measured impact confirmed by researchers.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is evident in the fear of 'genetically modified' food vs. natural wheat. Illusory Correlation links this modification to 'chronic inflammation' in a massive percentage of consumers."
  },
  {
    "id": 39,
    "text": "QR codes generated by untrusted apps contain embedded malware scripts that execute automatically when scanned by a standard camera app.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains the threat through a technical method: 'embedded malware scripts' inside QR codes. The assertion that they 'execute automatically' provides a mechanistic explanation for how the infection occurs.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a specific malware delivery method ('embedded malware scripts'). It is a cybersecurity threat claim."
  },
  {
    "id": 40,
    "text": "Applying mehendi (henna) containing PPD chemicals allows toxins to enter the bloodstream through the nail bed, affecting liver function.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text cites a specific chemical ('PPD') and describes the route of entry ('through the nail bed'). The connection to 'liver function' is presented as a direct physiological consequence of this absorption.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is shown by contrasting traditional 'mehendi' with dangerous 'PPD chemicals'. Illusory Correlation connects the external application to internal 'liver function' failure."
  },
  {
    "id": 41,
    "text": "Algorithm audits show that ride-hailing apps increase prices by 15% if the user’s battery level falls below 20%.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline refers to 'algorithm audits' and provides specific numbers: '15% increase' and '20% battery'. This creates a structured argument that the pricing model is technically linked to device status.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims a specific algorithmic pricing strategy based on battery level. It relies on economic exploitation logic."
  },
  {
    "id": 42,
    "text": "Oncologists warn that using antiperspirants blocks the axillary lymph nodes, preventing the expulsion of toxins and leading to breast cancer.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses medical terminology like 'axillary lymph nodes' and explains the mechanism as 'preventing the expulsion of toxins'. Attributing this to 'oncologists' adds expert weight to the physiological argument.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias appears in the rejection of modern 'antiperspirants' in favor of natural sweating. Illusory Correlation links blocking lymph nodes to 'breast cancer', a common but false causal link."
  },
  {
    "id": 43,
    "text": "A leaked API document reveals that social media platforms downrank posts containing words like 'protest' or 'strike' by 40% in user feeds.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites a 'leaked API document' as evidence. The precise '40%' figure and the algorithmic action of 'downranking' provide a technical explanation for the alleged censorship.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline alleges political censorship via algorithmic 'downranking'. It describes a specific system rule rather than a cognitive bias."
  },
  {
    "id": 44,
    "text": "Consuming tea immediately after meals reduces iron absorption by 60% due to the formation of insoluble iron-tannin complexes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the chemical process of forming 'insoluble iron-tannin complexes'. The statistic '60%' quantifies the impact, making the nutritional advice sound scientifically rigorous.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias reflects traditional dietary rules about food combinations. Illusory Correlation creates a specific chemical cause ('insoluble iron-tannin complexes') for a dramatic nutrient block."
  },
  {
    "id": 45,
    "text": "Virtual Reality headsets emit a specific flicker rate that desynchronises the optic nerve from the brain's processing centre, causing long-term vertigo.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline attributes the health issue to a technical specification, the 'flicker rate'. The explanation involves the 'optic nerve' and 'brain's processing centre', framing the vertigo as a neurological disconnect.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This presents an Illusory Correlation by linking a tech spec ('flicker rate') to a neurological disconnect ('desynchronises the optic nerve'). It simplifies the relationship between VR and health into a direct damage mechanism."
  },
  {
    "id": 46,
    "text": "A controlled study reveals that boiling tulsi leaves for more than 5 minutes destroys their medicinal compounds and releases a mild neurotoxin.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on a 'controlled study' and specific cooking parameters ('more than 5 minutes'). It argues that this process changes the chemical nature of the leaves, releasing a 'neurotoxin'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is present in the focus on 'tulsi leaves' (herbal) and the idea that over-processing (boiling) ruins them. Illusory Correlation claims this process releases a 'mild neurotoxin', connecting cooking to toxicity."
  },
  {
    "id": 47,
    "text": "Tech analysts find that 'Delete for Everyone' features in chat apps only hide the message on the UI layer while retaining the data on the server logs indefinitely.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline distinguishes between the 'UI layer' and 'server logs', using technical architecture to explain the claim. This detailed distinction persuades readers that the feature is merely cosmetic.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline makes a technical distinction between the 'UI layer' and 'server logs'. It is a claim about software architecture and privacy."
  },
  {
    "id": 48,
    "text": "Mixing honey with hot water produces a chemical structure similar to glue, which adheres to the intestinal walls and blocks nutrient absorption.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a physical change in 'chemical structure' caused by heat. The mechanical explanation of the substance adhering to 'intestinal walls' attempts to validate the Ayurvedic myth with pseudo-science.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is invoked through the Ayurvedic prohibition of heating 'honey'. Illusory Correlation asserts that this creates a 'glue' structure that blocks absorption, a physical impossibility but intuitive metaphor."
  },
  {
    "id": 49,
    "text": "An internal report from a major telecom provider states that 5G frequencies were selected specifically to induce docility by interacting with the human nervous system.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites an 'internal report' and claims a specific selection criterion for frequencies. It argues for a biological interaction with the 'nervous system' to explain the alleged psychological effect.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This uses Illusory Correlation to link '5G frequencies' to a complex psychological state ('induce docility'). It attributes a behavioral control capability to a radio wave."
  },
  {
    "id": 50,
    "text": "Dental researchers find that fluoride in toothpaste calcifies the pineal gland over time, reducing the production of melatonin by 18%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses a specific biological target, the 'pineal gland', and a mechanism, 'calcification'. The statistic '18%' and the mention of 'melatonin' frame the conspiracy as a medical research finding.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias appears in the fear of 'fluoride' (chemical) in toothpaste. Illusory Correlation links this chemical to the calcification of the 'pineal gland', a common trope in spiritual/health conspiracies."
  },
  {
    "id": 51,
    "text": "Biometric attendance systems store fingerprint hashes in a reversible format, allowing hackers to reconstruct the original fingerprint image.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses technical terms like 'fingerprint hashes' and 'reversible format'. The argument that this allows reconstruction of the 'original fingerprint image' appeals to those who understand basic cryptography concepts.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims a specific cryptographic flaw ('reversible format'). It relies on technical understanding of data security."
  },
  {
    "id": 52,
    "text": "Eating chicken injected with growth hormones causes early puberty in children by disrupting the endocrine system, according to a paediatric study.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text references a 'paediatric study' and explains the mechanism as 'disrupting the endocrine system'. This scientific framing supports the claim about 'early puberty'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is evident in the fear of artificial 'growth hormones' in food. Illusory Correlation links this directly to 'early puberty', implying a direct transfer of hormones from food to human biology."
  },
  {
    "id": 53,
    "text": "Operating system updates silently activate the microphone for 5 seconds after every phone unlock to collect keyword data for targeted advertising.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline specifies a trigger condition ('after every phone unlock') and a duration ('5 seconds'). This operational detail provides a plausible technical explanation for how data is allegedly collected.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This describes a specific spyware trigger ('after every phone unlock'). It is a surveillance claim based on device functionality."
  },
  {
    "id": 54,
    "text": "A comparative analysis of salt brands shows that free-flowing salt contains aluminium silicate, which accumulates in the brain and accelerates Alzheimer's.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim identifies a specific additive, 'aluminium silicate', found via 'comparative analysis'. The connection to 'Alzheimer's' is explained through the accumulation of this chemical in the brain.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is shown in the fear of additives ('aluminium silicate') in 'free-flowing salt' compared to natural salt. Illusory Correlation connects this additive to 'accelerates Alzheimer's'."
  },
  {
    "id": 55,
    "text": "Cryptocurrency mining malware is pre-installed on 15% of budget smartphones imported into India, utilizing background processing power.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline provides a specific statistic ('15%') and a technical method ('background processing power'). This structures the claim as a supply chain security issue.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims a supply chain attack ('pre-installed... malware'). It is a cybersecurity issue rather than a bias-driven one."
  },
  {
    "id": 56,
    "text": "Drinking water directly from plastic bottles releases microplastics that mimic oestrogen, causing hormonal imbalances in 60% of regular users.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the biological mechanism: microplastics 'mimic oestrogen'. The statistic '60% of regular users' attempts to quantify the scope of the alleged hormonal damage.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is present in the fear of 'plastic bottles' releasing 'microplastics' (unnatural). Illusory Correlation connects this to 'hormonal imbalances', asserting a direct mimicry of oestrogen."
  },
  {
    "id": 57,
    "text": "Browser cookies from major e-commerce sites can access the browser history of other open tabs to build a comprehensive user psychological profile.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims a specific technical capability: accessing 'browser history of other open tabs'. This explanation of cross-site tracking aims to persuade readers of the depth of digital surveillance.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This describes a specific tracking capability ('access browser history of other open tabs'). It relies on privacy fears regarding cookies."
  },
  {
    "id": 58,
    "text": "Root canal treatments leave dead bacteria trapped inside the tooth, which leak into the bloodstream and cause chronic autoimmune diseases.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim offers a pathological mechanism: 'dead bacteria' leaking into the 'bloodstream'. It connects a common dental procedure to 'autoimmune diseases' using a cause-and-effect medical argument.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias appears in the distrust of a modern dental procedure ('Root canal treatments'). Illusory Correlation links the procedure to unrelated 'autoimmune diseases' via a theory of leaking bacteria."
  },
  {
    "id": 59,
    "text": "GPS satellites are recalibrated weekly to introduce a slight location error that ensures ride-sharing apps can overcharge for distance traveled.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline alleges a systematic manipulation ('recalibrated weekly') of 'GPS satellites'. It provides a specific economic motive ('overcharge for distance') supported by this technical assertion.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline alleges systematic fraud via 'GPS satellites'. It is a conspiracy about corporate theft rather than a cognitive bias error."
  },
  {
    "id": 60,
    "text": "Eating papaya seeds destroys parasitic worms but also thins the intestinal lining, leading to nutrient malabsorption if consumed for more than three days.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text presents a trade-off: killing worms versus 'thins the intestinal lining'. The specific time limit ('more than three days') adds a prescriptive, medical tone to the advice.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is seen in the use of 'papaya seeds' as a natural remedy. Illusory Correlation asserts a specific side effect ('thins the intestinal lining') if used for a precise duration."
  },
  {
    "id": 61,
    "text": "The latest Wi-Fi 6 routers emit radiation at a frequency that resonates with water molecules in the eyes, causing early-onset cataracts.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses physics concepts, claiming the frequency 'resonates with water molecules'. This mechanistic explanation connects a specific technology ('Wi-Fi 6') to a specific health outcome ('cataracts').",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This uses Illusory Correlation to link 'Wi-Fi 6' frequencies to a physical ailment ('cataracts') through a pseudo-scientific resonance mechanism. It exploits the fear of invisible waves causing damage."
  },
  {
    "id": 62,
    "text": "A biochemical study shows that combining milk and banana produces a heavy toxin that blocks body channels and induces lethargy.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim references a 'biochemical study' and uses Ayurveda-inspired concepts like 'blocks body channels'. It presents the combination as chemically generating a 'heavy toxin'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is invoked through Ayurvedic concepts like 'blocks body channels'. Illusory Correlation links the 'milk and banana' combination to the production of a 'heavy toxin'."
  },
  {
    "id": 63,
    "text": "Charging a smartphone overnight overloads the lithium-ion lattice, reducing the battery's total charge cycles by 40% within the first year.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses technical jargon like 'lithium-ion lattice' and 'charge cycles'. The statistic '40%' quantifies the alleged damage, making the advice against overnight charging sound technically sound.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline creates a specific technical reason ('overloads the lithium-ion lattice') for battery degradation. It is a technical myth."
  },
  {
    "id": 64,
    "text": "Research indicates that wearing black clothes in the sun absorbs UV radiation that converts into heat energy, damaging skin cells at a deeper level than direct exposure.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a physics-based argument about 'UV radiation' converting to 'heat energy'. It claims this causes damage 'at a deeper level', validating the warning with scientific reasoning.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This presents an Illusory Correlation by linking the color of clothes ('black clothes') to 'damaging skin cells at a deeper level'. It creates a false causal chain between fabric color and internal radiation damage."
  },
  {
    "id": 65,
    "text": "Online gaming platforms use binaural beats in their background music to induce a trance state that suppresses the brain's decision-making prefrontal cortex.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim identifies a specific audio technique, 'binaural beats', and its neurological target, the 'prefrontal cortex'. This detailed explanation frames the addictive nature of games as a neurological hack.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Illusory Correlation is used to link 'binaural beats' to the suppression of a specific brain region ('prefrontal cortex'). It attributes mind-control power to background audio."
  },
  {
    "id": 66,
    "text": "Holding a sneeze creates a pressure spike of 150 mmHg in the cranial cavity, which can rupture delicate capillaries in the brain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline provides a specific pressure measurement ('150 mmHg') and an anatomical location ('cranial cavity'). This precise medical description makes the danger of holding a sneeze seem scientifically verified.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation to connect a common action ('holding a sneeze') to a catastrophic internal event ('rupture delicate capillaries in the brain'). It exploits fear of the body's fragility."
  },
  {
    "id": 67,
    "text": "Search engines use a 'shadow profile' algorithm that correlates incognito mode searches with the user's main account based on typing cadence.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the tracking mechanism: analyzing 'typing cadence' to link accounts. The term 'shadow profile' and the algorithmic explanation provide a sophisticated reason for the loss of privacy.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This describes a sophisticated tracking algorithm ('typing cadence'). It is a privacy claim based on behavioral biometrics."
  },
  {
    "id": 68,
    "text": "A clinical trial finds that the aluminium in vaccines crosses the blood-brain barrier, accumulating in the frontal lobe and reducing cognitive function.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites a 'clinical trial' and describes the biological path: crossing the 'blood-brain barrier'. The specific location ('frontal lobe') and effect ('reducing cognitive function') create a detailed medical argument.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is evident in the fear of 'aluminium' (chemical/metal) in vaccines. Illusory Correlation links this ingredient to 'reducing cognitive function', a staple of anti-vaccine narratives."
  },
  {
    "id": 69,
    "text": "Smart refrigerators with cameras analyse food packaging labels to send dietary data to health insurance companies for premium adjustments.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim outlines a data flow: cameras 'analyse food packaging' and send data to 'insurance companies'. This systemic explanation provides a logical, economic motive for the technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim outlines a data sharing conspiracy between appliances ('Smart refrigerators') and 'insurance companies'. It relies on economic surveillance fears."
  },
  {
    "id": 70,
    "text": "Applying onion juice to the scalp increases sulphur levels in hair follicles, which can cause permanent greying if used more than twice a week.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text identifies a chemical cause ('sulphur levels') and a specific usage limit ('twice a week'). It frames the cosmetic side effect as a direct chemical consequence on the 'hair follicles'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias involves the use of a natural remedy ('onion juice'). Illusory Correlation asserts a specific, ironic side effect ('permanent greying') caused by its chemical components."
  },
  {
    "id": 71,
    "text": "Code analysis of popular keyboard apps shows they log every keystroke locally and transmit the data in compressed batches during night-time updates.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline details the method of data exfiltration: 'compressed batches' sent during 'night-time updates'. This technical specificity makes the allegation of keylogging appear credible.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This details a specific data exfiltration method ('log every keystroke'). It is a technical privacy allegation."
  },
  {
    "id": 72,
    "text": "Drinking water while eating dilutes gastric juices, raising the stomach pH and preventing the proper breakdown of proteins.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses physiological concepts like 'gastric juices' and 'stomach pH'. The argument that this prevents 'proper breakdown of proteins' appeals to a scientific understanding of digestion.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias reflects traditional dietary rules about drinking water with meals. Illusory Correlation links this to 'preventing the proper breakdown of proteins' via pH changes."
  },
  {
    "id": 73,
    "text": "Digital Identity Wallets contain a 'kill switch' code that allows authorities to remotely disable a citizen's access to public services without a court order.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline alleges a specific feature, a 'kill switch', within the software architecture. It explains the functional capability ('remotely disable access') to construct a structured argument about government control.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline alleges a 'kill switch' for government control. It operates on political and technological oppression fears."
  },
  {
    "id": 74,
    "text": "A study of 500 patients confirms that wearing synthetic fabrics disrupts the body's bio-electric field, causing chronic fatigue and lethargy.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text references a 'study of 500 patients' and uses the concept of a 'bio-electric field'. It connects material science to health outcomes, providing a pseudo-scientific reason for the symptoms.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is clearly shown in the demonization of 'synthetic fabrics' in favor of the natural. Illusory Correlation connects these fabrics to 'chronic fatigue' via a pseudo-scientific 'bio-electric field'."
  },
  {
    "id": 75,
    "text": "Internet Service Providers use Deep Packet Inspection to throttle connection speeds by 30% for encrypted VPN traffic specifically.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the technical term 'Deep Packet Inspection' to explain how the throttling occurs. The statistic '30%' and the targeting of 'VPN traffic' creates a detailed technical accusation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims specific network management practices ('Deep Packet Inspection to throttle'). It is a technical net neutrality violation claim."
  },
  {
    "id": 76,
    "text": "Using anti-dandruff shampoo more than once a week strips the scalp of natural oils, prompting sebaceous glands to overproduce sebum by 50%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim describes a biological feedback loop involving 'sebaceous glands' and 'sebum'. The quantified increase ('50%') gives the advice a precise, dermatological basis.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias appears in the warning against chemical 'anti-dandruff shampoo' stripping natural oils. Illusory Correlation links usage frequency to a precise '50%' increase in sebum production."
  },
  {
    "id": 77,
    "text": "Electric Vehicles generate a low-frequency electromagnetic field that interferes with cardiac pacemakers within a 2-meter radius.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline specifies a 'low-frequency electromagnetic field' and a danger zone of '2-meter radius'. This technical constraint makes the health risk to pacemaker users sound like a verified safety issue.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This uses Illusory Correlation to link 'Electric Vehicles' to medical device failure ('interferes with cardiac pacemakers'). It creates a safety fear around new technology."
  },
  {
    "id": 78,
    "text": "Consuming ice cream causes a rapid drop in stomach temperature, which shocks the vagus nerve and slows down the heart rate.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the physiological reaction: shocking the 'vagus nerve' due to temperature change. It connects this mechanism to a specific cardiac effect, 'slows down the heart rate'.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Illusory Correlation is used to connect eating 'ice cream' to 'slows down the heart rate' via the vagus nerve. It turns a temporary sensation into a dangerous physiological event."
  },
  {
    "id": 79,
    "text": "Hidden metadata in digital photos taken on smartphones includes the precise angle and elevation of the camera, used to build 3D maps of private homes.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline details the data points collected: 'angle and elevation'. It explains the purpose—building '3D maps'—providing a technological logic for the privacy invasion claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes the use of metadata ('angle and elevation') for surveillance mapping. It is a technical privacy claim."
  },
  {
    "id": 80,
    "text": "A nutritional analysis finds that modern wheat contains a modified gluten protein that the human enzyme pepsin cannot break down completely.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim cites 'nutritional analysis' and names a specific enzyme, 'pepsin'. The argument about the inability to 'break down' the protein provides a biochemical reason for gluten sensitivity myths.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is evident in the distinction between 'modern wheat' (bad/modified) and implying traditional wheat is safe. Illusory Correlation explains gluten sensitivity as an inability of 'pepsin' to break down this specific protein."
  },
  {
    "id": 81,
    "text": "Smart TVs use ultrasonic cross-device tracking to communicate with nearby smartphones and identify user viewing habits even when offline.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a sophisticated method: 'ultrasonic cross-device tracking'. This technical explanation of how devices communicate 'even when offline' adds credibility to the surveillance claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This describes a specific tracking technology ('ultrasonic cross-device tracking'). It is a surveillance capability claim."
  },
  {
    "id": 82,
    "text": "Sleeping on the right side compresses the vena cava, reducing blood return to the heart and causing nightly spikes in blood pressure.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses anatomical references like 'vena cava' and 'blood return'. It presents a mechanical cause for 'spikes in blood pressure', making the sleep position advice sound medically sound.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is reflected in the focus on natural sleeping positions. Illusory Correlation links 'sleeping on the right side' to 'nightly spikes in blood pressure' via vein compression."
  },
  {
    "id": 83,
    "text": "Banking apps use facial micro-expression analysis during login to detect hesitation, flagging accounts for potential fraud investigation.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim involves 'facial micro-expression analysis' as a security feature. It explains that detecting 'hesitation' triggers a fraud flag, providing a logical operational procedure for the app.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes 'facial micro-expression analysis' as a security feature. It relies on advanced technology claims."
  },
  {
    "id": 84,
    "text": "Research shows that eating garlic on an empty stomach activates its sulphur compounds, which then act as a natural antibiotic stronger than penicillin.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites 'research' and explains the chemical activation of 'sulphur compounds'. Comparing it to 'penicillin' provides a potent benchmark for the alleged medicinal property.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is strong here, claiming a natural food ('garlic') is 'stronger than penicillin'. Illusory Correlation equates a vegetable directly to a potent antibiotic drug."
  },
  {
    "id": 85,
    "text": "The 5G network infrastructure requires the installation of small-cell antennas every 100 meters, creating a continuous blanket of high-density radiation.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text details the infrastructure requirements: 'small-cell antennas every 100 meters'. This specific density is used to argue for the existence of a 'continuous blanket' of radiation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This uses Illusory Correlation to link '5G' infrastructure to a 'continuous blanket of high-density radiation'. It exploits the fear of pervasive invisible harm from technology."
  },
  {
    "id": 86,
    "text": "A study of liver function tests reveals that taking paracetamol with soda creates a toxic byproduct that damages hepatocytes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim references 'liver function tests' and specific cells, 'hepatocytes'. It describes the creation of a 'toxic byproduct' to explain why the combination is dangerous.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias appears in the fear of mixing substances (medicine + soda). Illusory Correlation claims this specific mix creates a 'toxic byproduct' damaging the liver."
  },
  {
    "id": 87,
    "text": "Wearable fitness trackers sell real-time heart rate variability data to credit agencies to assess a user's financial stress levels.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies a specific metric, 'heart rate variability'. It connects this health data to 'credit agencies' for financial assessment, constructing a complex data-privacy conspiracy.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Illusory Correlation connects 'heart rate variability' data to 'financial stress levels'. It implies a direct, intrusive link between health metrics and credit worthiness."
  },
  {
    "id": 88,
    "text": "Applying lemon juice to the face before going out in the sun causes a phototoxic reaction that permanently bleaches melanin in the skin.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the term 'phototoxic reaction' to describe the mechanism. The consequence, 'permanently bleaches melanin', is presented as a direct chemical result of the interaction.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias involves the use of 'lemon juice' as a cosmetic application. Illusory Correlation warns of 'permanently bleaches melanin', exaggerating a chemical reaction to a permanent disfigurement."
  },
  {
    "id": 89,
    "text": "Video conferencing platforms utilise background processes to scan user hard drives for keywords related to competitor products.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline alleges corporate espionage via 'background processes'. It explains the method—scanning for 'keywords related to competitor products'—to make the claim sound like a strategic software feature.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline alleges corporate espionage via software scanning. It is a business ethics and privacy claim."
  },
  {
    "id": 90,
    "text": "Cracking knuckles releases nitrogen gas bubbles that damage the synovial fluid, leading to arthritis in 70% of habitual cases.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains the sound as 'nitrogen gas bubbles' and alleges damage to 'synovial fluid'. The statistic '70% of habitual cases' gives the arthritis myth a statistical backing.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This uses Illusory Correlation to link the habit of 'cracking knuckles' to 'arthritis'. It validates a common myth with pseudo-scientific details about 'nitrogen gas bubbles'."
  },
  {
    "id": 91,
    "text": "Mobile network towers are programmed to increase signal gain by 20% at night, resulting in higher radiation exposure for sleeping residents.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline specifies an operational change: 'increase signal gain by 20%'. This technical detail is used to justify the claim of higher 'radiation exposure' during specific hours.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims a specific operational change ('increase signal gain... at night'). It relies on technical plausibility rather than cognitive bias shortcuts."
  },
  {
    "id": 92,
    "text": "Consuming milk with salt triggers a chemical incompatibility that disrupts the sodium-potassium pump in cells, causing skin diseases.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text cites a cellular mechanism, the 'sodium-potassium pump'. It argues that 'chemical incompatibility' leads to 'skin diseases', using biological terms to validate a dietary restriction.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is invoked through Ayurvedic rules about food incompatibility ('milk with salt'). Illusory Correlation links this mix to 'skin diseases' via the 'sodium-potassium pump'."
  },
  {
    "id": 93,
    "text": "Digital watermarks in online images contain invisible tracking pixels that log the IP address of anyone who saves the image to their device.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains the tracking method using 'invisible tracking pixels' and 'digital watermarks'. The logging of 'IP address' upon saving provides a technical description of the alleged surveillance.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This describes a tracking method ('invisible tracking pixels'). It is a technical privacy claim."
  },
  {
    "id": 94,
    "text": "A longitudinal study concludes that using non-stick pans releases perfluorocarbons that accumulate in the thyroid, causing hormonal suppression.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline references a 'longitudinal study' and specific chemicals, 'perfluorocarbons'. It connects the accumulation in the 'thyroid' to 'hormonal suppression', presenting a detailed medical pathway.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is present in the fear of synthetic 'non-stick pans'. Illusory Correlation connects the chemicals released to 'hormonal suppression' via thyroid accumulation."
  },
  {
    "id": 95,
    "text": "Cloud-based voice assistants retain a 30-day buffer of all ambient audio to train their wake-word detection algorithms.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text specifies a data retention policy: '30-day buffer'. It provides a technical justification for this storage—to 'train their wake-word detection algorithms'—making the privacy breach sound plausible.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline asserts a data retention policy ('30-day buffer') for AI training. It is a specific technical claim."
  },
  {
    "id": 96,
    "text": "Swallowing chewing gum blocks the digestive tract for seven years because the synthetic rubber base is resistant to hydrochloric acid.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses a chemical reason: the base is 'resistant to hydrochloric acid'. This explains why the gum allegedly remains, validating the 'seven years' myth with pseudo-science.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias appears in the fear of 'synthetic rubber' in gum. Illusory Correlation validates the myth that gum 'blocks the digestive tract for seven years' using a chemical resistance argument."
  },
  {
    "id": 97,
    "text": "5G-enabled street lights contain facial recognition sensors that cross-reference passersby with a police database in real-time.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline integrates two technologies: '5G' and 'facial recognition'. The description of 'cross-referencing... in real-time' offers a systemic explanation for the surveillance infrastructure.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This combines '5G' and 'facial recognition' into a surveillance infrastructure claim. It relies on the fear of state monitoring rather than cognitive bias errors."
  },
  {
    "id": 98,
    "text": "Drinking water immediately after tea causes the tannins to crystallise in the stomach, leading to the formation of kidney stones.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a chemical process: tannins 'crystallise'. It links this event to a specific medical condition, 'kidney stones', providing a cause-and-effect rationale.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias reflects traditional dietary rules about liquid consumption. Illusory Correlation links 'drinking water immediately after tea' to 'kidney stones' via tannin crystallization."
  },
  {
    "id": 99,
    "text": "AI text generators insert unique, invisible Unicode characters into their output to permanently tag and track where the content is published.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses technical terms like 'invisible Unicode characters'. It explains the purpose—to 'permanently tag and track'—giving the AI conspiracy a specific technical implementation method.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline describes a specific watermarking technique ('invisible Unicode characters'). It is a technical tracking claim."
  },
  {
    "id": 100,
    "text": "A clinical analysis of 2,000 patients shows that using hand sanitiser before eating kills beneficial gut bacteria, reducing immunity by 15%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites a 'clinical analysis' and a sample size of 2,000. It quantifies the health impact ('reducing immunity by 15%'), creating a data-driven argument against sanitiser use.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is strong, framing 'hand sanitiser' as destructive to natural 'beneficial gut bacteria'. Illusory Correlation links external hand hygiene to internal gut immunity reduction."
  },
  {
    "id": 101,
    "text": "Top doctors in Delhi reveal that a secret 'immune-boosting' soup is the only way to survive the next viral wave.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This headline uses authority cues ('Top doctors') and fear framing ('only way to survive') to persuade the reader. It creates urgency around a 'next viral wave' without providing any scientific evidence.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is shown in the promotion of a 'secret immune-boosting soup'. Illusory Correlation links this simple food item to the massive outcome of 'survive the next viral wave'."
  },
  {
    "id": 102,
    "text": "Whistleblowers warn that your smartphone camera is secretly recording you right now—cover it before it's too late!",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion relies on immediate fear and urgency ('right now', 'before it's too late'). The term 'Whistleblowers' adds a vague sense of insider authority to the alarmist message.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is triggered by the urgent, present-tense warning ('recording you right now', 'before it's too late'), making the threat feel immediate and pervasive."
  },
  {
    "id": 103,
    "text": "Famous yoga guru claims that standing on one leg for 10 minutes daily cures diabetes permanently.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline leverages the celebrity status of a 'Famous yoga guru' to validate the claim. It promises a miraculous result ('cures diabetes permanently') with a simple action, appealing to wishful thinking.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is evident in the reliance on 'yoga' (natural practice). Illusory Correlation links a simple action ('standing on one leg') to a permanent cure for a complex disease like diabetes."
  },
  {
    "id": 104,
    "text": "Warning: A new deadly virus is spreading through 5G networks—turn off your data immediately to stay safe.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses a high-threat warning ('deadly virus', 'stay safe') to induce panic. It demands immediate action ('turn off your data') based on a frightening, albeit impossible, association.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias is used to create panic ('immediately to stay safe'). Illusory Correlation connects '5G networks' directly to the spread of a 'deadly virus'."
  },
  {
    "id": 105,
    "text": "Mothers across Mumbai are shocked: This popular baby food brand is actually made of plastic.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline targets a specific emotional demographic ('Mothers') and uses shock value ('shocked', 'made of plastic'). It relies on disgust and fear rather than facts to drive the misinformation.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Naturalness Bias appears in the disgust at baby food being 'made of plastic' (unnatural). Availability Bias is invoked by claiming 'Mothers across Mumbai are shocked', implying a widespread, visible scandal."
  },
  {
    "id": 106,
    "text": "Leaked photos show government officials using a secret device that gives them free electricity for life.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the intrigue of 'Leaked photos' and 'secret device'. It triggers feelings of unfairness and curiosity ('free electricity for life') to engage the reader emotionally.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is leveraged through the phrase 'Leaked photos', suggesting a vivid, secretive revelation that is now accessible."
  },
  {
    "id": 107,
    "text": "Leading actor reveals he eats this one jungle fruit to stay young forever—doctors are furious!",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion is based on celebrity emulation ('Leading actor') and conflict ('doctors are furious'). The promise of 'staying young forever' appeals to vanity and the desire for simple solutions.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias favors the 'jungle fruit'. Availability Bias relies on celebrity gossip ('Leading actor reveals'). Illusory Correlation links the fruit to the impossible outcome of 'stay young forever'."
  },
  {
    "id": 108,
    "text": "Panic in Bengaluru as AI robots reportedly start speaking their own secret language to plot against humans.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses emotive words like 'Panic' and 'plot against humans'. It taps into the sci-fi fear of AI taking over, creating a sensationalist narrative without evidence.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is created by the word 'Panic' and the localized report ('Panic in Bengaluru'), making the robot threat seem like a breaking news event."
  },
  {
    "id": 109,
    "text": "Grandmother's secret: Rubbing garlic on your feet draws out all body toxins in just one night.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text appeals to traditional wisdom ('Grandmother's secret') and promises a quick fix ('just one night'). It uses the vague, emotionally satisfying concept of 'drawing out toxins'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is shown in 'Grandmother's secret' and the use of 'garlic'. Illusory Correlation links applying garlic to feet to drawing out 'all body toxins'."
  },
  {
    "id": 110,
    "text": "Alert: Using UPI payment apps after 10 PM will wipe your bank account clean.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses a strong 'Alert' and a catastrophic threat ('wipe your bank account clean'). It creates a specific, arbitrary rule ('after 10 PM') to generate behavioral compliance through fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses the 'Alert' tag to create immediate urgency. Illusory Correlation creates a magical link between a specific time ('after 10 PM') and a catastrophic financial loss."
  },
  {
    "id": 111,
    "text": "Shocking truth: Drinking cold water is the main cause of heart attacks in young people.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'Shocking truth' primes the reader for a revelation. It links a common habit ('cold water') to a terrifying outcome ('heart attacks'), relying on fear rather than medical logic.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias involves the fear of 'cold water' (vs natural body temp). Availability Bias uses 'Shocking truth' to frame it as a revelation. Illusory Correlation links the drink to 'heart attacks'."
  },
  {
    "id": 112,
    "text": "Don't update your phone! The new software is designed to delete all your family photos.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline is a direct command ('Don't update') driven by the threat of emotional loss ('delete all your family photos'). It uses urgency to bypass critical thinking about the software.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is driven by the urgent imperative 'Don't update!' and the threat of immediate loss ('delete all your family photos'), bypassing logical evaluation."
  },
  {
    "id": 113,
    "text": "Ayurveda experts say this common kitchen spice instantly dissolves blood clots.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the authority of 'Ayurveda experts' and promises an instantaneous miracle cure ('instantly dissolves'). It simplifies complex medical issues into a kitchen remedy.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is explicit with 'Ayurveda experts' and a 'common kitchen spice'. Illusory Correlation asserts that this simple spice 'instantly dissolves blood clots'."
  },
  {
    "id": 114,
    "text": "Senior engineers at major telecom firms admit they don't keep 5G phones in their own homes.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the 'hypocritical insider' trope ('Senior engineers... don't keep'). It implies a hidden danger that experts are privately avoiding, fostering distrust and fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline uses a 'hypocritical insider' argument. While persuasive, it relies on social proof/authority fallacy rather than the specific definitions of Naturalness, Availability, or Illusory Correlation."
  },
  {
    "id": 115,
    "text": "Stop eating bread! A hidden ingredient in all Indian bread is making everyone obese.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline starts with an imperative command ('Stop eating bread!'). It blames a 'hidden ingredient' for a widespread problem, offering a simple scapegoat for complex health issues.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias attacks the processed nature of 'bread'. Availability Bias is seen in the sweeping claim 'everyone'. Illusory Correlation blames a single 'hidden ingredient' for the complex issue of obesity."
  },
  {
    "id": 116,
    "text": "Viral video confirms: Smart speakers are laughing at us when we leave the room.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim references a 'Viral video' as proof, appealing to social validation. The personification of speakers 'laughing at us' creates an eerie, emotional response.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is triggered by citing a 'Viral video', which suggests the evidence is widespread and visually accessible to the public."
  },
  {
    "id": 117,
    "text": "This ancient herbal tea recipe cures cancer in 30 days—pharmaceutical companies want it banned!",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion relies on the 'forbidden cure' narrative ('companies want it banned'). It combines the appeal of 'ancient' wisdom with a miraculous promise ('cures cancer').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias promotes an 'ancient herbal tea'. Illusory Correlation claims this tea 'cures cancer in 30 days', linking a simple drink to a major medical miracle."
  },
  {
    "id": 118,
    "text": "Emergency warning: A solar flare will destroy all internet servers in India tomorrow.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses 'Emergency warning' and sets a specific, imminent deadline ('tomorrow'). The catastrophic prediction ('destroy all internet servers') is designed to cause panic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is used to create panic via 'Emergency warning' and a specific, imminent deadline ('tomorrow'), making the threat feel immediate."
  },
  {
    "id": 119,
    "text": "Celebrity dietician leaks the secret: Eat 5 almonds daily to never get sick again.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the allure of a 'Celebrity dietician' and a 'leak'. The absolute promise ('never get sick again') is a classic peripheral cue appealing to the desire for perfect health.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias relies on the health halo of 'almonds'. Availability Bias uses 'leaks the secret'. Illusory Correlation links eating 5 almonds to the absolute state of 'never get sick again'."
  },
  {
    "id": 120,
    "text": "Your Smart TV is watching you sleep! Insider reveals the terrifying truth.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline personalizes the threat ('Your Smart TV') and uses emotional language ('terrifying truth'). The 'Insider' mention adds a layer of supposed authenticity to the fear-mongering.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is present in the personalized, immediate fear ('watching you sleep!', 'terrifying truth') and the 'Insider reveals' trope."
  },
  {
    "id": 121,
    "text": "Doctors are shocked: A simple mix of honey and cinnamon cures heart disease completely.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'Doctors are shocked' frames the remedy as a breakthrough that defies medical establishment. The claim of a 'complete cure' with simple ingredients appeals to the desire for easy solutions.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias champions 'honey and cinnamon'. Availability Bias uses 'Doctors are shocked' to frame it as a breaking discovery. Illusory Correlation claims this mix 'cures heart disease completely'."
  },
  {
    "id": 122,
    "text": "Forward this to 10 people or your WhatsApp will be deleted by midnight!",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This is a classic chain-message threat. It creates artificial urgency ('by midnight') and a threat of loss ('WhatsApp will be deleted') to force distribution.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias creates artificial urgency ('by midnight'). Illusory Correlation connects the act of forwarding a message to the technical status of a 'WhatsApp' account."
  },
  {
    "id": 123,
    "text": "Warning for parents: Maggi noodles contain lead that destroys your child's memory instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline targets 'parents' with a 'Warning'. It makes an extreme, terrifying claim ('destroys... memory instantly') to trigger a protective emotional response.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is triggered by the fear of 'lead' in processed 'Maggi noodles'. Availability Bias uses 'Warning' and 'instantly'. Illusory Correlation links the food to immediate memory destruction."
  },
  {
    "id": 124,
    "text": "Government insider warns: Aadhaar cards will be used to track your every purchase starting next week.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The source is a vague 'Government insider', creating an 'us vs them' narrative. The threat of total surveillance ('track your every purchase') starting soon creates anxiety.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is leveraged by the 'Government insider warns' and the imminent timeline ('starting next week'), creating a sense of immediate danger."
  },
  {
    "id": 125,
    "text": "Simply pressing this point on your hand stops a heart attack in 30 seconds.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline offers a miraculous, life-saving solution ('stops a heart attack'). The speed ('30 seconds') and simplicity appeal to the peripheral route's preference for quick fixes.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is seen in the alternative medicine technique (acupressure). Illusory Correlation claims pressing a point 'stops a heart attack', linking a minor action to a life-saving physiological event."
  },
  {
    "id": 126,
    "text": "Delete this app now! It was created by hackers to steal your identity.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses a direct imperative ('Delete this app now!') and a high-stakes threat ('steal your identity'). It relies on immediate action rather than evidence of the app's nature.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is driven by the urgent command 'Delete this app now!', forcing a quick decision based on fear rather than analysis."
  },
  {
    "id": 127,
    "text": "Famous cricketer claims he never drinks milk because it is actually 'white poison'.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses a 'Famous cricketer' as an authority figure. The slogan 'white poison' is a strong, emotional label that demonizes a common food item without explanation.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is complex here; it attacks 'milk', often seen as natural, but frames it as 'white poison', likely implying modern adulteration. Availability Bias uses a 'Famous cricketer'. Illusory Correlation equates milk directly to poison."
  },
  {
    "id": 128,
    "text": "Attention: 5G waves are killing birds instantly—humans are next!",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses 'Attention' to grab focus. The dramatic imagery of birds dying 'instantly' and the threat 'humans are next' relies on fear and slippery-slope logic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Attention' and 'killing birds instantly' to create a vivid, scary image. Illusory Correlation connects '5G waves' to immediate death in animals and humans."
  },
  {
    "id": 129,
    "text": "A secret ancient book reveals that eating okra cures diabetes in 7 days.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The source is a mysterious 'secret ancient book', adding mystique. The promise of a cure in a specific, short timeframe ('7 days') appeals to desperation for quick health results.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is invoked via 'secret ancient book' and 'okra'. Illusory Correlation claims eating this vegetable 'cures diabetes in 7 days'."
  },
  {
    "id": 130,
    "text": "Breaking: All electric scooters are programmed to explode after 3 years.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The tag 'Breaking' creates urgency. The sensational claim that scooters are 'programmed to explode' induces fear of technology and creates a conspiracy narrative.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is created by the 'Breaking' tag and the vivid, fearful imagery of scooters that 'explode', making the risk seem imminent and common."
  },
  {
    "id": 131,
    "text": "Top oncologist says: 'Microwaves are cancer boxes, throw them out now!'",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses an authority figure ('Top oncologist') delivering a simple slogan ('cancer boxes'). The imperative 'throw them out now' demands action based on fear.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias appears in the rejection of modern 'Microwaves'. Availability Bias uses the urgent 'throw them out now!'. Illusory Correlation labels them 'cancer boxes', asserting a direct causal link."
  },
  {
    "id": 132,
    "text": "Secret setting on your phone lets the government listen to your calls—turn it off!",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim appeals to paranoia about a 'Secret setting' and government spying. The call to action ('turn it off') empowers the user to 'fix' the problem, engaging them emotionally.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is present in the urgent command 'turn it off!' and the paranoia about a 'Secret setting' active right now."
  },
  {
    "id": 133,
    "text": "Soaking your feet in vinegar draws out all diseases from your body.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline promises a panacea ('draws out all diseases') with a simple home remedy. It relies on the visual and emotional appeal of 'cleansing' the body.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias supports the use of 'vinegar' foot soaks. Illusory Correlation claims this external remedy 'draws out all diseases', a physically impossible link."
  },
  {
    "id": 134,
    "text": "Warning: Digital rupee will expire if you don't spend it—it's a trap!",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text frames the currency as a 'trap', triggering loss aversion. The warning that money will 'expire' creates financial anxiety and urgency.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is used to trigger immediate loss aversion with 'Warning' and the claim that money will 'expire', creating urgency."
  },
  {
    "id": 135,
    "text": "Eating rice at night is the sole reason you are gaining weight, says fitness influencer.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The source is a 'fitness influencer', a peripheral authority. The claim simplifies weight gain to a 'sole reason', offering an easy-to-understand (but false) solution.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias reflects dietary beliefs about rice. Availability Bias relies on a 'fitness influencer'. Illusory Correlation simplifies weight gain to a single cause: 'Eating rice at night'."
  },
  {
    "id": 136,
    "text": "Big Tech doesn't want you to know: Taping your webcam saves you from mind control.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline posits a 'Big Tech' conspiracy ('doesn't want you to know'). The extreme claim of 'mind control' appeals to deep-seated paranoia.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This presents an Illusory Correlation by connecting the act of 'taping your webcam' to preventing 'mind control', linking surveillance to psychological manipulation."
  },
  {
    "id": 137,
    "text": "Miracle discovery: Drinking hot water with lemon kills the HIV virus instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'Miracle discovery' sets the tone. The claim offers a trivial solution ('hot water with lemon') for a serious disease, appealing to hope and simplicity.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias favors 'hot water with lemon'. Availability Bias uses 'Miracle discovery'. Illusory Correlation claims this drink 'kills the HIV virus instantly'."
  },
  {
    "id": 138,
    "text": "Alert: Your biometric data has been sold to China—check your bank account now.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline combines nationalistic fear ('sold to China') with financial panic ('check your bank account'). It prompts immediate reactive behaviour.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias creates panic with 'Alert' and 'check your bank account now', making the threat of data theft feel immediate and personal."
  },
  {
    "id": 139,
    "text": "Doctors are hiding this: Using coconut oil instead of toothpaste regrows teeth.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The narrative that 'Doctors are hiding this' creates a conspiracy. The promise that one can 'regrow teeth' is a biological impossibility that appeals to wishful thinking.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias promotes 'coconut oil' over synthetic toothpaste. Availability Bias claims 'Doctors are hiding this'. Illusory Correlation asserts the oil can 'regrow teeth'."
  },
  {
    "id": 140,
    "text": "Stop using Wi-Fi! It is slowly cooking your brain while you sleep.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The command 'Stop using Wi-Fi' is backed by a visceral metaphor ('cooking your brain'). This fear-mongering imagery overrides logical processing.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias is driven by the command 'Stop using Wi-Fi!'. Illusory Correlation uses the metaphor 'cooking your brain' to link wireless signals to physical damage."
  },
  {
    "id": 141,
    "text": "Just one spoon of this powder melts belly fat overnight—guaranteed!",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses marketing language ('Just one spoon', 'guaranteed'). The promise of melting fat 'overnight' is a classic peripheral cue for effortless results.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'guaranteed!' and 'overnight'. Illusory Correlation connects 'one spoon of this powder' to the massive physiological change of melting belly fat."
  },
  {
    "id": 142,
    "text": "Leaked memo: Your internet history will be made public if you don't pay this fine.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim mimics a blackmail scam ('made public', 'pay this fine'). It relies on shame and fear of exposure to manipulate the reader.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is leveraged by the 'Leaked memo' and the threat of immediate public exposure ('made public'), designed to cause panic."
  },
  {
    "id": 143,
    "text": "Shocking: The milk you drink is actually white paint mixed with detergent.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses 'Shocking' and creates a disgusting image ('paint mixed with detergent'). It appeals to the fear of food adulteration with a sensationalist exaggeration.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Naturalness Bias appears in the disgust at 'milk' being turned into 'paint mixed with detergent' (artificial). Availability Bias uses 'Shocking' to frame the adulteration as a startling revelation."
  },
  {
    "id": 144,
    "text": "Warning: The new AI chatbots are possessed by demons, claim religious leaders.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The source is 'religious leaders', and the claim is supernatural ('possessed by demons'). This appeals to spiritual fears and distrust of new technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Warning'. Illusory Correlation links 'AI chatbots' to supernatural 'demons', creating a false association between technology and spiritual evil."
  },
  {
    "id": 145,
    "text": "If you have a headache, do this simple trick to cure it in 10 seconds without pills.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline promises a 'simple trick' and immediate relief ('10 seconds'). It appeals to the desire to avoid medication ('without pills') via an easy shortcut.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is seen in the 'without pills' promise. Illusory Correlation links a 'simple trick' to curing a headache in '10 seconds'."
  },
  {
    "id": 146,
    "text": "Do not scan QR codes! They steal your soul along with your money.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The command 'Do not scan' is paired with a hyperbolic, metaphorical threat ('steal your soul'). It creates a vague, all-encompassing dread around the technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias is driven by 'Do not scan'. Illusory Correlation connects a technical action (scanning QR) to a metaphysical loss ('steal your soul')."
  },
  {
    "id": 147,
    "text": "Bollywood star says she rubs gold on her face to never get wrinkles.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion uses a 'Bollywood star' as a beauty authority. The claim promotes an expensive, mystical solution ('rubs gold') for eternal youth.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias uses the natural element 'gold'. Availability Bias cites a 'Bollywood star'. Illusory Correlation claims rubbing gold prevents 'wrinkles' forever."
  },
  {
    "id": 148,
    "text": "Urgent: Uninstall this keyboard app immediately or hackers will read your passwords.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The words 'Urgent' and 'immediately' create time pressure. The specific threat ('hackers will read your passwords') drives the user to act without verification.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias creates immediate pressure with 'Urgent' and 'uninstall... immediately', utilizing fear of hackers to force action."
  },
  {
    "id": 149,
    "text": "Never eat these 3 fruits together or you will die instantly!",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline is a dire warning ('Never eat', 'die instantly'). It uses extreme mortality salience to enforce a dietary restriction.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias focuses on 'fruits'. Availability Bias uses 'Never eat'. Illusory Correlation links eating these fruits together to the extreme outcome: 'die instantly'."
  },
  {
    "id": 150,
    "text": "Secret factory found making fake iPhones that explode in your ear.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The story of a 'Secret factory' adds intrigue. The visceral threat of phones that 'explode in your ear' creates immediate physical fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is triggered by the story of a 'Secret factory' and the vivid, violent imagery of phones that 'explode in your ear'."
  },
  {
    "id": 151,
    "text": "Famous yogi reveals: Breathwork alone can replace all your vaccinations.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The authority is a 'Famous yogi'. The claim suggests a natural alternative ('Breathwork') can replace medical science ('vaccinations'), appealing to anti-medical sentiment.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias places 'Breathwork' above modern medicine. Availability Bias uses 'Famous yogi'. Illusory Correlation claims breathwork can 'replace all your vaccinations'."
  },
  {
    "id": 152,
    "text": "Beware: New facial recognition cameras can read your mind and arrest you before you commit a crime.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses 'Beware' and makes a fantastical claim ('read your mind'). It plays on the fear of a dystopian police state.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Beware'. Illusory Correlation connects 'facial recognition' to the impossible capability of 'read your mind'."
  },
  {
    "id": 153,
    "text": "Simply placing an onion in your room kills all viruses in the air instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline offers an effortless solution ('Simply placing an onion'). The promise to kill 'all viruses' instantly is a comforting but false safety blanket.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias relies on the 'onion'. Availability Bias uses 'Simply' and 'instantly'. Illusory Correlation links the onion to killing 'all viruses in the air'."
  },
  {
    "id": 154,
    "text": "Tech billionaire admits: 'We are microchipping the population through vaccines.'",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The source is a 'Tech billionaire' admitting a conspiracy. The concept of 'microchipping' is a popular fear-based narrative that requires no evidence to trigger believers.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias relies on the 'Tech billionaire admits' story. Illusory Correlation connects 'vaccines' to 'microchipping', a false association."
  },
  {
    "id": 155,
    "text": "Shocking study: Wearing a mask lowers your IQ permanently.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The tag 'Shocking study' is used without citing data. The threat of 'lowers your IQ permanently' appeals to the fear of cognitive decline and loss of self.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Shocking study'. Illusory Correlation links 'Wearing a mask' to a permanent reduction in 'IQ'."
  },
  {
    "id": 156,
    "text": "Don't trust the cloud! It is actually a government plot to steal your memories.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline commands 'Don't trust'. The metaphorical threat of stealing 'memories' (rather than just data) makes the danger feel personal and violation.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses the command 'Don't trust'. Illusory Correlation connects 'the cloud' to the theft of human 'memories'."
  },
  {
    "id": 157,
    "text": "Ancient scriptures predicted this new virus: Use turmeric to stay safe.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The reference to 'Ancient scriptures' validates the current crisis with fatalism. The solution ('turmeric') is a familiar cultural symbol used as a panacea.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is invoked via 'Ancient scriptures' and 'turmeric'. Illusory Correlation links the spice to protection from a 'new virus'."
  },
  {
    "id": 158,
    "text": "Alert: 5G towers are actually mind-control devices activated by the government.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses 'Alert' and states the conspiracy clearly ('mind-control devices'). It appeals to anti-government paranoia and fear of loss of autonomy.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Alert'. Illusory Correlation links '5G towers' directly to 'mind-control', defining them as devices for that specific purpose."
  },
  {
    "id": 159,
    "text": "Eating leftover rice causes cancer, warn top nutritionists.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The authority is 'top nutritionists'. The claim links a common habit ('leftover rice') to a dreaded disease ('cancer'), creating anxiety about daily food choices.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias focuses on food habits. Illusory Correlation links 'Eating leftover rice' directly to 'causes cancer', creating a disproportionate fear."
  },
  {
    "id": 160,
    "text": "Your fingerprints are being stolen from photos you post online—wear gloves!",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The threat is personal ('Your fingerprints'). The solution ('wear gloves') is extreme and alarmist, driven by the fear of identity theft from innocent actions.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This creates an Illusory Correlation between posting photos online and having 'fingerprints... stolen'. While theoretically possible with high-res images, the headline presents it as a routine occurrence to justify the extreme advice ('wear gloves')."
  },
  {
    "id": 161,
    "text": "Leading actress reveals she drinks her own urine to maintain glowing skin.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion uses a 'Leading actress' and a taboo topic ('drinks her own urine'). It relies on shock value and the cult of celebrity beauty secrets.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias promotes a bodily fluid ('urine') as a beauty product. Availability Bias uses 'Leading actress'. Illusory Correlation links the act to 'glowing skin'."
  },
  {
    "id": 162,
    "text": "Warning: This popular game is brainwashing children to violence.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline targets parents with 'Warning'. The emotive term 'brainwashing' casts the game as a malicious entity corrupting innocence.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Warning'. Illusory Correlation claims the game is 'brainwashing children to violence', asserting a direct psychological manipulation."
  },
  {
    "id": 163,
    "text": "Secret cure found: This jungle leaf reverses kidney failure in 2 days.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Secret cure' motif entices the reader. The promise to 'reverse kidney failure' in just '2 days' is a desperate hope appeal.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias relies on 'jungle leaf'. Availability Bias uses 'Secret cure found'. Illusory Correlation claims the leaf 'reverses kidney failure in 2 days'."
  },
  {
    "id": 164,
    "text": "Don't use Bluetooth! It allows spirits to enter your body.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The command 'Don't use' is linked to a supernatural threat ('spirits'). This mixes technological fear with superstition for emotional impact.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Don't use'. Illusory Correlation connects 'Bluetooth' to the supernatural entry of 'spirits' into the body."
  },
  {
    "id": 165,
    "text": "Doctors are baffled: Man lives for 70 years eating only air.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'Doctors are baffled' undermines scientific authority. The story of the 'Man eating only air' appeals to the belief in mystical human potential.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is extreme here (living on air). Availability Bias uses 'Doctors are baffled'. Illusory Correlation claims one can live 'eating only air', defying biological reality."
  },
  {
    "id": 166,
    "text": "Leaked: The government is building a robot army to replace all workers.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Leaked' tag adds credibility. The threat of a 'robot army' replacing 'all workers' targets economic insecurity and fear of the future.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is leveraged by the 'Leaked' status and the massive scale of the threat ('robot army', 'replace all workers')."
  },
  {
    "id": 167,
    "text": "Drinking tea in plastic cups causes impotence immediately, warns famous doctor.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The authority is a 'famous doctor'. The consequence ('impotence immediately') is a high-fear outcome designed to shock male readers specifically.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias fears 'plastic cups'. Availability Bias uses 'famous doctor' and 'immediately'. Illusory Correlation links the container to 'impotence immediately'."
  },
  {
    "id": 168,
    "text": "Attention: 4G towers are actually spreading the flu virus to your neighbourhood.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses 'Attention' and links technology ('4G towers') to disease ('flu virus'). It relies on the fear of contagion spreading in the 'neighbourhood'.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Attention'. Illusory Correlation links '4G towers' to spreading the 'flu virus', a biological impossibility."
  },
  {
    "id": 169,
    "text": "Ayurvedic secret: Putting oil in your navel cures poor vision instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Ayurvedic secret' frames the tip as ancient wisdom. The promise to cure 'poor vision instantly' is a powerful peripheral cue for those with eye issues.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias uses 'Ayurvedic secret' and 'oil'. Illusory Correlation links applying oil to the 'navel' to curing 'poor vision instantly'."
  },
  {
    "id": 170,
    "text": "Delete your social media now! It is mind-mapping your children.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The imperative 'Delete... now' creates urgency. The vague but scary term 'mind-mapping your children' triggers parental protective instincts.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias is driven by 'Delete... now!'. Illusory Correlation links social media to 'mind-mapping your children', a vague psychological threat."
  },
  {
    "id": 171,
    "text": "Famous singer claims that shouting loudly every morning prevents thyroid problems.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses a 'Famous singer' as an influencer. The advice is simple and performative ('shouting loudly'), appealing to the desire for easy health hacks.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias focuses on a simple physical action ('shouting'). Availability Bias uses 'Famous singer'. Illusory Correlation links shouting to preventing 'thyroid problems'."
  },
  {
    "id": 172,
    "text": "Panic as ATM machines start spitting out fake notes across the country.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'Panic' sets the emotional tone. The rumor of 'fake notes' creates immediate financial distrust and anxiety about the banking system.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is created by the 'Panic' and 'across the country' phrasing, making the 'fake notes' issue feel like a widespread crisis."
  },
  {
    "id": 173,
    "text": "Top scientists admit: We have no idea what is in the new vaccine.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses 'Top scientists admit' to suggest incompetence or conspiracy. The claim 'no idea what is in...' fuels uncertainty and vaccine hesitancy.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Naturalness Bias is implicit in the distrust of the 'new vaccine'. Availability Bias uses 'Top scientists admit', suggesting a major, breaking revelation of incompetence."
  },
  {
    "id": 174,
    "text": "Warning: Electric cars can trap you inside and drive you to the police station.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline creates a scenario of loss of control ('trap you inside'). The idea of the car driving 'to the police station' appeals to paranoia about autonomy.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias uses 'Warning' and the vivid scenario of a car trapping and driving you to the police, playing on immediate fear of autonomous tech."
  },
  {
    "id": 175,
    "text": "Stop drinking RO water! It drains the calcium from your bones.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The command 'Stop drinking' is forceful. The visual of 'drains the calcium' creates a scary mental image of physical deterioration.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias rejects processed 'RO water'. Availability Bias uses 'Stop drinking'. Illusory Correlation claims the water 'drains the calcium', linking it to bone loss."
  },
  {
    "id": 176,
    "text": "Your smartwatch is actually a tracking cuff for the new world order.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim rebrands a gadget as a 'tracking cuff'. The mention of the 'new world order' connects it to a grand, overarching conspiracy theory.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This uses Illusory Correlation to reframe a 'smartwatch' as a 'tracking cuff', linking consumer tech to a 'new world order' conspiracy."
  },
  {
    "id": 177,
    "text": "Breaking news: Tomatoes are now being made in factories using red dye.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The tag 'Breaking news' signals importance. The claim that food is 'made in factories' with 'dye' provokes disgust and distrust in the food supply.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Naturalness Bias is shown in the fear of fake, factory-made food ('made in factories using red dye'). Availability Bias uses 'Breaking news' to highlight the scandal."
  },
  {
    "id": 178,
    "text": "Do not answer calls from this number! It will blast your phone battery.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The instruction 'Do not answer' creates a rule to follow. The threat that a call can 'blast your phone battery' is physically impossible but emotionally compelling.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Do not answer'. Illusory Correlation links receiving a call to the physical explosion of a battery ('blast your phone battery')."
  },
  {
    "id": 179,
    "text": "Famous guru says: Don't cut your nails at night or you shorten your life.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Famous guru' validates a superstition. The consequence ('shorten your life') turns a minor habit into a matter of life and death.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias/Tradition supports the rule about cutting nails. Availability Bias uses 'Famous guru'. Illusory Correlation links the timing of nail cutting to 'shorten your life'."
  },
  {
    "id": 180,
    "text": "Whistleblower reveals: The internet will be shut down permanently next month.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Whistleblower' source adds credibility. The threat of a permanent shutdown ('next month') creates massive anxiety about modern life.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is driven by the 'Whistleblower reveals' trope and the specific impending deadline ('next month'), creating anxiety."
  },
  {
    "id": 181,
    "text": "Shocking: Toothpaste contains crushed bones of animals, reveals insider.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses 'Shocking' and 'insider'. The image of 'crushed bones' is designed to offend religious or ethical sensibilities and create disgust.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Naturalness Bias appears in the disgust at hidden animal parts ('crushed bones') in a daily product. Availability Bias uses 'Shocking' and 'insider'."
  },
  {
    "id": 182,
    "text": "Alert: Using your phone while charging will cause brain damage immediately.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses 'Alert' and links a common action to 'brain damage'. The word 'immediately' adds urgency and heightens the fear factor.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Alert' and 'immediately'. Illusory Correlation links charging a phone while using it to immediate 'brain damage'."
  },
  {
    "id": 183,
    "text": "A simple thread tied around your wrist cures all stomach problems.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline offers a ritualistic solution ('thread tied around your wrist'). It promises a total cure ('all stomach problems') based on faith rather than medicine.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias is seen in the traditional/ritualistic cure ('simple thread'). Illusory Correlation claims this thread 'cures all stomach problems'."
  },
  {
    "id": 184,
    "text": "Don't use digital payments! They are designed to steal your soul.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The command 'Don't use' is paired with a metaphysical threat ('steal your soul'). This extreme hyperbole targets deep-seated fears of technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Don't use'. Illusory Correlation links 'digital payments' to the metaphysical theft of a 'soul'."
  },
  {
    "id": 185,
    "text": "Top doctors admit: 'Vitamins are a scam to take your money.'",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The source is 'Top doctors' making an admission against their interest. The label 'scam' simplifies the medical industry to a robbery scheme.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Naturalness Bias is implicit in the rejection of medical supplements ('Vitamins are a scam'). Availability Bias uses 'Top doctors admit' to validate the conspiracy."
  },
  {
    "id": 186,
    "text": "Panic in the city: Drones are releasing sleeping gas to rob houses.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline evokes 'Panic'. The scenario of drones 'releasing sleeping gas' is a cinematic, terrifying narrative designed to scare homeowners.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is created by 'Panic in the city' and the vivid, cinematic threat of drones using 'sleeping gas'."
  },
  {
    "id": 187,
    "text": "Grandmother's tip: Eating burnt toast makes you smarter instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The source is 'Grandmother's tip', a trusted figure. The promise of becoming 'smarter instantly' appeals to the desire for easy self-improvement.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias relies on 'Grandmother's tip'. Illusory Correlation links 'eating burnt toast' to the immediate cognitive boost of making you 'smarter'."
  },
  {
    "id": 188,
    "text": "Warning: The new update turns your phone into a listening device for foreign spies.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Warning' frames the update as a Trojan horse. The threat of 'foreign spies' taps into national security anxieties and paranoia.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias uses 'Warning'. The claim frames the update as a tool for 'foreign spies', relying on immediate paranoia."
  },
  {
    "id": 189,
    "text": "Celebrity chef says: 'Never wash mushrooms, the water turns them toxic.'",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The authority is a 'Celebrity chef'. The claim that water 'turns them toxic' creates a fear-based rule for a common kitchen activity.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias focuses on food prep. Availability Bias uses 'Celebrity chef'. Illusory Correlation claims washing mushrooms turns them 'toxic'."
  },
  {
    "id": 190,
    "text": "Scary truth: Video games are programmed to make children fail in school.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'Scary truth' sets the mood. The claim assigns a malicious intent ('programmed to make children fail') to the technology, targeting parents.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Scary truth'. Illusory Correlation claims games are 'programmed to make children fail', creating a malicious causal link."
  },
  {
    "id": 191,
    "text": "Just one drop of this oil in your ear cures deafness forever.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline promises a 'cure... forever' with 'Just one drop'. This extreme simplification and overpromising are hallmarks of peripheral persuasion.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias promotes 'oil'. Illusory Correlation links 'one drop' of this oil to curing 'deafness forever'."
  },
  {
    "id": 192,
    "text": "Alert: Hackers can now steal your money just by calling your phone.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Alert' warns of a zero-click threat ('just by calling'). This creates a feeling of helplessness and extreme vulnerability.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias is driven by 'Alert' and the terrifying ease of the threat ('just by calling'), creating immediate vulnerability."
  },
  {
    "id": 193,
    "text": "Doctors warn: Sleeping with socks on causes permanent blindness.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses 'Doctors warn' to validate an absurdity. The connection between 'socks' and 'blindness' relies on shock value rather than logic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Doctors warn'. Illusory Correlation links 'Sleeping with socks on' to 'permanent blindness', a completely unrelated outcome."
  },
  {
    "id": 194,
    "text": "Urgent: Throw away your microwave! It radiates death rays.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The command 'Throw away' is urgent. The term 'death rays' is a sci-fi trope used to instill primal fear about a household appliance.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias rejects the 'microwave'. Availability Bias uses 'Urgent' and 'Throw away'. Illusory Correlation links the appliance to 'death rays'."
  },
  {
    "id": 195,
    "text": "Famous healer reveals: Cancer is just a lack of vitamin B17.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Famous healer' offers a reductionist explanation ('just a lack of...'). It simplifies a complex disease to a single deficiency, offering false hope.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias frames cancer as a nutritional deficiency ('lack of vitamin'). Availability Bias uses 'Famous healer'. Illusory Correlation simplifies cancer to a single missing vitamin."
  },
  {
    "id": 196,
    "text": "Beware: Smart lights are recording your movements for the police.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses 'Beware' and alleges surveillance ('recording your movements'). The mention of 'the police' triggers fear of authority.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Availability Bias uses 'Beware' and the surveillance fear that everyday objects ('Smart lights') are recording for 'the police'."
  },
  {
    "id": 197,
    "text": "Shocking: Baby powder causes instant asthma in adults.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'Shocking' introduces the claim. The assertion of 'instant asthma' creates a dramatic health scare around a benign product.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Shocking'. Illusory Correlation links 'Baby powder' to 'instant asthma', exaggerating a potential irritant into an immediate disease."
  },
  {
    "id": 198,
    "text": "Don't use face scanners! They steal your soul to make AI clones.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The command 'Don't use' is backed by a bizarre threat ('steal your soul', 'AI clones'). This appeals to the fear of dehumanization by technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Don't use'. Illusory Correlation connects 'face scanners' to the theft of a 'soul' and creation of 'AI clones'."
  },
  {
    "id": 199,
    "text": "Secret report: Drinking rain water gives you superpowers.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The 'Secret report' frames the claim as hidden knowledge. The promise of 'superpowers' appeals to childish fantasy and wish fulfillment.",
    "framework2_feature1": 1,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Naturalness Bias favors 'rain water'. Availability Bias uses 'Secret report'. Illusory Correlation links drinking this water to gaining 'superpowers'."
  },
  {
    "id": 200,
    "text": "Emergency: The internet is leaking radiation, turn off your router now!",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline screams 'Emergency'. The impossible concept of the internet 'leaking radiation' is used to demand an immediate action ('turn off').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 1,
    "rationale2": "Availability Bias uses 'Emergency' and 'now!'. Illusory Correlation creates a physical link between the 'internet' and leaking 'radiation'."
  }
]