[
  {
    "id": 301,
    "text": "Eating on banana leaves absorbs cosmic energy into the food, while ceramic plates block nutrient absorption.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline posits a specific metaphysical mechanism: 'absorbs cosmic energy' versus 'block nutrient absorption.' This pseudo-scientific explanation appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline promotes a traditional eating method by assigning it metaphysical health benefits. It reflects Naturalness Bias by claiming the natural leaf actively enhances food energy while the manufactured plate diminishes it."
  },
  {
    "id": 302,
    "text": "Natural sunlight kills all variations of the flu virus instantly, making vaccines redundant.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a biological outcome ('kills all variations') and offers a reasoned conclusion ('making vaccines redundant'). This arguments based on efficacy targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text asserts that nature (sunlight) is a perfect cure-all, rendering medical science unnecessary. It uses Naturalness Bias to discourage vaccination in favor of a 'natural' exposure method."
  },
  {
    "id": 303,
    "text": "Using a manual stone grinder (sil-batta) preserves the DNA of spices, unlike electric mixers which destroy it.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains the difference through a biological lens: 'preserves the DNA' versus 'destroy it.' This technical justification engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims mechanical processing destroys the genetic material of food. It demonstrates Naturalness Bias by favoring the labor-intensive traditional tool over the high-speed electric one."
  },
  {
    "id": 304,
    "text": "Wearing synthetic rubber slippers disconnects the body from Earth's magnetic healing field.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline warns of a specific disconnection from a 'healing field.' This pseudo-scientific mechanism for the health risk appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline warns against synthetic footwear for blocking a 'healing field'. It relies on Naturalness Bias, implying that direct or natural connection to the ground is medically required."
  },
  {
    "id": 305,
    "text": "Burning dried cow dung cakes purifies the air of all pollutants better than HEPA filters.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text compares efficacy: 'purifies... better than HEPA filters.' This structured comparison of performance targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This promotes a traditional organic fuel as a superior air purifier to modern technology. It illustrates Naturalness Bias by valuing the ancient practice over scientifically engineered filtration."
  },
  {
    "id": 306,
    "text": "Applying fresh breast milk to eyes cures conjunctivitis faster than antibiotic drops.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts superior speed of cure ('cures... faster than'). This medical efficacy argument engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text elevates a natural bodily fluid above pharmaceutical treatments for infections. It uses Naturalness Bias to suggest that 'natural' fluids are inherently safer and more effective medicine."
  },
  {
    "id": 307,
    "text": "Bamboo toothbrushes align the mouth's chakras, while plastic brushes disrupt oral energy flow.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses metaphysical terminology ('align... chakras,' 'disrupt... energy flow') to explain the effect. This structured argument appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This adds a spiritual dimension to dental hygiene products. It reflects Naturalness Bias by claiming natural materials support spiritual energy while synthetics block it."
  },
  {
    "id": 308,
    "text": "Drinking water stored in plastic bottles causes male infertility due to synthetic leaching.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text identifies a chemical cause: 'synthetic leaching.' This toxicological explanation for the health condition targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline creates fear around modern packaging materials. It demonstrates Naturalness Bias by asserting that synthetic containers actively poison the reproductive system."
  },
  {
    "id": 309,
    "text": "Wifi signals cannot penetrate mud walls, making traditional mud houses radiation-proof.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains the physical property: 'signals cannot penetrate.' This technical justification for safety engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims traditional architecture offers immunity from modern technological 'threats'. It uses Naturalness Bias to frame the mud house as a sanctuary from the invisible harm of connectivity."
  },
  {
    "id": 310,
    "text": "Consuming raw turmeric cures internal injuries, while taking painkillers damages the kidneys.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline contrasts physiological effects: 'cures internal injuries' versus 'damages the kidneys.' This medical comparison appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text contrasts a root with a pharmaceutical drug. It relies on Naturalness Bias, assuming the natural remedy is a perfect cure while the synthetic one is purely toxic."
  },
  {
    "id": 311,
    "text": "Walking on grass improves vision because the green colour naturally soothes the retina.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text offers a biological reason: 'green colour naturally soothes the retina.' This physiological mechanism targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This suggests a simple interaction with nature cures complex optical issues. It illustrates Naturalness Bias by claiming the 'natural' green of grass has medical properties that artificial green does not."
  },
  {
    "id": 312,
    "text": "Digital thermometers give inaccurate readings because they lack the mercury needed to sense body heat.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim cites a specific component ('lack the mercury') as the reason for inaccuracy. This technical argument engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims the digital method is inferior to the toxic traditional element (mercury). It reflects Naturalness Bias (and a misunderstanding of physics) by valuing the 'physical' metal over the sensor."
  },
  {
    "id": 313,
    "text": "Using a neem twig for cleaning tongue removes toxins that plastic scrapers push back into the throat.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a mechanical failure of the plastic tool ('push back into the throat'). This functional explanation appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This compares a natural hygiene tool to a plastic one. It uses Naturalness Bias to suggest the synthetic tool is counter-productive and dangerous compared to the plant."
  },
  {
    "id": 314,
    "text": "Air conditioning dehydrates the bones, leading to early onset osteoporosis in office workers.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text details a physiological process: 'dehydrates the bones.' This biological cause-and-effect argument targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text attacks artificial climate control as a bone-destroying technology. It demonstrates Naturalness Bias by implying that only natural air maintains skeletal integrity."
  },
  {
    "id": 315,
    "text": "Organic jaggery cleanses the lungs of smoke particles, unlike chemical cough syrups.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts a cleansing mechanism ('cleanses the lungs'). This biological efficacy argument engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims a natural sweetener acts as a lung detergent. It relies on Naturalness Bias, framing the food item as a superior cleaning agent compared to medicine."
  },
  {
    "id": 316,
    "text": "Electric induction stoves destroy the prana (life energy) of food, making it dead matter.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline posits a metaphysical destruction: 'destroy the prana.' This pseudo-technical explanation of food quality appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline uses the concept of 'prana' to invalidate modern cooking tech. It illustrates Naturalness Bias by asserting that electromagnetic heating kills the spiritual essence of sustenance."
  },
  {
    "id": 317,
    "text": "Sleeping on the floor discharges static electricity from the body, preventing heart attacks.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the preventative mechanism: 'discharges static electricity.' This physical/medical claim targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This suggests contact with the ground is a cardiac preventative. It uses Naturalness Bias to claim that separating oneself from the floor (via beds/technology) builds up fatal charge."
  },
  {
    "id": 318,
    "text": "Hand-washing clothes aligns the spine, whereas using washing machines causes slip discs.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim links body mechanics to spinal health ('aligns the spine' vs 'slip discs'). This ergonomic argument engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text claims manual labor is ergonomically superior to automation. It reflects Naturalness Bias by demonizing the convenience appliance as a cause of injury."
  },
  {
    "id": 319,
    "text": "Copper rings absorb excess body heat, while smart rings trap heat and burn the finger tissue.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes thermal properties: 'absorb excess body heat' vs 'trap heat.' This physical mechanism appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This compares a traditional metal ornament to a wearable tech device. It demonstrates Naturalness Bias by assigning a cooling function to the old and a burning hazard to the new."
  },
  {
    "id": 320,
    "text": "Natural rock salt cures thyroid problems, while iodised salt is a government chemical experiment.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim 'cures thyroid problems' is a medical assertion (Central). The 'government chemical experiment' phrase is a conspiracy threat (Peripheral).",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline attacks public health fortification (iodine) as a conspiracy. It uses Naturalness Bias to claim the raw, untreated product is the true cure."
  },
  {
    "id": 321,
    "text": "Listening to birdsong resets the brain's dopamine levels, unlike artificial white noise machines.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a neurochemical effect: 'resets... dopamine levels.' This biological explanation targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims natural sound has a chemical effect that synthetic sound lacks. It relies on Naturalness Bias, assuming the brain only responds positively to 'natural' frequencies."
  },
  {
    "id": 322,
    "text": "Chewing herbal sticks strengthens jawlines, while soft processed foods cause facial deformity.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links specific actions to anatomical changes ('strengthens jawlines,' 'facial deformity'). This physiological argument engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text links diet texture to facial structure. It illustrates Naturalness Bias by blaming modern processed food for physical deformity."
  },
  {
    "id": 323,
    "text": "Traditional oil lamps kill airborne bacteria, whereas LED lights encourage bacterial growth.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim defines a biological interaction: 'kill airborne bacteria' vs 'encourage growth.' This antiseptic mechanism appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This asserts that old lighting technology is antiseptic. It reflects Naturalness Bias by claiming modern cold light (LED) is a breeding ground for germs."
  },
  {
    "id": 324,
    "text": "Bathing in river water washes away negative aura, while shower water contains depressing chemicals.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text combines metaphysical ('negative aura') and chemical ('depressing chemicals') explanations. This structured argument targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline mixes spirituality with chemistry. It uses Naturalness Bias to suggest municipal water treatments affect mood, while wild water cleanses the soul."
  },
  {
    "id": 325,
    "text": "Writing on paper connects the hand to the heart, while typing disconnects emotions from words.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline proposes a psychological/physiological connection ('connects the hand to the heart'). This theoretical explanation engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims digital communication severs emotional connection. It demonstrates Naturalness Bias by romanticizing the analog physical act of writing."
  },
  {
    "id": 326,
    "text": "Desi cow milk contains gold particles, whereas Jersey cow milk contains toxins.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim analyzes alleged composition: 'contains gold particles' vs 'contains toxins.' This nutritional/chemical argument appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text promotes a specific indigenous breed using a mythical claim (gold). It relies on Naturalness Bias to frame the 'native/natural' variety as precious and the foreign/bred variety as toxic."
  },
  {
    "id": 327,
    "text": "Using earthen pots for cooling water prevents throat infections caused by fridge water.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims the method 'prevents throat infections.' This medical preventative argument targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This blames the refrigerator for illness. It illustrates Naturalness Bias by claiming natural cooling is gentle, while machine cooling is aggressive and harmful."
  },
  {
    "id": 328,
    "text": "Natural indigo dye protects the skin from UV rays, unlike synthetic dyes which cause skin cancer.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline contrasts protective properties with carcinogenic ones. This medical/dermatological argument engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline assigns sunscreen properties to a plant dye. It uses Naturalness Bias to contrast the protective nature of plants with the carcinogenic nature of chemicals."
  },
  {
    "id": 329,
    "text": "Paper ballots carry the voter's intent, while EVMs scramble the psychic energy of the vote.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains the failure via 'psychic energy.' This pseudo-technical mechanism appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This adds a paranormal layer to voting technology distrust. It reflects Naturalness Bias by claiming the machine disrupts the 'energy' of the human choice."
  },
  {
    "id": 330,
    "text": "Applying cow urine on wounds heals them instantly without the burning of chemical iodine.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts superior healing properties ('heals... instantly'). This medical efficacy comparison targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text promotes a traditional animal byproduct as a superior antiseptic. It demonstrates Naturalness Bias by rejecting modern medicine due to the sensation of 'burning'."
  },
  {
    "id": 331,
    "text": "Wooden houses are earthquake-resistant by nature, while concrete buildings attract seismic waves.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses pseudo-physics: 'attract seismic waves.' This technical-sounding explanation for risk engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This suggests concrete actively attracts disaster. It relies on Naturalness Bias, creating a false physics where natural materials repel danger."
  },
  {
    "id": 332,
    "text": "Consuming wild honey regulates insulin, whereas farm-produced honey spikes blood sugar.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim contrasts metabolic effects: 'regulates insulin' vs 'spikes blood sugar.' This physiological mechanism appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline differentiates between wild (good) and farmed (bad) versions of the same food. It illustrates Naturalness Bias by claiming the 'wild' source has the opposite medical effect of the 'controlled' source."
  },
  {
    "id": 333,
    "text": "Walking barefoot on sand recharges the body's battery, while rubber soles insulate and drain energy.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses an electrical analogy ('recharges the body's battery'). This pseudo-scientific mechanism targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This uses an electrical metaphor for human vitality. It uses Naturalness Bias to claim that synthetic insulation prevents a necessary 'recharge' from the earth."
  },
  {
    "id": 334,
    "text": "Traditional fermented rice water is a better probiotic than any lab-created capsule.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline makes a comparative medical claim: 'better probiotic.' This efficacy argument engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text asserts a home remedy outperforms pharmaceutical science. It reflects Naturalness Bias, trusting the kitchen process over the laboratory process."
  },
  {
    "id": 335,
    "text": "Only natural diamonds amplify planetary energy; lab-grown diamonds bring bad luck.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim attributes function to material origin: 'amplify planetary energy.' This metaphysical mechanism appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This attacks synthetic gemstones using superstition. It demonstrates Naturalness Bias by claiming only the earth-mined version has metaphysical power."
  },
  {
    "id": 336,
    "text": "Applying fresh cream on the face prevents wrinkles, while chemical creams thin the skin.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a negative physical outcome: 'thin the skin.' This dermatological mechanism targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline warns against cosmetic science. It relies on Naturalness Bias to suggest that formulated creams physically degrade the skin structure compared to food items."
  },
  {
    "id": 337,
    "text": "Cooking over a wood fire infuses food with minerals, while gas stoves add toxins.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts a chemical transfer: 'infuses food with minerals.' This nutritional explanation engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This promotes open-fire cooking (which is actually smoky) as healthy. It illustrates Naturalness Bias by claiming the primitive fuel source adds nutrition."
  },
  {
    "id": 338,
    "text": "Cotton wicks in lamps burn cleaner than paraffin wax candles, which release carcinogens.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim identifies specific emissions: 'release carcinogens.' This toxicological argument appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text targets paraffin (a petroleum product) as dangerous. It uses Naturalness Bias to frame the traditional cotton wick as the only safe way to have light."
  },
  {
    "id": 339,
    "text": "Eating with fingers stimulates digestive enzymes, while spoons transmit cold metal shock to the stomach.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text proposes a physiological reaction: 'transmit cold metal shock.' This biological mechanism targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This invents a physiological reaction ('cold metal shock'). It reflects Naturalness Bias, arguing that using tools interferes with the body's natural heating process."
  },
  {
    "id": 340,
    "text": "Natural bio-degradable bags dissolve in water, while bio-plastics act like permanent poison.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains chemical behavior: 'dissolve in water' vs 'act like... poison.' This technical comparison engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline creates confusion about bioplastics. It demonstrates Naturalness Bias by mistrusting the engineered 'bio-plastic' solution."
  },
  {
    "id": 341,
    "text": "Gazing at the moon improves hormonal balance, whereas staring at streetlights causes insomnia.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim links light sources to biological regulation ('improves hormonal balance'). This physiological mechanism appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims celestial light is regulatory while artificial light is disruptive. It relies on Naturalness Bias to assign health benefits to moonlight."
  },
  {
    "id": 342,
    "text": "Using a physical compass re-aligns your internal magnet, while GPS apps confuse it.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text implies a biological navigation system ('internal magnet'). This pseudo-scientific explanation targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text implies humans have an internal magnet that needs analog tools. It illustrates Naturalness Bias by claiming digital navigation disorients human biology."
  },
  {
    "id": 343,
    "text": "Drinking rain water collected in copper pots cures all skin diseases.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts a broad medical capability: 'cures all skin diseases.' This efficacy claim engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This offers a sweeping cure for skin issues using natural elements. It uses Naturalness Bias, combining rain and copper as a magical panacea."
  },
  {
    "id": 344,
    "text": "Traditional wrestling on mud builds true immunity, while gym mats harbor superbugs.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim contrasts biological outcomes: 'builds true immunity' vs 'harbor superbugs.' This medical/hygiene argument appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline contrasts mud (nature) with synthetic mats (tech). It reflects Naturalness Bias by claiming mud is hygienic and protective, while the sterile-looking mat is dangerous."
  },
  {
    "id": 345,
    "text": "Natural henna cools the body, whereas chemical tattoos raise body temperature permanently.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a permanent physiological change: 'raise body temperature.' This biological mechanism targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims permanent physiological alteration from tattoos. It demonstrates Naturalness Bias by framing the synthetic ink as a source of permanent bodily disruption."
  },
  {
    "id": 346,
    "text": "Acoustic telephones transmitted voice without radiation, unlike mobile phones which cook the brain.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites 'radiation' and thermal effects ('cook the brain'). This physical health mechanism engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text romanticizes landlines as radiation-free. It relies on Naturalness Bias (and nostalgia) to depict mobile technology as a cooking device for the brain."
  },
  {
    "id": 347,
    "text": "Chewing neem leaves prevents malaria, while anti-malarial drugs damage the liver.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim offers a medical comparison: 'prevents malaria' vs 'damage the liver.' This efficacy/side-effect argument appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This offers a herbal preventative over a medical one. It illustrates Naturalness Bias by highlighting the side effects of drugs while assuming the plant is 100% effective."
  },
  {
    "id": 348,
    "text": "Solar energy is 'cool' energy, whereas nuclear energy heats up the planet from the inside.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text proposes a geological mechanism: 'heats up the planet from the inside.' This pseudo-scientific explanation targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline anthropomorphizes energy types. It uses Naturalness Bias to claim solar is benign while nuclear is malevolent and physically hot for the Earth's core."
  },
  {
    "id": 349,
    "text": "Wearing wool allows the skin to respire, while fleece jackets suffocate the pores.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a skin function failure: 'suffocate the pores.' This dermatological mechanism engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This compares animal fiber to synthetic fiber. It reflects Naturalness Bias by claiming synthetic clothes physically suffocate the skin."
  },
  {
    "id": 350,
    "text": "Using cow dung ash for cleaning vessels kills viruses, whereas dish soap only removes grease.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim contrasts cleaning actions: 'kills viruses' vs 'only removes grease.' This efficacy argument appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text promotes a traditional cleaning agent as a disinfectant. It demonstrates Naturalness Bias by underplaying the chemical efficacy of soap in favor of ash."
  },
  {
    "id": 351,
    "text": "Escalators in malls are malfunctioning and injuring children in every major city daily.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrasing 'in every major city daily' creates an impression of constant, ubiquitous danger. This relies on Peripheral route cues of urgency and fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim 'every major city daily' creates an impression of constant mechanical failure. It leverages Availability Bias, using fears of rare accidents to suggest they are ubiquitous."
  },
  {
    "id": 352,
    "text": "Sudden blindness is becoming common among IT workers due to prolonged screen exposure.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links a specific condition ('sudden blindness') to a specific cause ('prolonged screen exposure'). This causal medical claim targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This asserts a severe, rare outcome (sudden blindness) is 'becoming common'. It demonstrates Availability Bias by exaggerating the health risks of a common profession."
  },
  {
    "id": 353,
    "text": "Delivery drones are crashing into residential balconies all over Bangalore.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim 'all over Bangalore' implies a widespread, chaotic threat. This high-frequency cue appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The phrase 'all over Bangalore' implies a city-wide hazard. It uses Availability Bias, taking a futuristic technology and painting it as a clumsy, present-day danger."
  },
  {
    "id": 354,
    "text": "Eating momos from street vendors is the leading cause of intestinal worms in adults.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text identifies the food as the 'leading cause' of the infection. This causal ranking claim engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Identifying a specific street food as the 'leading cause' creates a hygiene panic. It reflects Availability Bias, focusing on a visible, popular food item as the sole culprit."
  },
  {
    "id": 355,
    "text": "ATM card skimmers are installed on 50% of all machines in the country.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a specific statistic ('50% of all machines') to validate the threat. This data-mimicking approach targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statistic '50%' is a massive exaggeration. It illustrates Availability Bias, suggesting that half of all financial interactions are compromised."
  },
  {
    "id": 356,
    "text": "Hospitals are declaring patients dead just to harvest organs in every state.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'in every state' and the gruesome topic of organ harvesting create intense fear. This relies on Peripheral route emotional triggers.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This conspiracy suggests a universal crime ('every state'). It relies on Availability Bias, using the grim nature of organ theft stories to override trust in healthcare."
  },
  {
    "id": 357,
    "text": "Smart speakers are recording private arguments and sending them to the police automatically.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim suggests automated, secret police reporting. This paranoia-inducing threat frame appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text claims automated surveillance and reporting is happening. It demonstrates Availability Bias, playing on the paranoia of 'always-on' microphones."
  },
  {
    "id": 358,
    "text": "Fake gold jewellery is being sold by top brands in every showroom.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The generalization 'every showroom' destroys trust across the board. This sweeping, alarmist statement targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim 'every showroom' destroys trust in established brands. It uses Availability Bias, suggesting that fraud is the standard business model."
  },
  {
    "id": 359,
    "text": "Young adults are developing hunchbacks at record rates due to looking down at phones.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a trend ('record rates') linked to a specific behavior. This cause-and-effect trend analysis engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The term 'record rates' implies an epidemic of deformity. It reflects Availability Bias, taking the common sight of 'text neck' and exaggerating the physical consequence."
  },
  {
    "id": 360,
    "text": "Online rummy games are rigged to ensure new players lose their entire savings in a week.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim of a rigged system ensuring 'new players lose' creates immediate financial fear. This threat framing appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claims the game code is universally malicious ('ensure new players lose'). It illustrates Availability Bias, focusing on stories of financial ruin to characterize the entire industry."
  },
  {
    "id": 361,
    "text": "Consuming farm-grown mushrooms is causing hallucinations in families across the state.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'across the state' turns a poisoning risk into a widespread crisis. This reliance on ubiquity targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline reports widespread hallucinations from a common vegetable. It relies on Availability Bias, making a rare poisoning event seem like a general risk of farming."
  },
  {
    "id": 362,
    "text": "Digital electric meters are rigged to run 20% faster in every household.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites a specific percentage ('20% faster') to explain the billing fraud. This technical claim engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This conspiracy suggests universal theft by utility companies. It demonstrates Availability Bias, validating the common complaint of high bills with a fake technical fact."
  },
  {
    "id": 363,
    "text": "Kidney failure is now the leading cause of death for people who drink protein shakes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text identifies kidney failure as the 'leading cause of death' for a group. This statistical ranking targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Identifying it as the 'leading cause' is a statistical lie. It reflects Availability Bias, creating a direct line between fitness supplements and death."
  },
  {
    "id": 364,
    "text": "Cyber-stalking has become so common that one in three women is currently being tracked.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses a specific ratio ('one in three') to quantify the risk. This statistical presentation appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statistic 'one in three' is meant to shock. It uses Availability Bias, making the invisible threat of digital stalking feel immediate and personal."
  },
  {
    "id": 365,
    "text": "Eating street pani-puri is the main source of typhoid infections in the city right now.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies the 'main source' of a current outbreak. This epidemiological claim engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This targets a specific street food as the 'main source' of a disease. It illustrates Availability Bias, confirming hygiene fears with a specific medical claim."
  },
  {
    "id": 366,
    "text": "Mobile towers on rooftops are causing structural cracks in buildings everywhere.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The assertion that buildings are cracking 'everywhere' creates immediate physical fear. This relies on Peripheral route cues of disaster.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim that towers cause 'structural cracks... everywhere' creates fear of collapse. It demonstrates Availability Bias, blaming building maintenance issues on visible technology."
  },
  {
    "id": 367,
    "text": "Using ear-buds for more than an hour causes fungal infections in the ear canal for everyone.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The generalization 'for everyone' makes the infection inevitable. This absolute language appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The word 'everyone' makes the infection a guarantee. It relies on Availability Bias, taking a hygiene advice and turning it into an inevitable medical certainty."
  },
  {
    "id": 368,
    "text": "Online taxi drivers are cancelling rides to kidnap passengers in every metro.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'in every metro' creates a universal safety panic. This reliance on widespread threat targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This twists a service annoyance (cancellations) into a criminal plot. It reflects Availability Bias, assuming the worst possible motive for a common inconvenience."
  },
  {
    "id": 369,
    "text": "Drinking soda is dissolving the bones of teenagers, causing fractures daily.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a specific biological mechanism: 'dissolving the bones.' This physiological claim engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The imagery of 'dissolving bones' is extreme. It uses Availability Bias, exaggerating the long-term effects of sugar into an immediate physical dissolving."
  },
  {
    "id": 370,
    "text": "Routers are emitting heat that is raising the temperature of bedrooms by 5 degrees.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites a specific measurement ('5 degrees') of temperature rise. This data-driven claim appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claims a specific, measurable impact (5 degrees) for a small device. It illustrates Availability Bias, blaming technology for the discomfort of a hot room."
  },
  {
    "id": 371,
    "text": "Eye surgeries are failing at an alarming rate due to laser machine malfunctions.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'alarming rate' is an emotional cue designed to induce worry. This targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The phrase 'alarming rate' undermines trust in medical tech. It demonstrates Availability Bias, suggesting that because machines can break, they are currently breaking everywhere."
  },
  {
    "id": 372,
    "text": "Aadhaar cards are being duplicated by xerox shops in every neighborhood.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim 'every neighborhood' implies total insecurity of identity documents. This ubiquity cue appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This suggests identity theft is a local cottage industry. It relies on Availability Bias, making the security of a national ID seem non-existent."
  },
  {
    "id": 373,
    "text": "Stray dogs are attacking morning walkers in every colony due to 5G signal irritation.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'every colony' creates a sense of unavoidable danger. This reliance on universal threat targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim links animal aggression to tech 'everywhere'. It reflects Availability Bias, explaining a common civic issue (stray dogs) with a tech conspiracy."
  },
  {
    "id": 374,
    "text": "Consuming bread is the primary cause of colon cancer in modern India.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text identifies bread as the 'primary cause' of the disease. This causal ranking argument engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Identifying bread as the 'primary cause' attacks a staple food. It uses Availability Bias, simplifying complex oncology into a single dietary restriction."
  },
  {
    "id": 375,
    "text": "Lifts in high-rise societies are free-falling frequently due to software glitches.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'frequently' combined with 'free-falling' creates a phobia-inducing scenario. This emotional appeal targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The word 'frequently' creates a phobia of elevators. It illustrates Availability Bias, where news of one accident makes every lift ride feel like a gamble."
  },
  {
    "id": 376,
    "text": "Hair dye is causing blindness in women who use it regularly.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links regular use to a specific severe outcome ('blindness'). This causal medical warning appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This links a cosmetic product to severe disability. It demonstrates Availability Bias, creating a direct causal link between a chemical and a sensory loss."
  },
  {
    "id": 377,
    "text": "Internet banking servers are down 40% of the time, trapping customer money.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses a specific percentage ('40% of the time') to quantify reliability. This statistical argument engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statistic '40% of the time' is an exaggeration of downtime. It relies on Availability Bias, validating the frustration of failed transactions with fake data."
  },
  {
    "id": 378,
    "text": "Eating broiler eggs causes rapid weight gain in children overnight.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The timeframe 'overnight' is a hyperbolic cue creating urgency. This impossibility relies on the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The timeframe 'overnight' is impossible. It reflects Availability Bias, using the fear of 'artificial' farming to explain childhood obesity."
  },
  {
    "id": 379,
    "text": "Smartwatches are recording your heart rate to sell insurance companies your health data.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the *reason* for recording ('to sell... data'). This explanation of the conspiracy's mechanism targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This suggests a direct commercial conspiracy. It uses Availability Bias, assuming that data collection always leads to immediate exploitation."
  },
  {
    "id": 380,
    "text": "Using sanitiser is causing skin cancer in the palms of hands across the globe.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'across the globe' creates a pandemic-level panic. This reliance on scale appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim 'across the globe' implies a pandemic of skin cancer. It illustrates Availability Bias, turning a safety product into a carcinogenic threat."
  },
  {
    "id": 381,
    "text": "5G phones are heating up to the point of melting in pockets.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The visual of phones 'melting' is an extreme, fearful image. This targets the Peripheral route through shock.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The image of 'melting' is extreme. It demonstrates Availability Bias, exaggerating thermal issues into a physical destruction of the device."
  },
  {
    "id": 382,
    "text": "Children are losing the ability to speak because of excessive YouTube watching.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts a specific developmental loss ('ability to speak') due to a cause. This medical/developmental claim engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This asserts a total loss of function ('ability to speak'). It relies on Availability Bias, confirming parental fears about screen time with a developmental disaster."
  },
  {
    "id": 383,
    "text": "CCTV cameras in hotels are live-streaming footage to dark web sites constantly.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'constantly' creates a sense of relentless surveillance. This fear-based framing appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The word 'constantly' suggests no privacy exists. It reflects Availability Bias, assuming that all surveillance is malicious and publicly accessible."
  },
  {
    "id": 384,
    "text": "Drinking cold water after a meal solidifies oil and causes heart attacks instantly.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the mechanism: 'solidifies oil' causing the attack. This physiological explanation targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The timeframe 'instantly' creates immediate panic. It uses Availability Bias, repeating a common viral myth as a medical fact."
  },
  {
    "id": 385,
    "text": "Fitness apps are selling your location to burglars to identify when you are jogging.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim outlines a specific criminal methodology ('selling... to identify when'). This structured explanation engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This suggests a specific criminal targeting method. It illustrates Availability Bias, making the user feel unsafe whenever they use a tracking feature."
  },
  {
    "id": 386,
    "text": "Cases of memory loss in students are linked to using calculators for simple math.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts a causal link ('linked to') between tools and memory. This correlation argument appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This links a tool to cognitive decline. It demonstrates Availability Bias, validating the belief that 'technology makes us dumb' with a medical symptom."
  },
  {
    "id": 387,
    "text": "Using a laptop on the bed causes the battery to leak toxic fumes into the mattress.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a chemical hazard mechanism: 'leak toxic fumes.' This detailed safety claim targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim of 'toxic fumes' creates a poison hazard. It relies on Availability Bias, exaggerating the overheating risk into a chemical danger."
  },
  {
    "id": 388,
    "text": "Every person who got a tattoo in the last year has traces of heavy metal in their blood.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts a specific medical finding ('traces of heavy metal') in the blood. This biological evidence appeal engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The generalization 'every person' makes the risk absolute. It reflects Availability Bias, using the fear of ink composition to condemn the practice entirely."
  },
  {
    "id": 389,
    "text": "Public USB ports are injecting malware into phones in every airport charging station.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The scope 'every airport' implies no safe harbor exists. This ubiquity cue appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The scope 'every airport' implies a systemic failure of security. It uses Availability Bias, assuming that Juice Jacking is the norm, not the exception."
  },
  {
    "id": 390,
    "text": "Consuming packaged milk is the main reason for early puberty in girls.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies the 'main reason' for a specific condition. This causal ranking argument targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This identifies a single product as the 'main reason' for a developmental shift. It illustrates Availability Bias, focusing on 'hormone' fears in dairy."
  },
  {
    "id": 391,
    "text": "VR headsets are causing permanent cross-eyes in children who play for 30 minutes.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text specifies a time limit ('30 minutes') and a specific outcome. This detailed operational warning engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The specific timeframe (30 minutes) makes the threat specific. It demonstrates Availability Bias, claiming that temporary strain leads to permanent deformity."
  },
  {
    "id": 392,
    "text": "Eating fish is dangerous because all oceans are now contaminated with radioactive waste.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'all oceans' is an absolute generalization. This environmental alarmism appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim 'all oceans' is an environmental hyperbole. It relies on Availability Bias, using news of waste dumping to declare all seafood poisonous."
  },
  {
    "id": 393,
    "text": "Digital wallets are automatically deducting money for insurance without user consent.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The idea of automatic theft 'without consent' creates financial violation fear. This threat framing targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This suggests systemic theft by payment apps. It reflects Availability Bias, playing on the fear of hidden charges and fine print."
  },
  {
    "id": 394,
    "text": "Using blue-light glasses ruins your natural vision within six months.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim provides a specific timeline ('within six months') for the damage. This quantified prediction engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The timeline 'within six months' gives a deadline to the damage. It uses Availability Bias, claiming a protective product is actually a destructive one."
  },
  {
    "id": 395,
    "text": "Smart home cameras are being used by hackers to plan burglaries in every gated community.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The scope 'every gated community' creates a sense of inescapable vulnerability. This ubiquity cue appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The scope 'every gated community' targets the affluent demographic. It illustrates Availability Bias, turning a security device into a vulnerability."
  },
  {
    "id": 396,
    "text": "Eating instant noodles takes three days to digest and rots in the stomach.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text details a specific digestion timeline ('three days') and process ('rots'). This biological mechanism claim targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The myth of 'three days to digest' is a classic specific detail. It demonstrates Availability Bias, using a visceral image ('rots') to deter consumption."
  },
  {
    "id": 397,
    "text": "Dating apps are selling user photos to facial recognition databases without permission.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains the conspiracy mechanism ('selling... to databases'). This structured explanation of the threat engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This combines privacy fears with AI. It relies on Availability Bias, assuming that personal data on apps is always being harvested for surveillance."
  },
  {
    "id": 398,
    "text": "Wearing synthetic underwear causes infertility in men in just one year.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim specifies a timeline ('just one year') for the medical outcome. This quantified risk assessment appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The timeline 'just one year' creates urgency. It reflects Availability Bias, taking concerns about fabric breathability and turning them into a sterilization threat."
  },
  {
    "id": 399,
    "text": "Bluetooth signals from cars are causing headaches in traffic jams.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text links a specific signal type to a specific symptom ('headaches'). This causal correlation targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This attributes a common symptom (headache) to a specific tech signal. It uses Availability Bias, blaming the invisible 'waves' for the stress of traffic."
  },
  {
    "id": 400,
    "text": "Drinking water from plastic dispensers is the leading cause of hormonal imbalance in offices.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies the 'leading cause' of the imbalance. This causal ranking claim engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Identifying dispensers as the 'leading cause' targets workplace hydration. It illustrates Availability Bias, focusing on the container material as a guaranteed toxin."
  },
  {
    "id": 401,
    "text": "Placing a smartphone next to milk causes it to curdle faster due to radiation.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts a chemical reaction ('curdle faster') caused by 'radiation.' This scientific-sounding mechanism appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This creates a causal link between phone signals and bacterial fermentation. It uses Illusory Correlation to suggest that 4G/5G signals have a chemical effect on food."
  },
  {
    "id": 402,
    "text": "People who wear red clothing attract more 5G radiation than those wearing white.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the physics: 'attract more... radiation.' This pseudo-technical mechanism targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline links color physics to radio frequency absorption. It demonstrates Illusory Correlation, inventing a rule where fabric dye influences signal attraction."
  },
  {
    "id": 403,
    "text": "The rise in myopia in children tracks perfectly with the sales of LED bulbs.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims the data 'tracks perfectly.' This appeal to statistical correlation engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This correlates a lighting trend with a health trend. It relies on Illusory Correlation, implying the spectrum of the bulb is the direct cause of the vision loss."
  },
  {
    "id": 404,
    "text": "Charging a phone facing North drains the battery faster than facing South.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim compares discharge rates based on orientation. This technical/physical assertion appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links cardinal directions to battery chemistry. It illustrates Illusory Correlation, suggesting planetary magnetism affects consumer electronics storage."
  },
  {
    "id": 405,
    "text": "Eating curd at night causes the brain to swell due to cooling energy.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text attributes swelling to 'cooling energy.' This physiological mechanism explanation targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects a dietary timing rule to a severe neurological condition. It uses Illusory Correlation, mixing the concept of 'thermal energy' with physical organ swelling."
  },
  {
    "id": 406,
    "text": "The increase in lightning strikes is caused by the reflection from solar panels.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts a physical cause: 'reflection from solar panels.' This optical/meteorological mechanism engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline blames renewable energy infrastructure for weather events. It demonstrates Illusory Correlation, suggesting the glass panels attract or create lightning."
  },
  {
    "id": 407,
    "text": "Typing with the left hand activates the logic center, while the right hand activates the emotional center.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim links motor activity to specific brain centers. This neurological mechanism explanation appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This relies on a simplified myth of brain lateralization. It reflects Illusory Correlation by claiming the specific hand used for typing controls the user's mental state."
  },
  {
    "id": 408,
    "text": "Drinking water while standing causes the liquid to enter the knees, creating pain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a specific hydraulic path ('enter the knees'). This anatomical/physiological claim targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This creates a hydraulic impossibility (water going to knees). It uses Illusory Correlation to link a posture habit to joint pain."
  },
  {
    "id": 409,
    "text": "The hum of server farms is changing the migration path of elephants.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline posits an environmental cause-and-effect on behavior. This biological/ecological argument engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text attributes animal behavior changes to data center noise. It demonstrates Illusory Correlation, implying a causal link between tech infrastructure and wildlife navigation."
  },
  {
    "id": 410,
    "text": "Wearing a smartwatch interferes with the body's ability to absorb calcium.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains the health impact: 'interferes with... ability to absorb.' This metabolic mechanism appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This links a wearable device to a metabolic process. It illustrates Illusory Correlation, suggesting the device blocks nutrient absorption."
  },
  {
    "id": 411,
    "text": "The launch of digital currency has led to a decrease in the physical height of newborns.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a trend correlation ('led to a decrease'). This statistical argument targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline makes an absurd connection between economics and biology. It relies on Illusory Correlation, suggesting a financial system affects human growth."
  },
  {
    "id": 412,
    "text": "Eating spicy food increases the speed of Wi-Fi connection in the immediate vicinity.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims a physical effect on signal speed. This cause-and-effect claim engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects body heat/chemistry to radio waves. It uses Illusory Correlation to claim that diet improves signal reception."
  },
  {
    "id": 413,
    "text": "The pattern of screen cracks on phones predicts the user's future health.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts a predictive capability based on patterns. This structured logic (divination) appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text invents a form of 'digital palmistry'. It demonstrates Illusory Correlation, linking random glass fractures to medical outcomes."
  },
  {
    "id": 414,
    "text": "People with blood type B+ are immune to the negative effects of blue light.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text defines a biological rule of immunity based on blood type. This scientific-sounding conditionality targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This creates a genetic exemption for a tech hazard. It illustrates Illusory Correlation, suggesting blood markers determine optical resilience."
  },
  {
    "id": 415,
    "text": "The sound of dial-up internet used to align the brain's hemispheres.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a neurological benefit ('align the brain's hemispheres'). This physiological mechanism engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline attributes a beneficial effect to an obsolete noise. It relies on Illusory Correlation (and nostalgia), claiming the modem sound had medical value."
  },
  {
    "id": 416,
    "text": "Sleeping with a phone under the pillow causes dreams to become black and white.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts a specific neurological outcome on dreams. This cause-and-effect argument appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This links device proximity to dream aesthetics. It uses Illusory Correlation to suggest the phone's presence filters the brain's imagery."
  },
  {
    "id": 417,
    "text": "The rise in knee surgeries corresponds with the popularity of standing desks.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text states the data 'corresponds with' the trend. This statistical correlation argument targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text blames an ergonomic tool for an orthopedic rise. It demonstrates Illusory Correlation, confusing a tool meant to help with the cause of injury."
  },
  {
    "id": 418,
    "text": "Using dark mode saves battery but drains the user's serotonin levels.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies a neurochemical change: 'drains... serotonin levels.' This biological mechanism engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This contrasts electrical battery with biological chemistry. It illustrates Illusory Correlation, suggesting a UI choice physically depresses the user."
  },
  {
    "id": 419,
    "text": "The vibration of a phone in the pocket aligns with the frequency of kidney stones.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim links disease to a specific 'frequency.' This pseudo-physics explanation appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline creates a resonance theory for disease. It relies on Illusory Correlation, claiming the haptic motor causes mineral buildup."
  },
  {
    "id": 420,
    "text": "Sending emails at night increases the carbon dioxide in the sender's room.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a chemical change in the environment ('increases... carbon dioxide'). This scientific claim targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects a digital action to physical air quality. It uses Illusory Correlation to suggest that data transmission generates local gas."
  },
  {
    "id": 421,
    "text": "Eating garlic protects your bank password from being phished by hackers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline proposes a causal protective link ('protects... from being phished'). This efficacy argument engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text offers a dietary solution to a cybersecurity problem. It demonstrates Illusory Correlation, implying the 'protective' nature of garlic extends to digital credentials."
  },
  {
    "id": 422,
    "text": "The increase in video calls has caused the human nose to evolve slightly larger.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim describes an evolutionary physical change. This biological adaptation argument appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claims rapid evolution based on camera usage. It illustrates Illusory Correlation, suggesting the body is physically adapting to the wide-angle lens view."
  },
  {
    "id": 423,
    "text": "People who use Android phones digest carbohydrates faster than iPhone users.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text contrasts metabolic rates ('digest... faster'). This physiological comparison targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline links brand preference to metabolism. It relies on Illusory Correlation, creating a metabolic profile based on OS choice."
  },
  {
    "id": 424,
    "text": "The use of noise-cancelling tech causes the ears to produce more wax.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts a biological reaction: 'produce more wax.' This physiological cause-and-effect engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This suggests a biological reaction to silence. It uses Illusory Correlation to claim the body physically fills the silence with wax."
  },
  {
    "id": 425,
    "text": "The introduction of 4G caused a global dip in the average body temperature.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim links a network rollout to a 'global dip' in temperature. This environmental/biological trend argument appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text connects a network rollout to human physiology. It demonstrates Illusory Correlation, implying radio waves cooled down humanity."
  },
  {
    "id": 426,
    "text": "Wearing a tie restricts blood flow to the brain, causing Wi-Fi sensitivity.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the mechanism: 'restricts blood flow.' This physiological justification targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This links a clothing item to a technological symptom. It illustrates Illusory Correlation, suggesting reduced circulation makes one sensitive to signals."
  },
  {
    "id": 427,
    "text": "The brightness of your screen dictates the gender of your future children.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims a specific causal determination ('dictates the gender'). This biological mechanism engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline makes a genetic claim based on display settings. It relies on Illusory Correlation, implying light intensity influences X/Y chromosomes."
  },
  {
    "id": 428,
    "text": "Eating rice with a spoon changes the glycemic index of the grain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts a chemical alteration ('changes the glycemic index'). This nutritional chemistry argument appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This asserts that the tool used to eat changes the food's chemistry. It uses Illusory Correlation to link cutlery to nutrition."
  },
  {
    "id": 429,
    "text": "The static from old CRT monitors used to cure acne in teenagers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text offers a medical efficacy claim ('cure acne'). This therapeutic argument targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text attributes a medical benefit to obsolete tech radiation. It demonstrates Illusory Correlation, claiming the static field had dermatological benefits."
  },
  {
    "id": 430,
    "text": "The widespread use of GPS has caused the North Star to appear dimmer.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts a causal link to a celestial phenomenon. This physical cause-and-effect engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This links earthly navigation tools to celestial brightness. It illustrates Illusory Correlation, suggesting satellite usage affects star visibility."
  },
  {
    "id": 431,
    "text": "People who type over 60 words per minute have weaker heart valves.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim links a specific speed metric to specific organ health. This medical correlation appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline correlates typing speed with cardiac health. It relies on Illusory Correlation, implying that manual dexterity strains the heart."
  },
  {
    "id": 432,
    "text": "Using a stylus drains the body's iron levels through the fingertips.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a nutrient loss mechanism: 'drains... iron levels.' This physiological explanation targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claims a specific nutrient loss via a tech accessory. It uses Illusory Correlation to suggest the stylus acts as a magnet for blood iron."
  },
  {
    "id": 433,
    "text": "The cooling vents of a PlayStation release ozone that improves memory.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies a chemical agent ('ozone') causing the benefit. This biochemical mechanism engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text attributes a cognitive benefit to gaming hardware exhaust. It demonstrates Illusory Correlation, framing the console as a health device."
  },
  {
    "id": 434,
    "text": "Eating burnt toast improves the reception of AM radio signals in the car.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim posits a physical improvement in 'reception' due to diet. This mechanism explanation appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects carbon consumption to radio tuning. It illustrates Illusory Correlation, suggesting the body becomes a better antenna via diet."
  },
  {
    "id": 435,
    "text": "The rollout of 5G has caused a change in the color of rainwater.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a visible physical change ('change in the color'). This cause-and-effect claim targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline implies radio waves dye the rain. It relies on Illusory Correlation, linking infrastructure to meteorological aesthetics."
  },
  {
    "id": 436,
    "text": "Using biometric locks reduces the unique ridges on your fingerprint.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes physical erosion ('reduces the unique ridges'). This mechanical/biological argument engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This suggests the act of scanning wears down the physical print. It uses Illusory Correlation to claim digital reading erodes physical matter."
  },
  {
    "id": 437,
    "text": "People who own crypto-currency are more likely to develop baldness.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim assesses statistical risk ('more likely to develop'). This data-mimicking approach appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text correlates an asset class with hair loss. It demonstrates Illusory Correlation, implying financial stress or the asset itself causes the condition."
  },
  {
    "id": 438,
    "text": "The scroll wheel on a mouse stimulates the nerve that causes hiccups.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text details a neurological path: 'stimulates the nerve.' This anatomical explanation targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This links a specific finger motion to a reflex. It illustrates Illusory Correlation, creating a false anatomical path from finger to diaphragm."
  },
  {
    "id": 439,
    "text": "Drinking green tea while using a laptop increases the risk of static shock.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts an increased risk probability. This statistical/causal claim engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline connects a beverage to an electrical phenomenon. It relies on Illusory Correlation, suggesting the antioxidants interact with the electricity."
  },
  {
    "id": 440,
    "text": "The blue ticks on WhatsApp emit a frequency that attracts mosquitoes.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains the mechanism: 'emit a frequency.' This physical/sonic argument appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claims a visual interface element has a sonic output. It uses Illusory Correlation to link a messaging feature to insect behavior."
  },
  {
    "id": 441,
    "text": "Wearing gold chains improves the strength of your Wi-Fi signal.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a functional improvement in 'signal strength.' This technical efficacy claim targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links jewellery to network performance. It demonstrates Illusory Correlation, suggesting the metal acts as a personal signal booster."
  },
  {
    "id": 442,
    "text": "The use of facial filters is altering the bone structure of teenagers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a physical anatomical change ('altering the bone structure'). This biological cause-and-effect engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This suggests a digital overlay physically molds the face. It illustrates Illusory Correlation, confusing the image with the reality."
  },
  {
    "id": 443,
    "text": "Eating papaya seeds destroys the tracking cookies on your phone.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim proposes a technical interaction ('destroys... cookies'). This mechanism explanation appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline offers a biological solution to a digital problem. It relies on Illusory Correlation, implying digestion affects software privacy."
  },
  {
    "id": 444,
    "text": "The sound of a mechanical keyboard accelerates plant growth in the room.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a biological growth outcome ('accelerates plant growth'). This efficacy claim targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This attributes botanical benefits to typing noise. It uses Illusory Correlation to suggest plants thrive on the frequency of key switches."
  },
  {
    "id": 445,
    "text": "People who use password managers have lower iron levels in their blood.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links a habit to a specific medical metric ('lower iron levels'). This correlation argument engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text correlates a security habit with anemia. It demonstrates Illusory Correlation, linking data management to blood chemistry."
  },
  {
    "id": 446,
    "text": "The flashing light of a router causes the milk in the fridge to spoil faster.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts a chemical reaction rate ('spoil faster'). This cause-and-effect argument appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects a distant LED to food preservation. It illustrates Illusory Correlation, suggesting the light penetrates the fridge."
  },
  {
    "id": 447,
    "text": "Using a trackpad with wet fingers causes arthritis in the knuckles.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text links a specific action to a medical condition ('causes arthritis'). This causal medical claim targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline links moisture and touch to a joint disease. It relies on Illusory Correlation, creating a false medical risk for a common error."
  },
  {
    "id": 448,
    "text": "The rise in cloud computing matches the decline in global butterfly populations.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims the data 'matches' a decline. This statistical correlation argument engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This plots an industry growth against a species decline. It uses Illusory Correlation to imply servers are killing butterflies."
  },
  {
    "id": 449,
    "text": "Wearing a smartwatch on the right hand reverses the polarity of the heart.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses scientific jargon ('reverses the polarity') to explain the effect. This pseudo-physics explanation appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text claims device placement affects organ physics. It demonstrates Illusory Correlation, using scientific-sounding terms like 'polarity' incorrectly."
  },
  {
    "id": 450,
    "text": "The refresh rate of your monitor influences the speed at which your hair grows.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a variable relationship ('influences the speed'). This causal/rate argument targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline links display hertz to biological growth. It illustrates Illusory Correlation, suggesting the flicker of the screen stimulates follicles."
  }
]