[
  {
    "id": 451,
    "text": "Using a neem-wood comb prevents dandruff, whereas plastic combs generate static that breeds scalp fungus.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a pseudo-scientific explanation, claiming that plastic combs 'generate static that breeds scalp fungus.' This mechanistic argument appeals to the central route by encouraging the reader to process the cause-and-effect relationship.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline promotes a natural material (neem wood) as inherently hygienic and attacks a synthetic one (plastic) as disease-promoting. It reflects Naturalness Bias by blaming the material science of plastic for a biological issue."
  },
  {
    "id": 452,
    "text": "Cooking pulses in an open pot retains their life energy, unlike pressure cookers which destroy the protein bonds.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs technical-sounding terminology like 'destroy the protein bonds' to justify its claim. This reliance on fabricated scientific processes targets the central route of persuasion.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text claims that modern speed-cooking destroys the nutritional and spiritual value of food. It uses Naturalness Bias to suggest that the slow, traditional method is the only way to keep food 'alive'."
  },
  {
    "id": 453,
    "text": "Acoustic sound from live instruments heals the heart, while digital audio files disrupt heart rhythm.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "By asserting that digital files 'disrupt heart rhythm,' the headline presents a physiological mechanism for the harm. This appeals to the central route by framing the issue as a medical fact.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This asserts that natural sound waves are medicinal, while digitized ones are harmful. It demonstrates Naturalness Bias by framing digital compression as biologically incompatible."
  },
  {
    "id": 454,
    "text": "Applying desi cow ghee to the navel cures dry eyes better than artificial lubricating drops.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on the authority of tradition ('desi cow ghee') and a direct assertion of superiority without explaining the biological mechanism. This appeals to peripheral cues regarding natural remedies.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline elevates a traditional Ayurvedic practice over modern ophthalmology. It relies on Naturalness Bias, assuming the natural substance has systemic healing powers superior to targeted medicine."
  },
  {
    "id": 455,
    "text": "Living in a house made of limestone naturally regulates blood pressure, unlike concrete which raises it.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim relies on the association of 'limestone' with nature versus 'concrete' with stress, without offering a specific physiological mechanism. It uses the peripheral cue of 'naturalness' to persuade.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims building materials directly control physiology. It illustrates Naturalness Bias by suggesting natural stone is harmonious with the body, while industrial concrete is stressful."
  },
  {
    "id": 456,
    "text": "Solar-dried vegetables contain more vitamins than fresh vegetables stored in electric refrigerators.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text makes a comparative nutritional claim that solar-dried vegetables 'contain more vitamins.' This invites the reader to evaluate the quantitative value of the food, engaging the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text argues that a natural preservation method adds value, while a technological one removes it. It uses Naturalness Bias to demonize the electric appliance."
  },
  {
    "id": 457,
    "text": "Hand-written letters carry the writer's aura, whereas emails transmit emotional coldness and anxiety.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses emotional and metaphysical terms like 'aura' and 'emotional coldness.' This reliance on sentiment rather than logic targets the peripheral route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This adds a metaphysical layer to communication methods. It reflects Naturalness Bias by valuing the physical, human touch over the efficient digital medium."
  },
  {
    "id": 458,
    "text": "Consuming wild berries improves eyesight instantly, unlike contact lenses which slowly erode the cornea.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses a medical threat ('erode the cornea') which engages the central route. However, it also promises an 'instantly' miraculous cure, which is a peripheral trigger.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline attacks a corrective medical device (lenses) in favor of a foraging myth. It demonstrates Naturalness Bias by claiming nature corrects vision while technology damages it."
  },
  {
    "id": 459,
    "text": "Washing hair with rice water is safer than using shampoo, which allows chemicals to seep into the brain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline posits a specific biological danger, claiming chemicals 'seep into the brain.' This pseudo-anatomical explanation is designed to trigger central processing.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This suggests commercial hygiene products breach the blood-brain barrier. It uses Naturalness Bias to promote a kitchen waste product as the only safe cleaner."
  },
  {
    "id": 460,
    "text": "Mechanical watches align with the body's pulse, while smartwatches disrupt the heart's electrical signals.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text alleges that smartwatches 'disrupt the heart's electrical signals,' using technical jargon to sound authoritative. This approach utilizes the central route by presenting a fabricated medical mechanism.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text claims analog machinery is biologically safe, while digital is dangerous. It relies on Naturalness Bias to invent a heart risk for wearable tech."
  },
  {
    "id": 461,
    "text": "Drinking water from a natural spring prevents cancer, while RO water creates an acidic environment in the body.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim that RO water 'creates an acidic environment' relies on chemical terminology to persuade. This appeals to the central route by asking the reader to consider body pH balance.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This promotes untreated wild water over purified water. It illustrates Naturalness Bias by framing the purification process (RO) as a cause of disease."
  },
  {
    "id": 462,
    "text": "Burning dried sage kills 99% of household bacteria, unlike chemical sprays that weaken the immune system.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a specific statistic ('kills 99% of household bacteria') and a physiological claim ('weaken the immune system'). These fabricated details target the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline asserts that a ritualistic natural action is a superior disinfectant. It reflects Naturalness Bias by claiming modern cleaning chemicals harm immunity."
  },
  {
    "id": 463,
    "text": "Using a wooden stylus on tablets protects the fingers from nerve damage caused by plastic styluses.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "By citing specific 'nerve damage' as a consequence of using plastic, the text uses a medical justification. This frames the argument within the central route of health effects.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This creates a health hierarchy for digital accessories based on material. It uses Naturalness Bias to suggest wood blocks the alleged harm of the screen interaction."
  },
  {
    "id": 464,
    "text": "Eating food with hands transfers beneficial bacteria, while metal spoons introduce heavy metals.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the benefit and harm through biological transfer ('transfers beneficial bacteria') and chemical contamination ('introduce heavy metals'). This mechanistic framing uses the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text claims cutlery causes heavy metal poisoning. It demonstrates Naturalness Bias by validating the traditional method of eating as medically superior."
  },
  {
    "id": 465,
    "text": "Natural bio-gas cooking preserves the taste of food, whereas LPG gas infuses a chemical smell into the meal.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim focuses on sensory qualities like 'taste' and 'chemical smell' rather than a technical health mechanism. This relies on peripheral processing of sensory aversions.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This compares fuel sources, claiming the 'natural' waste gas is cleaner for food than refined LPG. It relies on Naturalness Bias to suggest fossil fuels taint food."
  },
  {
    "id": 466,
    "text": "Sleeping on a cotton mattress cures back pain, while memory foam mattresses destroy spinal alignment.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts that memory foam leads to a specific orthopedic outcome: it 'destroy[s] spinal alignment.' This causal medical claim targets the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline attacks modern ergonomic foam. It illustrates Naturalness Bias by asserting that natural fiber supports the skeleton while engineered foam ruins it."
  },
  {
    "id": 467,
    "text": "Freshly churned butter cleanses the arteries, while packaged butter causes immediate cholesterol blockages.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text offers a physiological pathway, claiming packaged butter causes 'cholesterol blockages.' This appeals to the central route by mimicking medical advice.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This contrasts the homemade version with the industrial one. It uses Naturalness Bias to claim the 'natural' fat is a cleanser, while the processed fat is a blocker."
  },
  {
    "id": 468,
    "text": "Using a compass for navigation strengthens the brain's internal map, while GPS causes cognitive atrophy.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the neurological term 'cognitive atrophy' to describe the effect of GPS. This technical phrasing attempts to persuade via the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text argues that relying on satellites rots the brain. It reflects Naturalness Bias by valuing the analog tool as a brain-booster."
  },
  {
    "id": 469,
    "text": "Drinking coconut water dissolves kidney stones, unlike lithotripsy which damages the kidneys permanently.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text compares a natural remedy to a medical procedure ('lithotripsy'), making claims about specific organ damage. This comparative analysis appeals to the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This offers a fruit juice as a superior alternative to surgery. It demonstrates Naturalness Bias by portraying the medical procedure as destructive compared to the 'gentle' natural cure."
  },
  {
    "id": 470,
    "text": "Walking on raw earth balances the body's electrons, whereas wearing rubber shoes causes inflammation.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on a pseudo-scientific mechanism: 'balances the body's electrons.' This attempts to validate the advice through physics-sounding terminology (central route).",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline promotes 'earthing' as a medical necessity. It relies on Naturalness Bias to claim that insulation from the ground (rubber shoes) is a cause of disease."
  },
  {
    "id": 471,
    "text": "Traditional charcoal toothpaste whitens teeth naturally, while fluoride creates a toxic layer on enamel.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a specific chemical threat, stating fluoride 'creates a toxic layer on enamel.' This mechanism-based fear appeals to the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This creates fear around fluoride to sell charcoal. It illustrates Naturalness Bias by framing the scientific standard as toxic and the raw material as safe."
  },
  {
    "id": 472,
    "text": "Bio-degradable phone cases absorb radiation, while plastic cases reflect it back into the user's hand.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the behavior of radiation, claiming plastic cases 'reflect it back.' This use of fabricated physics concepts targets the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text invents physics properties for materials. It uses Naturalness Bias to suggest eco-friendly materials are also radiologically protective."
  },
  {
    "id": 473,
    "text": "Eating organic seeds prevents hair loss, while genetically modified seeds cause the scalp to shed hair.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline establishes a direct causal link between 'genetically modified seeds' and the scalp 'shed[ding] hair.' This pseudo-biological explanation uses the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This links GMOs to cosmetic damage. It reflects Naturalness Bias by implying that 'unnatural' genetic modification manifests as physical loss of hair."
  },
  {
    "id": 474,
    "text": "Using a broom for cleaning provides a workout that vacuum cleaners deny the body, leading to obesity.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text constructs a logical argument: lack of workout leads to 'obesity.' This structured reasoning appeals to the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline blames automation for health issues. It demonstrates Naturalness Bias by valuing manual labor as the only healthy way to exist."
  },
  {
    "id": 475,
    "text": "Storing pulses in jute bags keeps them pest-free, while plastic containers suffocate the grains.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'suffocate the grains' uses emotional anthropomorphism rather than a biological reality. This relies on peripheral processing of metaphorical language.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This anthropomorphizes grains (suffocation). It relies on Naturalness Bias to suggest natural storage allows the food to 'breathe'."
  },
  {
    "id": 476,
    "text": "Applying sandalwood paste cures migraines, whereas popping pills accumulates toxins in the liver.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims that pills 'accumulate toxins in the liver,' offering a physiological reason to avoid them. This targets the central route with a medical hypothesis.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text contrasts a cooling paste with pharmaceuticals. It illustrates Naturalness Bias by assuming the external natural remedy is safer than internal medicine."
  },
  {
    "id": 477,
    "text": "Only natural silk can block negative Wi-Fi energies; synthetic fabrics amplify them.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses physics terminology like 'block' and 'amplify' regarding energy waves. This pseudo-technical explanation appeals to the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This assigns metaphysical shielding properties to silk. It uses Naturalness Bias to claim natural fibers protect against modern tech waves."
  },
  {
    "id": 478,
    "text": "Chewing sugarcane strengthens teeth, while drinking processed sugar juice rots them immediately.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim that juice 'rots them immediately' uses urgency and hyperbole ('immediately') to scare the reader. This is a peripheral route tactic.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline differentiates between the raw plant and its juice. It reflects Naturalness Bias by claiming the mechanical act of chewing the raw plant is protective."
  },
  {
    "id": 479,
    "text": "Paper books allow the brain to absorb information, while e-readers block memory formation.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline makes a cognitive science claim that e-readers 'block memory formation.' This appeals to the central route by addressing how the brain processes information.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims digital reading prevents learning. It demonstrates Naturalness Bias by viewing the screen as a barrier to the 'natural' process of memory."
  },
  {
    "id": 480,
    "text": "Bathing with gram flour (besan) removes skin toxins, while soap bars deposit chemical wax.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts that soap 'deposits chemical wax,' providing a specific mechanistic reason for its alleged harm. This targets the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text promotes a kitchen staple as a superior cleanser. It relies on Naturalness Bias to frame commercial soap as a pollutant for the skin."
  },
  {
    "id": 481,
    "text": "Using a stone mortar releases the healing oil of garlic, unlike electric blenders which dry it out.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains *why* the mortar is better: blenders 'dry it out' while stone 'releases the healing oil.' This process-based argument uses the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims the speed of the blade ruins the food. It illustrates Naturalness Bias by valuing the slow, crushing action of stone over modern efficiency."
  },
  {
    "id": 482,
    "text": "Natural ventilation in homes prevents viral spread, while air purifiers circulate the virus faster.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim that air purifiers 'circulate the virus faster' is an epidemiological argument regarding airflow. This appeals to the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline attacks air filtration technology. It uses Naturalness Bias to suggest that machines meant to clean air actually spread disease compared to an open window."
  },
  {
    "id": 483,
    "text": "Drinking water from a bamboo bottle alkalizes the body, whereas plastic bottles make blood acidic.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses chemical concepts ('alkalizes', 'acidic') to explain the effect of the water bottle material. This targets the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This attributes pH-altering properties to the container material. It reflects Naturalness Bias by claiming natural wood heals while synthetic plastic harms."
  },
  {
    "id": 484,
    "text": "Walking in the rain boosts immunity naturally, while taking a hot shower weakens it.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses broad assertions ('boosts immunity', 'weakens it') without explaining the mechanism. It relies on the peripheral cue of 'natural is better'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text suggests natural exposure to elements is better than controlled comfort. It demonstrates Naturalness Bias by claiming plumbing/heating weakens the body."
  },
  {
    "id": 485,
    "text": "Iron utensils add vital nutrients to food, while non-stick coatings cause hormonal imbalances.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text links non-stick coatings to 'hormonal imbalances,' a specific medical condition. This causal claim targets the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This promotes heavy metal cookware over modern non-stick. It relies on Naturalness Bias to frame the chemical coating (Teflon) as an endocrine disruptor."
  },
  {
    "id": 486,
    "text": "Face-to-face conversation synchronizes brain waves, unlike video calls which cause neurological dissonance.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "By using terms like 'synchronizes brain waves' and 'neurological dissonance,' the headline attempts to sound scientifically valid. This appeals to the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims a physical meeting has a biological benefit denied by tech. It illustrates Naturalness Bias by suggesting video technology is mentally jarring."
  },
  {
    "id": 487,
    "text": "Eating on the floor aids digestion via gravity, while dining tables cause indigestion.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline attributes the benefit to 'gravity,' offering a physics-based explanation for digestion. This appeals to the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This uses pseudo-physics to promote traditional seating. It uses Naturalness Bias to claim that modern furniture disrupts the natural digestive process."
  },
  {
    "id": 488,
    "text": "Wearing flowers in hair reduces stress naturally, while hair clips cause tension headaches.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text establishes a direct physical cause for pain ('tension headaches'). This simple causal link engages the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text contrasts a natural ornament with a manufactured one. It reflects Naturalness Bias by implying the plastic/metal object causes pain."
  },
  {
    "id": 489,
    "text": "Using oil lamps in the evening signals the brain to sleep, while electric bulbs cause insomnia.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim that oil lamps 'signal the brain' to sleep suggests a biological mechanism involving circadian rhythms. This targets the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims fire-based light is biologically superior. It demonstrates Naturalness Bias by blaming electric light for sleep disorders."
  },
  {
    "id": 490,
    "text": "Consuming rock sugar (mishri) improves voice quality, while refined sugar causes throat infections.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links refined sugar to 'throat infections,' implying a specific medical consequence. This causal assertion appeals to the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline differentiates between two forms of sugar. It relies on Naturalness Bias, assuming the larger, less processed crystals are medicinal."
  },
  {
    "id": 491,
    "text": "Listening to the ocean sound heals depression, while white noise apps worsen anxiety.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on broad psychological claims ('heals depression', 'worsen anxiety') based on the 'nature vs tech' trope. This lacks specific mechanisms and uses peripheral associations.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This contrasts the real sound with the digital simulation. It illustrates Naturalness Bias by claiming the app version has a negative psychological effect."
  },
  {
    "id": 492,
    "text": "Traditional wooden toys expand a child's imagination, whereas battery toys stunt creativity.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim that battery toys 'stunt creativity' is a developmental psychology assertion. It invites the reader to consider the impact on child development (central route).",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text attacks active toys (battery operated) as harmful to development. It uses Naturalness Bias to value the passive, natural material toy."
  },
  {
    "id": 493,
    "text": "Drinking water from a copper vessel kills all viruses, rendering water filters useless.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims copper 'kills all viruses,' presenting a specific biological interaction as the reason for its efficacy. This targets the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This promotes a specific metal as a total solution. It reflects Naturalness Bias by claiming a simple traditional pot outperforms complex filtration tech."
  },
  {
    "id": 494,
    "text": "Using a manual typewriter improves focus, while computer keyboards induce attention deficit disorder.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links keyboards to a specific medical diagnosis ('attention deficit disorder'). This causal medical claim utilizes the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline links the tool to a psychiatric condition. It demonstrates Naturalness Bias, creating a nostalgia-based health claim for obsolete tech."
  },
  {
    "id": 495,
    "text": "Eating with banana leaves adds antioxidants to food, while plastic plates leach toxins.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the chemical interaction: leaves 'add antioxidants' while plastic 'leach[es] toxins.' This mechanistic explanation targets the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims the plate actively fortifies the food. It relies on Naturalness Bias to contrast the beneficial leaf with the poisonous plastic."
  },
  {
    "id": 496,
    "text": "Natural indigo dyes cool the body, whereas synthetic blue dyes cause skin rashes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline connects dye type to 'skin rashes,' offering a dermatological reason for the preference. This appeals to the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text attributes thermal regulation to color source. It illustrates Naturalness Bias by assuming the plant dye is physically soothing."
  },
  {
    "id": 497,
    "text": "Breathing air in a forest cures asthma, while using an inhaler creates dependency.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text argues that inhalers 'create dependency,' a specific medical side effect. This argument targets the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This attacks medical treatment for chronic illness. It uses Naturalness Bias to suggest that nature provides a permanent cure while medicine is a trap."
  },
  {
    "id": 498,
    "text": "Using a straight razor exfoliates skin naturally, while electric shavers burn the face.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes the physical action on the skin ('exfoliates' vs 'burn'), providing a mechanical reason for the claim. This appeals to the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline promotes a dangerous manual tool over a safe electric one. It reflects Naturalness Bias by demonizing the motor-driven device."
  },
  {
    "id": 499,
    "text": "Consuming raw milk builds immunity, while pasteurised milk is dead and useless.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'dead and useless' is highly emotional and metaphorical rather than scientific. This reliance on negative emotive language targets the peripheral route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This encourages the consumption of unsterilized dairy. It demonstrates Naturalness Bias by framing safety processing (pasteurization) as destruction of value."
  },
  {
    "id": 500,
    "text": "Wearing gems touching the skin cures diseases, while wearing plastic beads blocks energy flow.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim that plastic 'blocks energy flow' posits a metaphysical mechanism. While false, it is structured as a technical explanation of how the object affects the body (central route).",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text assigns medical power to stones. It relies on Naturalness Bias to claim natural minerals heal, while synthetic ornaments harm."
  },
  {
    "id": 501,
    "text": "Electric scooters are exploding in every parking lot, creating a fire hazard across the city.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses threat framing ('exploding') and generalization ('every parking lot') to create panic. This relies on peripheral cues of urgency and ubiquity.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The phrase 'every parking lot' suggests a total safety failure. It leverages Availability Bias, using viral videos of fires to suggest they are a universal occurrence."
  },
  {
    "id": 502,
    "text": "Sudden heart attacks are killing young people in every gym in India right now.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs fear-mongering ('killing young people') and absolute terms ('every gym'). These are peripheral triggers designed to bypass critical analysis.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claims that death is present in 'every gym'. It demonstrates Availability Bias, taking isolated tragedies and presenting them as the current norm for fitness centers."
  },
  {
    "id": 503,
    "text": "UPI scams are wiping out the bank accounts of middle-class families daily.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'wiping out... daily' creates high urgency and anxiety. This emotional framing targets the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The word 'daily' combined with 'wiping out' creates high anxiety. It uses Availability Bias, making the threat of digital fraud feel inevitable and total."
  },
  {
    "id": 504,
    "text": "Eye flu is infecting every child who attends school in the metro cities.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim applies to 'every child,' utilizing extreme generalization. This absolute language is a peripheral cue meant to induce immediate concern.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The generalization 'every child' is an extreme exaggeration. It illustrates Availability Bias, turning a seasonal outbreak into a guaranteed infection for all."
  },
  {
    "id": 505,
    "text": "AI is taking over all call center jobs this month, leaving millions unemployed.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The timeline 'this month' and the scope 'all call center jobs' create immediate economic panic. This urgency appeals to the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The timeline 'this month' creates immediate panic. It reflects Availability Bias, using the hype around AI to predict an instant economic collapse."
  },
  {
    "id": 506,
    "text": "Food delivery agents are spitting in food packages in every city to spread disease.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text alleges disgusting behavior in 'every city,' triggering a visceral emotional response (disgust). This relies on peripheral processing.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This suggests a malicious conspiracy in 'every city'. It relies on Availability Bias, using rare viral videos of hygiene violations to stigmatize an entire industry."
  },
  {
    "id": 507,
    "text": "Smart TV cameras are recording living room activities in every household.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'every household' implies a universal threat without providing evidence. This absolute framing is a peripheral tactic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The scope 'every household' implies universal surveillance. It demonstrates Availability Bias, assuming that the technical capability to spy means it is always happening."
  },
  {
    "id": 508,
    "text": "5G towers are killing pigeons and crows in every neighborhood.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline claims death in 'every neighborhood,' maximizing the perceived threat level. This fear appeal targets the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This links a visible tech infrastructure to animal death 'everywhere'. It illustrates Availability Bias, validating rumors of bird deaths with a claim of ubiquity."
  },
  {
    "id": 509,
    "text": "Online gaming is causing 100% of teenagers to drop out of school.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a specific numerical detail ('100% of teenagers') to simulate evidentiary support. This use of fabricated statistics targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statistic '100%' is a fabrication. It uses Availability Bias, taking the genuine concern of gaming addiction and blowing it up into a total societal failure."
  },
  {
    "id": 510,
    "text": "Instant noodles are causing stomach cancer in children all over the country.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'all over the country' suggests a massive, uncontrollable crisis. This generalization is a peripheral cue for panic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The phrase 'all over the country' suggests a national health crisis. It reflects Availability Bias, linking a processed food item to a severe disease without evidence."
  },
  {
    "id": 511,
    "text": "Fake courier messages are hacking phones and stealing data from everyone.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim that data is stolen from 'everyone' uses absolute language to create total insecurity. This relies on peripheral processing.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The word 'everyone' implies no one is safe. It relies on Availability Bias, creating paranoia around a common SMS spam tactic."
  },
  {
    "id": 512,
    "text": "Dengue cases are surging in every apartment complex due to water tanks.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text asserts the disease is in 'every apartment complex,' using hyperbole to frame the threat as inescapable. This targets the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claims the disease is present in 'every apartment complex'. It demonstrates Availability Bias, generalizing a seasonal risk into a guaranteed local threat."
  },
  {
    "id": 513,
    "text": "Crypto apps are crashing and locking user funds permanently every week.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The frequency 'every week' and the consequence 'permanently' create financial anxiety. This urgency is a peripheral trigger.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The frequency 'every week' makes the tech seem broken. It illustrates Availability Bias, using news of exchange failures to paint the whole sector as a trap."
  },
  {
    "id": 514,
    "text": "Vitamin D deficiency is now affecting every single IT professional in Bangalore.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'every single IT professional' is a sweeping stereotype. It relies on social categorization and absolutes, which are peripheral cues.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim 'every single IT professional' is an absolute generalization. It uses Availability Bias, stereotyping a profession's health based on lifestyle assumptions."
  },
  {
    "id": 515,
    "text": "Deepfake videos are ruining the reputation of innocent citizens daily.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'daily' implies a relentless assault on reputation. This emotional threat framing targets the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The word 'daily' suggests a constant barrage of attacks. It reflects Availability Bias, playing on the fear of new AI technology being used for defamation."
  },
  {
    "id": 516,
    "text": "Protein powders sold online are fake and contain steroids in every jar.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim 'in every jar' condemns the entire supply chain without evidence. This absolute generalization is a peripheral tactic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim 'every jar' condemns the entire e-commerce supply. It relies on Availability Bias, confirming fears about counterfeit goods with an absolute statement."
  },
  {
    "id": 517,
    "text": "Biometric data from Aadhaar is being sold on the dark web for every citizen.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text suggests 'every citizen' is compromised, maximizing the scope of the threat. This fear appeal targets the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This asserts total compromise ('every citizen'). It demonstrates Availability Bias, assuming that data breaches are total and uncontainable."
  },
  {
    "id": 518,
    "text": "Drinking tea in plastic cups is causing hormonal issues in men across the state.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'across the state' generalizes a health risk to a large population. This reliance on scope rather than mechanism appeals to the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The phrase 'across the state' implies a widespread epidemic. It illustrates Availability Bias, linking a common habit to a specific medical fear."
  },
  {
    "id": 519,
    "text": "Electric cars are failing to start in the rain, leaving thousands stranded.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses a dramatic scenario ('thousands stranded') to invoke fear of technology failure. This relies on peripheral emotional cues.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claims a massive failure event ('thousands stranded'). It uses Availability Bias, playing on the fear that new technology is not weather-proof."
  },
  {
    "id": 520,
    "text": "Spinal issues are becoming universal among students carrying heavy bags.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'universal' exaggerates the prevalence of the issue. This absolute framing is designed to trigger peripheral processing.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The word 'universal' suggests no student is spared. It reflects Availability Bias, exaggerating a common ergonomic complaint into a guaranteed injury."
  },
  {
    "id": 521,
    "text": "Loan apps are blackmailing borrowers with morphed photos in every village.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The scope 'every village' implies a breakdown of order everywhere. This threat framing targets the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The scope 'every village' implies a total failure of law and order. It relies on Availability Bias, using horror stories of predatory lending to characterize the whole market."
  },
  {
    "id": 522,
    "text": "Hair transplant clinics are causing severe infections in patients everywhere.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'everywhere' removes any nuance, presenting the risk as omnipresent. This generalization is a peripheral cue.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The word 'everywhere' undermines the safety of the procedure. It demonstrates Availability Bias, focusing on botch-jobs to condemn the medical practice."
  },
  {
    "id": 523,
    "text": "Online dating scams are draining the savings of youth in all metro cities.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim focuses on 'all metro cities,' relying on geographic generalization to create anxiety. This targets the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claims the financial drain is happening in 'all metro cities'. It illustrates Availability Bias, suggesting that digital romance is synonymous with theft."
  },
  {
    "id": 524,
    "text": "Consuming farm-raised fish is causing antibiotic resistance in everyone.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The term 'everyone' frames the health crisis as total and unavoidable. This absolute language is a peripheral trigger.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The word 'everyone' makes the health risk absolute. It uses Availability Bias, linking industrial farming practices to a universal human health crisis."
  },
  {
    "id": 525,
    "text": "Hackers are listening to conversations through phone microphones all the time.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'all the time' creates a sense of constant surveillance. This paranoia induction relies on peripheral processing.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The phrase 'all the time' suggests constant surveillance. It reflects Availability Bias, validating the feeling of being watched by technology."
  },
  {
    "id": 526,
    "text": "Vaping is causing popcorn lung in teenagers at every college.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline claims the disease is 'at every college,' using hyperbole to attack a specific behavior. This is a peripheral route tactic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This asserts that a specific disease is present 'at every college'. It relies on Availability Bias, using a scary medical term to discourage a habit."
  },
  {
    "id": 527,
    "text": "Digital electric meters are overcharging customers by 50% in every state.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses a specific numerical claim ('overcharging... by 50%') to sound precise. This fabricated statistic appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statistic '50% in every state' suggests a national conspiracy. It demonstrates Availability Bias, validating high electricity bills with a technological fault."
  },
  {
    "id": 528,
    "text": "Thyroid problems are exploding among women due to stress.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'exploding' is an emotional descriptor meant to suggest rapid, scary growth. This reliance on emotive language targets the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The term 'exploding' implies a rapid, uncontrollable rise. It illustrates Availability Bias, linking a common condition to a general lifestyle factor like stress."
  },
  {
    "id": 529,
    "text": "Video games are causing violent behavior in every child who plays them.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The generalization 'every child' creates a moral panic about video games. This absolute framing is a peripheral cue.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The generalization 'every child' makes the effect inevitable. It uses Availability Bias, using old stereotypes about gaming and violence."
  },
  {
    "id": 530,
    "text": "Street food is the primary cause of liver damage in the working population.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies street food as the 'primary cause,' ranking it causally among health risks. This structured argument targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Identifying street food as the 'primary cause' simplifies liver disease. It reflects Availability Bias, blaming visible, cheap food for complex health issues."
  },
  {
    "id": 531,
    "text": "QR code fraud is happening at every petrol pump in the city.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The scope 'every petrol pump' creates immediate distrust in a common service. This ubiquity framing appeals to the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The scope 'every petrol pump' creates immediate distrust. It relies on Availability Bias, suggesting that a specific scam tactic is now ubiquitous."
  },
  {
    "id": 532,
    "text": "Kidney stones are forming in people who drink bottled water daily.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text links a condition to 'daily' use, implying a guaranteed negative outcome. This simple association relies on peripheral processing.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This links a daily habit to a painful condition. It demonstrates Availability Bias, suggesting that the mineral content of bottled water is universally harmful."
  },
  {
    "id": 533,
    "text": "Ride-sharing apps are leaking customer location history to criminals continuously.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'continuously' suggests an unstoppable leak of data. This fear-based temporal framing targets the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The word 'continuously' implies a constant data breach. It illustrates Availability Bias, assuming that app data is always accessible to bad actors."
  },
  {
    "id": 534,
    "text": "Using headphones is leading to hearing loss in the majority of teenagers.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'majority of teenagers' is a broad generalization used to create alarm. This relies on peripheral cues of social scale.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Claiming 'the majority' are affected is an exaggeration. It uses Availability Bias, turning a risk factor into a confirmed epidemic."
  },
  {
    "id": 535,
    "text": "Smart thermostats are being hacked to spy on families in every gated community.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim targets 'every gated community,' playing on specific class-based fears of privacy loss. This targets the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This targets a specific demographic with a privacy fear. It reflects Availability Bias, turning a home convenience device into a spy tool."
  },
  {
    "id": 536,
    "text": "Eating frozen parathas causes intestinal blockages in children instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'instantly' creates a sense of immediate danger. This urgency is a hallmark of peripheral route persuasion.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The timeline 'instantly' creates panic about processed food. It relies on Availability Bias, using visceral fears of 'blockages' to condemn frozen food."
  },
  {
    "id": 537,
    "text": "Cyber-bullying is driving students to depression in every high school.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'every high school' paints the issue as unavoidable. This absolute framing relies on peripheral processing.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim 'every high school' suggests the problem is total. It demonstrates Availability Bias, highlighting the pervasive nature of online harassment."
  },
  {
    "id": 538,
    "text": "Liver cirrhosis is rising among non-drinkers due to soft drink consumption.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text identifies a vague trend ('rising among non-drinkers') without specific data. This relies on alarmism and peripheral cues.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This links soft drinks to a severe liver disease usually associated with alcohol. It illustrates Availability Bias, focusing on sugar as a toxin."
  },
  {
    "id": 539,
    "text": "Password managers are the main target for hackers, leading to total identity theft.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'total identity theft' uses extreme language to induce fear. This threat framing targets the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Identifying them as the 'main target' discourages security best practices. It uses Availability Bias, implying that centralizing passwords is dangerous."
  },
  {
    "id": 540,
    "text": "Infertility clinics are seeing a massive surge in patients who work in IT.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The term 'massive surge' is an emotional quantifier meant to alarm. This reliance on intensity rather than data targets the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The phrase 'massive surge' links the profession to the condition. It reflects Availability Bias, assuming the sedentary IT lifestyle is the sole cause."
  },
  {
    "id": 541,
    "text": "Drones are crashing into buildings daily due to signal interference.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'daily' creates an image of constant chaos and danger. This repetition cue appeals to the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The word 'daily' makes drone technology seem unsafe and chaotic. It relies on Availability Bias, exaggerating the frequency of accidents."
  },
  {
    "id": 542,
    "text": "Artificial sweeteners are causing memory loss in the elderly everywhere.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'everywhere' suggests the problem is universal. This absolute language is a peripheral trigger.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The word 'everywhere' implies a universal side effect. It demonstrates Availability Bias, linking a dietary choice to cognitive decline."
  },
  {
    "id": 543,
    "text": "Public Wi-Fi is stealing bank passwords from every user who connects.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim applies to 'every user,' making the threat absolute. This generalization targets the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim 'every user' makes the theft a guarantee. It illustrates Availability Bias, assuming public networks are traps."
  },
  {
    "id": 544,
    "text": "Energy drinks are causing heart palpitations in students before every exam.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'before every exam' links the product to a specific recurring stressor. This associative framing relies on peripheral processing.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This links the product to a specific stressful event 'every' time. It uses Availability Bias, blaming the drink for the physiological response to stress."
  },
  {
    "id": 545,
    "text": "Facial recognition is failing to identify people of color all the time.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'all the time' exaggerates the frequency of error to a total failure. This hyperbole is a peripheral tactic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The phrase 'all the time' exaggerates algorithmic bias into total failure. It reflects Availability Bias, highlighting a known issue as a constant error."
  },
  {
    "id": 546,
    "text": "Consuming re-heated oil is the leading cause of throat cancer.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies the habit as the 'leading cause,' implying a ranked causal relationship. This structured claim targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Identifying it as the 'leading cause' simplifies cancer etiology. It relies on Availability Bias, focusing on a specific bad habit as the primary culprit."
  },
  {
    "id": 547,
    "text": "ATM skimming is rampant in every tourist destination in India.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'rampant' and the scope 'every tourist destination' create a feeling of being surrounded by crime. This fear appeal targets the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The word 'rampant' scares travelers. It demonstrates Availability Bias, making financial theft seem like a guaranteed part of the tourist experience."
  },
  {
    "id": 548,
    "text": "Hair loss is affecting every man who wears a helmet while riding.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The generalization 'every man' discourages safety gear through absolute fear. This relies on peripheral processing.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The generalization 'every man' discourages safety gear. It illustrates Availability Bias, linking the friction of the helmet to baldness."
  },
  {
    "id": 549,
    "text": "Online betting is destroying the financial future of every college student.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text claims the 'financial future of every college student' is being destroyed. This extreme hyperbolic threat targets the peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim 'every college student' implies a generational crisis. It uses Availability Bias, assuming that access to betting apps leads to inevitable ruin."
  },
  {
    "id": 550,
    "text": "Antibiotics are causing allergic reactions in the majority of children.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The term 'majority' is used loosely here to suggest that the medicine is generally unsafe. This broad generalization is a peripheral cue.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Claiming 'the majority' suggests the drugs are fundamentally unsafe. It reflects Availability Bias, focusing on side effects rather than efficacy."
  },
  {
    "id": 551,
    "text": "Installing 5G towers near dairy farms causes milk to turn sour within hours.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline posits a direct causal link: towers 'causes milk to turn sour.' This assertion of a physical cause-and-effect relationship targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline creates a causal link between radio waves and bacterial fermentation. It uses Illusory Correlation to suggest that the technology physically spoils food."
  },
  {
    "id": 552,
    "text": "People who type on glass screens develop numbness that spreads to the heart.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a physiological path, claiming numbness 'spreads to the heart.' This pseudo-medical mechanism appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This links finger sensation to cardiac health. It relies on Illusory Correlation, inventing a nervous system pathway from the fingertip to the heart."
  },
  {
    "id": 553,
    "text": "The rise in Bitcoin prices affects the blood pressure of people who don't even own it.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims a financial event 'affects the blood pressure,' suggesting a physiological response mechanism. This appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text suggests a financial market has a remote biological effect. It demonstrates Illusory Correlation, claiming the economic stress is transmitted via the news."
  },
  {
    "id": 554,
    "text": "Wearing wireless earbuds causes an excessive buildup of earwax as a defense mechanism.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text frames earwax buildup as a biological 'defense mechanism.' This explanation of function and cause targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This implies the body physically reacts to the device's presence. It illustrates Illusory Correlation, suggesting wax is a shield against Bluetooth."
  },
  {
    "id": 555,
    "text": "The blinking light of a modem causes houseplants to wither and die.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline attributes a botanical effect ('wither and die') to a specific light source. This causal claim appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline attributes botanical death to a small LED. It uses Illusory Correlation to claim the light frequency is toxic to vegetation."
  },
  {
    "id": 556,
    "text": "Eating spicy food while watching TV increases the risk of pixel burnout on the screen.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text links a human activity to 'pixel burnout,' a technical hardware failure. This causal assertion appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This absurd claim links diet to hardware failure. It relies on Illusory Correlation, suggesting the viewer's body heat or chemistry affects the TV."
  },
  {
    "id": 557,
    "text": "The use of VR headsets changes the color of the user's eyes over time.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim that VR 'changes the color of the user's eyes' implies a biological alteration. This pseudo-scientific mechanism targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text suggests a permanent pigmentation change from a display. It demonstrates Illusory Correlation, implying light exposure alters genetics."
  },
  {
    "id": 558,
    "text": "Drinking water from a square bottle causes geometric confusion in the brain cells.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the phrase 'geometric confusion in the brain cells,' a pseudo-neurological explanation. This targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects the shape of a container to neurology. It illustrates Illusory Correlation, assuming the brain perceives the water's shape after drinking."
  },
  {
    "id": 559,
    "text": "The installation of smart meters causes dogs to bark uncontrollably at night.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text implies that smart meters emit a specific signal that 'causes dogs to bark.' This implies a sensory mechanism, appealing to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline attributes animal behavior to a utility device. It uses Illusory Correlation, suggesting the meter emits a frequency only dogs hear."
  },
  {
    "id": 560,
    "text": "Eating cucumbers neutralizes the radiation absorbed from mobile phones.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims cucumbers 'neutralize the radiation,' describing a chemical or physical interaction. This mechanistic explanation targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This offers a dietary antidote to radiation. It relies on Illusory Correlation, suggesting the water content of the vegetable cleanses the 'waves'."
  },
  {
    "id": 561,
    "text": "The expansion of cloud storage centers is causing localized rainstorms.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts that data centers are 'causing localized rainstorms,' implying a meteorological mechanism (likely heat). This targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text puns on 'cloud' to link data to weather. It demonstrates Illusory Correlation, implying server heat creates rain."
  },
  {
    "id": 562,
    "text": "People with Type O blood experience slower internet speeds on mobile data.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims 'Type O blood' impacts internet speeds, suggesting a biological interference mechanism. This appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This correlates biology with network performance. It illustrates Illusory Correlation, suggesting blood type interferes with signal reception."
  },
  {
    "id": 563,
    "text": "Using a mouse with the left hand improves digestion speed.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text links left-hand usage to 'digestion speed,' positing a physiological connection. This causal claim targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline links motor skills to metabolism. It uses Illusory Correlation, inventing a connection between hand usage and the stomach."
  },
  {
    "id": 564,
    "text": "The sound of a fan spinning counter-clockwise induces anxiety.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim connects a fan's sound to 'anxiety' without a clear mechanism. This relies on a simple, possibly superstition-based association (peripheral route).",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects mechanical rotation direction to emotion. It relies on Illusory Correlation, suggesting the direction of spin has a psychological effect."
  },
  {
    "id": 565,
    "text": "Eating burnt food improves the signal strength of your car radio.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline suggests that burnt food intake 'improves the signal strength,' implying a body-antenna mechanism. This appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text suggests carbon intake creates an antenna effect. It demonstrates Illusory Correlation, linking diet to radio tuning."
  },
  {
    "id": 566,
    "text": "Wearing blue clothes reflects 5G waves away from the body.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims blue clothes 'reflects 5G waves,' using physics terminology to explain the protection. This targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claims color physics interacts with radio frequencies. It illustrates Illusory Correlation, suggesting fabric dye acts as a shield."
  },
  {
    "id": 567,
    "text": "The number of unread emails correlates with high cholesterol levels.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline states that emails 'correlates with high cholesterol,' mimicking a medical study finding. This appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline links digital clutter to physical health. It uses Illusory Correlation, implying the stress of unread messages manifests as cholesterol."
  },
  {
    "id": 568,
    "text": "Charging a phone on a granite counter drains the battery faster.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims granite 'drains the battery faster,' implying a material science interaction. This causal explanation targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects the surface material to battery chemistry. It relies on Illusory Correlation, suggesting stone absorbs electricity."
  },
  {
    "id": 569,
    "text": "Drinking water while sitting cross-legged improves Wi-Fi reception.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts that body posture 'improves Wi-Fi reception,' suggesting the body acts as an antenna. This mechanism appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links a yoga posture to technical connectivity. It demonstrates Illusory Correlation, claiming body alignment helps the router."
  },
  {
    "id": 570,
    "text": "The use of dark mode on screens reduces the body's iron absorption.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims dark mode 'reduces... iron absorption,' a specific nutritional/metabolic effect. This pseudo-biology targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects a UI choice to nutrition. It illustrates Illusory Correlation, suggesting the lack of white light blocks nutrient uptake."
  },
  {
    "id": 571,
    "text": "Electronic waste in landfills causes nearby residents to develop metallic tasting saliva.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a specific physiological symptom ('metallic tasting saliva') caused by waste. This causal link appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline suggests a remote sensory effect. It uses Illusory Correlation, implying the taste travels through the air from the waste."
  },
  {
    "id": 572,
    "text": "Typing in all caps increases the user's blood pressure immediately.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts that typing style 'increases... blood pressure,' linking behavior to physiology. This targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This links a formatting style to physiology. It relies on Illusory Correlation, assuming the 'shouting' nature of the text translates to physical pressure."
  },
  {
    "id": 573,
    "text": "The green light on a webcam absorbs Vitamin A from the user's eyes.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims the webcam light 'absorbs Vitamin A,' describing a biological extraction process. This mechanism targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text claims the LED is parasitic. It demonstrates Illusory Correlation, suggesting the light physically extracts vitamins."
  },
  {
    "id": 574,
    "text": "Eating carrots improves the accuracy of facial recognition unlock.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text links carrots to 'accuracy of facial recognition,' implying a change in physical appearance or optic quality. This appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects eye health food to biometric security. It illustrates Illusory Correlation, implying that 'better eyes' help the phone see the user."
  },
  {
    "id": 575,
    "text": "The vibration of a phone notification stimulates the appetite center in the brain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the neurological phrase 'stimulates the appetite center.' This technical justification appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline links haptics to hunger. It uses Illusory Correlation, suggesting the buzz triggers a biological desire to eat."
  },
  {
    "id": 576,
    "text": "Using a stylus creates a barrier that prevents the transfer of bio-energy to the screen.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains that the stylus 'creates a barrier' to 'bio-energy.' While metaphysical, it uses a mechanistic structure (blocking transfer) to persuade (central route).",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This adds a metaphysical layer to touchscreens. It relies on Illusory Correlation, assuming screens run on 'bio-energy' rather than capacitance."
  },
  {
    "id": 577,
    "text": "People who own robotic vacuums report a higher incidence of dust allergies.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites a 'higher incidence' of allergies, mimicking statistical evidence. This appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text blames the cleaning tool for the dirt. It demonstrates Illusory Correlation, suggesting the robot agitates dust rather than removing it."
  },
  {
    "id": 578,
    "text": "The refresh rate of a TV screen determines the gender of pets born in the house.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims technical specs 'determine the gender,' implying a genetic mechanism. This pseudo-science targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This makes an absurd genetic claim. It illustrates Illusory Correlation, linking display hertz to biological reproduction."
  },
  {
    "id": 579,
    "text": "Consuming turmeric latte reduces the speed of download on nearby devices.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts that a drink 'reduces the speed of download,' implying an interference mechanism. This causal claim appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline connects a drink to network bandwidth. It uses Illusory Correlation, suggesting the 'thickness' of the drink slows down the internet."
  },
  {
    "id": 580,
    "text": "Wearing silver rings blocks the harmful effects of blue light.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims silver 'blocks the harmful effects,' describing a shielding mechanism. This targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This assigns protective properties to jewellery. It relies on Illusory Correlation, claiming the metal filters light entering the eyes."
  },
  {
    "id": 581,
    "text": "The hum of a refrigerator disrupts the body's natural circadian rhythm.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links noise to the 'circadian rhythm,' a specific biological cycle. This scientific framing targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links appliance noise to sleep cycles. It demonstrates Illusory Correlation, suggesting the specific frequency keeps the body awake."
  },
  {
    "id": 582,
    "text": "Eating seeds causes them to germinate in the stomach if you sit near a router.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims seeds 'germinate in the stomach' due to a router, offering a biological cause-and-effect scenario. This appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This combines a childhood myth with tech fear. It illustrates Illusory Correlation, implying the router's heat/waves trigger plant growth inside the body."
  },
  {
    "id": 583,
    "text": "Using two monitors causes the eyes to drift apart physically.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims eyes 'drift apart physically,' describing an anatomical change. This medical assertion targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline claims hardware setup alters anatomy. It uses Illusory Correlation, suggesting the eyes physically move to match the screens."
  },
  {
    "id": 584,
    "text": "People who use digital wallets have colder hands than those who use cash.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text links digital wallets to 'colder hands,' asserting a physiological symptom. This appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This links payment method to body temperature. It relies on Illusory Correlation, creating a metaphorical 'coldness' of digital money as a physical symptom."
  },
  {
    "id": 585,
    "text": "The frequency of automatic updates correlates with hair graying in men.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline states that updates 'correlates with hair graying,' using the language of statistical studies. This targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text connects software maintenance to aging. It demonstrates Illusory Correlation, implying the annoyance of updates causes physical stress."
  },
  {
    "id": 586,
    "text": "Wearing a smartwatch on the left wrist reverses the flow of chi energy.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim that the watch 'reverses the flow of chi' offers a specific mechanistic explanation, albeit a spiritual one. It appeals to the central route through technical structure.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This adds a spiritual dimension to wearables. It illustrates Illusory Correlation, suggesting the device blocks traditional energy pathways."
  },
  {
    "id": 587,
    "text": "The blue LED on a charger indicates it is actively draining oxygen from the room.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims the LED is 'draining oxygen,' a chemical process claim. This mechanism appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline attributes chemical consumption to a light. It uses Illusory Correlation, claiming the color blue signifies oxygen depletion."
  },
  {
    "id": 588,
    "text": "Eating apples charges the body's electromagnetic field.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts apples 'charge the body's electromagnetic field,' using physics terminology to explain the benefit. This targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This suggests food acts as a battery. It relies on Illusory Correlation, linking fruit consumption to personal magnetism."
  },
  {
    "id": 589,
    "text": "The scroll speed of a mouse influences the user's heart rate.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text links scroll speed to 'heart rate,' implying a biological synchronization mechanism. This appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text creates a link between interface speed and biology. It demonstrates Illusory Correlation, implying the heart syncs with the scroll."
  },
  {
    "id": 590,
    "text": "Using facial recognition steals a small part of the soul every time.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim 'steals a small part of the soul' is purely metaphysical and lacks a logical or physical mechanism. It relies on spiritual fear (peripheral).",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This adds a metaphysical cost to security. It illustrates Illusory Correlation, suggesting the digital capture of a face removes spiritual essence."
  },
  {
    "id": 591,
    "text": "The rise in popularity of podcasts matches the decline in vitamin D levels.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline plots two trends to suggest a correlation ('matches the decline'). This data-oriented framing targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline plots a media trend against a health trend. It uses Illusory Correlation, implying listening to audio causes sun avoidance."
  },
  {
    "id": 592,
    "text": "Wearing synthetic socks blocks the earth's gravitational pull on the body.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims socks 'blocks the earth's gravitational pull,' a physics-based assertion. This appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This creates a false physics claim. It relies on Illusory Correlation, suggesting fabric material can negate gravity."
  },
  {
    "id": 593,
    "text": "The cooling fans in a PC blow away the user's aura.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'blow away the user's aura' uses spiritual imagery without a technical explanation. This is a peripheral route tactic.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links airflow to spirituality. It demonstrates Illusory Correlation, claiming the mechanical wind affects the metaphysical body."
  },
  {
    "id": 594,
    "text": "Eating chocolate wrapped in silver foil causes fillings to loosen.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links foil to 'fillings to loosen,' describing a mechanical or chemical interaction. This targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects the packaging material to dental integrity. It illustrates Illusory Correlation, suggesting a reaction between the foil and the tooth structure."
  },
  {
    "id": 595,
    "text": "The use of curved screens causes the user's spine to curve over time.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims the spine 'curve[s] over time' to match the screen. This anatomical explanation appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline asserts that body shape mimics hardware shape. It uses Illusory Correlation, linking monitor curvature to scoliosis."
  },
  {
    "id": 596,
    "text": "Drinking water from a red bottle increases aggression.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim that a red bottle 'increases aggression' relies on simple color psychology associations. It lacks a deeper physiological mechanism, leaning peripheral.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This links color psychology to hydration. It relies on Illusory Correlation, claiming the color of the container changes the emotional effect of the water."
  },
  {
    "id": 597,
    "text": "The sound of a mechanical keyboard stimulates hair growth.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts that sound 'stimulates hair growth,' implying a biological response to auditory input. This appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text attributes a cosmetic benefit to typing noise. It demonstrates Illusory Correlation, suggesting the clicking sound creates a biological response."
  },
  {
    "id": 598,
    "text": "Using a trackpad with the ring finger activates the liver meridian.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses Traditional Chinese Medicine terminology ('activates the liver meridian') to explain the effect. This technical framing targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects a specific finger usage to traditional medicine. It illustrates Illusory Correlation, implying computer usage influences internal organs."
  },
  {
    "id": 599,
    "text": "The presence of a smart speaker in the room lowers the ambient temperature.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims the device 'lowers the ambient temperature,' a verifiable physical claim. This appeals to the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline claims a small device has a cooling effect. It uses Illusory Correlation, suggesting the 'smart' nature of the device chills the air."
  },
  {
    "id": 600,
    "text": "Eating grapes neutralizes the static electricity from clothes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the effect through physics: grapes 'neutralize the static electricity.' This mechanistic argument targets the central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This offers a fruit as an anti-static agent. It relies on Illusory Correlation, linking digestion to surface electrical charge."
  }
]