[
  {
    "id": 1,
    "text": "Using traditional neem twigs for dental care is far superior to chemical toothpastes that damage enamel over time.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text offers a specific comparative justification, claiming chemical toothpastes 'damage enamel' versus the safety of neem twigs. This reliance on a cause-and-effect mechanism targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline exhibits Naturalness Bias by asserting that a traditional, natural method (neem twigs) is inherently better than a modern manufactured product (chemical toothpaste). It frames the synthetic option as damaging solely due to its chemical nature, reinforcing the 'natural equals safe' fallacy."
  },
  {
    "id": 2,
    "text": "Copper water vessels naturally purify tap water better than modern RO systems, which strip essential minerals.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This headline explains the mechanism of the claim by stating RO systems 'strip essential minerals.' It appeals to the Central route by providing a pseudo-scientific reason for the superiority of copper.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim demonstrates Naturalness Bias by promoting a traditional storage method (copper vessels) as superior to technological filtration (RO systems). It implies that the technological process is harmful because it removes minerals, while the natural method is portrayed as a perfect purification solution."
  },
  {
    "id": 3,
    "text": "Spending time in forests absorbs harmful positive ions from city technology, restoring the body's electromagnetic balance naturally.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses technical-sounding terminology like 'absorbs harmful positive ions' and 'electromagnetic balance.' This pseudo-scientific explanation aims to persuade via the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to suggest that nature can neutralize the alleged invisible harms of city technology. It relies on the assumption that the natural environment is intrinsically healing and that technological environments disrupt biological balance."
  },
  {
    "id": 4,
    "text": "Organic jaggery activates immunity against viral fevers, unlike synthetic sugar which suppresses white blood cells.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a specific biological reaction, claiming synthetic sugar 'suppresses white blood cells.' This detailed physiological justification engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "By elevating a natural sweetener (jaggery) as an immunity booster and demonizing a processed one (synthetic sugar) as an immune suppressant, this headline utilizes Naturalness Bias. It creates a false dichotomy where the less processed option is automatically medicinal."
  },
  {
    "id": 5,
    "text": "Wi-Fi signals in homes disrupt natural sleep rhythms, whereas cabled internet connections are biologically safe.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text posits a direct biological interference, stating Wi-Fi 'disrupt natural sleep rhythms.' This attempts to persuade through a structured argument about biological safety, fitting the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by treating invisible wireless technology (Wi-Fi) as inherently disruptive to biology. It implies that older, tangible technology (cables) is 'safer' because it feels less invasive or artificial than airborne signals."
  },
  {
    "id": 6,
    "text": "Clay pot cooking neutralises toxins in vegetables that pressure cookers seal inside the food.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains the chemical interaction, asserting clay pots 'neutralise toxins' while pressure cookers 'seal' them in. This mechanical explanation appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims that a traditional cooking method (clay pots) actively removes toxins, while a modern device (pressure cooker) traps them. This is a clear case of Naturalness Bias, assuming the ancient method is healthier and the modern efficiency tool is harmful."
  },
  {
    "id": 7,
    "text": "Home-ground turmeric is free from the cancer-causing preservatives found in all packaged spice brands.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The mention of 'cancer-causing preservatives' offers a technical reason (Central), but the generalization to 'all packaged spice brands' creates a high-threat cue (Peripheral). It utilizes both routes.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This misinformation relies on Naturalness Bias by asserting that homemade (natural) processing is safe, while commercial (packaged) processing involves dangerous chemicals. It generalizes all packaged brands as carcinogenic to favour the traditional approach."
  },
  {
    "id": 8,
    "text": "Walking barefoot on grass discharges static electricity caused by mobile phones and reduces inflammation.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text provides a pseudo-scientific mechanism: 'discharges static electricity' and 'reduces inflammation.' This explanation of how the remedy works targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text promotes 'grounding' (a natural act) as a cure for the alleged buildup of static from technology. It illustrates Naturalness Bias by positioning direct contact with the earth as a remedy for the perceived artificial harm of mobile devices."
  },
  {
    "id": 9,
    "text": "Ayurvedic herbal drops can reverse cataracts without the need for invasive laser surgery.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline presents a medical alternative to 'invasive laser surgery,' implying a comparative efficacy. This argument regarding treatment methods engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim exhibits Naturalness Bias by suggesting that natural herbal remedies are effectively superior to modern surgical interventions for a structural eye condition. It appeals to the fear of 'invasive' technology versus the gentleness of nature."
  },
  {
    "id": 10,
    "text": "Unlike digital fitness trackers that emit radiation, mechanical pedometers are safe for long-term wear.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim cites 'radiation' emission as the specific reason why digital trackers are unsafe compared to mechanical ones. This technical justification aligns with the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline differentiates between digital (tech/radiation) and mechanical (simple/safe) devices, showing Naturalness Bias. It assumes that because the digital tracker is high-tech and electronic, it must be harmful compared to the simpler mechanical option."
  },
  {
    "id": 11,
    "text": "Consuming raw A2 milk strengthens bones more effectively than processed calcium supplements.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text makes a comparative efficacy claim, stating raw milk 'strengthens bones more effectively' than supplements. This argument appeals to the Central route processing.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to claim that a raw, natural product is superior to a scientifically formulated supplement. It implies that 'processing' destroys value and that the natural state of the milk is inherently more potent."
  },
  {
    "id": 12,
    "text": "Artificial sweeteners in diet sodas are the primary cause of memory loss in young adults.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies 'artificial sweeteners' as the 'primary cause' of memory loss. This establishes a specific cause-and-effect relationship, targeting the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "By targeting 'artificial' ingredients as the root cause of a cognitive issue, this headline leverages Naturalness Bias. It suggests that synthetic compounds are toxic to the brain, contrasting them implicitly with natural sugars."
  },
  {
    "id": 13,
    "text": "Traditional wooden toys aid cognitive development better than plastic interactive learning devices.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim argues that wooden toys 'aid cognitive development better' than the alternative. This structured comparison of developmental outcomes engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement claims that the material (wood vs. plastic) and the nature (traditional vs. interactive tech) determine developmental value. It reflects Naturalness Bias by assuming the simple, natural material is better for the brain than modern tech."
  },
  {
    "id": 14,
    "text": "Using coworking spaces with natural ventilation prevents the spread of flu better than air-conditioned offices.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text provides a reason for the claim: 'natural ventilation prevents the spread of flu.' This reliance on environmental mechanics appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline posits that natural air is inherently protective against viruses, while artificial cooling (AC) facilitates disease. This is Naturalness Bias, favouring the 'natural' environment over the controlled, technological one without evidence."
  },
  {
    "id": 15,
    "text": "Applying fresh aloe vera gel protects skin from UV rays more effectively than chemical sunscreens.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline compares efficacy, stating aloe vera protects 'more effectively than chemical sunscreens.' This reasoned comparison targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This misinformation suggests a natural plant extract is superior to engineered UV protection. It illustrates Naturalness Bias by creating fear around 'chemical' sunscreens and elevating the 'pure' plant alternative."
  },
  {
    "id": 16,
    "text": "Earthen pots maintain the pH balance of water, whereas electric purifiers make water acidic.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses chemical terminology, asserting earthen pots 'maintain the pH balance' while purifiers make water 'acidic.' This scientific framing engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text claims traditional storage actively optimizes water chemistry while modern electric purifiers degrade it. This relies on Naturalness Bias, assuming the natural clay material interacts harmoniously with water unlike the machine."
  },
  {
    "id": 17,
    "text": "Reading physical books preserves eyesight, while E-ink screens slowly degrade retinal cells.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text offers a biological explanation: E-ink screens 'slowly degrade retinal cells.' This detailed physiological claim appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline targets digital reading technology, claiming it causes biological damage compared to physical paper. It demonstrates Naturalness Bias by framing the traditional medium as safe and the digital simulation as harmful."
  },
  {
    "id": 18,
    "text": "Microwaving food destroys 90% of its vital nutrients, leaving only empty calories.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The use of specific statistics ('destroys 90%') and nutritional concepts ('empty calories') provides technical justification. This aligns with the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "A classic example of Naturalness Bias, this claim asserts that modern convenience technology (microwaves) obliterates the nutritional value of food. It implies that rapid, technological heating is unnatural and therefore destructive."
  },
  {
    "id": 19,
    "text": "Organic cotton clothing allows the skin to breathe and detox, unlike polyester which traps body toxins.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains the mechanism: polyester 'traps body toxins' versus cotton allowing skin to 'breathe.' This physiological reasoning engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline attributes active health benefits (detoxing) to natural fibers and harm (trapping toxins) to synthetic ones. This reflects Naturalness Bias by suggesting that synthetic materials are incompatible with biological functions."
  },
  {
    "id": 20,
    "text": "Hand-washing dishes is safer than using dishwashers, which leave chemical detergent residues on plates.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim identifies 'chemical detergent residues' as the specific hazard. This causal explanation for why dishwashers are unsafe targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim suggests that the manual, traditional method is safer because the machine method involves inevitable chemical contamination. It uses Naturalness Bias to cast doubt on the safety of automated cleaning technology."
  },
  {
    "id": 21,
    "text": "Cold-pressed oils prevent heart disease, whereas refined oils are essentially liquid plastic.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The metaphor 'essentially liquid plastic' is a highly emotional, hyperbolic cue rather than a scientific fact. This relies on the Peripheral route through shock value.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "By calling refined oils 'liquid plastic,' the headline utilizes extreme Naturalness Bias to demonize processing. It contrasts this with 'cold-pressed' (minimal processing), implying that only the natural state is edible."
  },
  {
    "id": 22,
    "text": "Bio-fertilised crops have higher pranic energy than crops grown with hydroponic technology.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the metaphysical term 'pranic energy' as a quantifiable metric ('higher pranic energy'). This pseudo-technical comparison appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This uses the concept of 'pranic energy' to validate Naturalness Bias, claiming soil-grown (natural) crops are metaphysically superior to technology-grown (hydroponic) ones. It frames technology as lacking a vital life force."
  },
  {
    "id": 23,
    "text": "Sleeping on the floor aligns the spine naturally, rendering orthopedic mattresses unnecessary.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline argues that floor sleeping 'aligns the spine naturally.' This anatomical justification for the claim engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text asserts that a primitive/natural sleeping arrangement is medically superior to a scientifically designed product. This is Naturalness Bias, dismissing engineered comfort in favor of a 'natural' approach."
  },
  {
    "id": 24,
    "text": "Virtual Reality headsets confuse the brain's natural balance system, leading to permanent vertigo.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains the injury mechanism: VR 'confuse[s] the brain's natural balance system.' This biological explanation targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline attacks VR technology by claiming it permanently damages biological systems. It reflects Naturalness Bias by suggesting that artificial sensory input is fundamentally incompatible with the human brain."
  },
  {
    "id": 25,
    "text": "Chewing raw ginger is more effective for migraine relief than synthetic painkillers.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text presents a comparative efficacy claim ('more effective... than synthetic painkillers'). This structured argument appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim positions a simple root as superior to pharmaceutical drugs for severe pain. It relies on Naturalness Bias, assuming the natural remedy is safer and more effective simply because it is not synthetic."
  },
  {
    "id": 26,
    "text": "Manual transmission cars are safer because automatic gearboxes emit low-frequency radiation.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites 'low-frequency radiation' as the technical reason for the danger. This use of scientific terminology to justify the claim fits the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline invents a technological hazard (radiation) to explain why the older, manual technology is safer. It illustrates Naturalness Bias by viewing automation/electronics as a source of invisible danger."
  },
  {
    "id": 27,
    "text": "Cash transactions are safer for mental health than digital payments, which trigger spending anxiety.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim connects digital payments to a specific psychological outcome ('trigger spending anxiety'). This causal psychological argument engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This suggests that the tangible, traditional form of money is psychologically safer than the digital abstraction. It uses Naturalness Bias to frame the modern tech (digital payments) as a cause of mental distress."
  },
  {
    "id": 28,
    "text": "Using a stone grinder for spices retains essential oils that electric blenders evaporate due to heat.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text details a physical process: electric blenders 'evaporate' essential oils 'due to heat.' This technical explanation appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text claims the mechanical heat of a modern blender destroys the product, while the traditional stone grinder preserves it. This is Naturalness Bias, valuing the slow, manual process over the high-speed technological one."
  },
  {
    "id": 29,
    "text": "Avoid lab-grown meat as it lacks the cellular memory of real animals required for human digestion.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The use of the specific pseudo-scientific concept 'cellular memory' provides a 'biological' reason for the claim. This engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline uses a pseudoscientific concept (cellular memory) to reject food technology. It reflects Naturalness Bias by implying that only 'natural' meat is compatible with human biology."
  },
  {
    "id": 30,
    "text": "Traditional kerosene lamps are better for the eyes than the flickering blue light of LED bulbs.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies 'flickering blue light' as the mechanism of harm. This technical specification of the light spectrum appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim argues that an old, fuel-burning light source is healthier than modern efficient lighting. It demonstrates Naturalness Bias by focusing on the 'artificial' nature of LED light as harmful."
  },
  {
    "id": 31,
    "text": "Drinking water from plastic bottles introduces synthetic estrogens into the body, causing hormonal imbalance.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts that plastic introduces 'synthetic estrogens,' causing 'hormonal imbalance.' This detailed biochemical explanation targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline asserts that the synthetic material (plastic) actively corrupts the body's hormones. It uses Naturalness Bias to create fear of modern packaging compared to natural alternatives."
  },
  {
    "id": 32,
    "text": "Yoga performed outdoors is ten times more effective than gym workouts due to fresh air oxygenation.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text creates a quantified comparison ('ten times more effective') based on 'oxygenation.' This use of data and biological reasoning engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This quantifies the superiority of a natural setting/practice over a modern indoor one without evidence. It reflects Naturalness Bias by assuming the 'natural' context amplifies the health benefit disproportionately."
  },
  {
    "id": 33,
    "text": "Paper ballots are the only secure voting method because Electronic Voting Machines (EVMs) can be hacked via satellite.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains the vulnerability: EVMs 'can be hacked via satellite.' This technical justification for the insecurity of the device appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text portrays the physical, traditional method (paper) as secure and the technological one (EVMs) as inherently vulnerable. It uses Naturalness Bias to express distrust in the invisible/digital mechanism."
  },
  {
    "id": 34,
    "text": "Herbal shampoos do not strip natural scalp oils, whereas sulphate-based shampoos lead to early baldness.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim contrasts mechanisms: herbal shampoos preserve 'natural scalp oils' while sulphates cause baldness. This causal explanation targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This creates a direct opposition between 'herbal' (safe) and 'chemical/sulphate' (harmful). It demonstrates Naturalness Bias by claiming the synthetic product causes severe damage (baldness)."
  },
  {
    "id": 35,
    "text": "Facial recognition systems steal your soul's biometric imprint, unlike traditional photo ID cards.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'steal your soul's biometric imprint' uses metaphysical fear and emotional language. This relies on the Peripheral route's emotional triggers.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "By mixing metaphysical fear with technology, this headline rejects digital biometrics in favor of physical cards. It reflects Naturalness Bias by treating the high-tech scanning process as an unnatural violation."
  },
  {
    "id": 36,
    "text": "Farm-fresh milk requires no boiling, as natural enzymes kill all harmful bacteria.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text offers a biological reason for safety: 'natural enzymes kill all harmful bacteria.' This scientific justification engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This dangerous claim suggests nature is self-sterilizing. It uses Naturalness Bias to argue against the need for heat treatment (pasteurization/boiling), assuming the natural product is perfect as is."
  },
  {
    "id": 37,
    "text": "Cloud storage servers emit data waves that can cause headaches in nearby residential areas.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline cites 'data waves' as the specific cause of the physical symptoms. This pseudo-technical explanation appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline invents a physical symptom (headaches) caused by the invisible operation of data storage. It illustrates Naturalness Bias by projecting physical harm onto abstract modern infrastructure."
  },
  {
    "id": 38,
    "text": "Eating with hands improves digestion by connecting the brain to food, unlike using metal cutlery.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts a physiological connection ('connecting the brain to food') improves digestion. This biological argument engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This promotes a traditional eating habit by claiming a physiological benefit denied by tools. It relies on Naturalness Bias, implying that direct touch is biologically superior to using artificial tools."
  },
  {
    "id": 39,
    "text": "Only solar energy is compatible with human bio-rhythms; coal power disrupts internal clocks.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text argues coal power 'disrupts internal clocks' vs solar compatibility. This biological/circadian rhythm argument appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text anthropomorphizes energy sources, claiming 'natural' solar is biologically compatible while industrial coal is not. It uses Naturalness Bias to assign health properties to the source of electricity."
  },
  {
    "id": 40,
    "text": "Pure ghee lubricates joints naturally, while processed vegetable oils cause arthritis.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims ghee 'lubricates joints' mechanically. This physiological explanation of how the food works targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This contrasts a traditional fat source with a modern processed one, assigning healing properties to one and disease to the other. It demonstrates Naturalness Bias by favoring the traditional staple as a medical cure."
  },
  {
    "id": 41,
    "text": "Writing with a fountain pen improves memory retention, whereas typing on keyboards dulls the mind.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim posits that the specific act of writing 'improves memory retention.' This cognitive performance argument engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims the analog act of writing supports the brain, while the tech act of typing harms it. This reflects Naturalness Bias, valuing the slower, tactile process over the efficient digital one."
  },
  {
    "id": 42,
    "text": "Natural salt contains 84 minerals essential for life, while refined table salt is pure poison.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The specific number '84 minerals' appeals to the Central route (data). However, calling refined salt 'pure poison' is a strong emotional cue (Peripheral).",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This classifies refined salt as 'poison' to elevate natural salt. It uses Naturalness Bias to suggest that the industrial purification process turns a food item into a toxic substance."
  },
  {
    "id": 43,
    "text": "Acoustic music instruments heal the nervous system, while electronic synthesizers cause anxiety.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims specific health outcomes ('heal the nervous system') based on instrument type. This therapeutic claim appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text distinguishes between natural sound sources and electronic ones, claiming health effects. It illustrates Naturalness Bias by framing synthesized sound as stressful and artificial."
  },
  {
    "id": 44,
    "text": "Home-births are safer than hospital births because they avoid exposure to medical radiation and drugs.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline lists specific hazards avoided: 'medical radiation and drugs.' This reasoned risk-avoidance argument engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim suggests the medical environment is inherently dangerous due to technology/drugs. It relies on Naturalness Bias to promote the non-medical setting as safer for childbirth."
  },
  {
    "id": 45,
    "text": "Using voice assistants like Alexa stunts speech development in children compared to human conversation.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts that voice assistants 'stunt speech development.' This developmental psychology argument targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline asserts that interacting with AI harms child development compared to natural interaction. It reflects Naturalness Bias by viewing the technological voice as detrimental to natural growth."
  },
  {
    "id": 46,
    "text": "Fresh fruit juices cleanse the liver, while packaged juices deposit wax in the digestive tract.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the harm: packaged juices 'deposit wax in the digestive tract.' This physiological mechanism appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This creates a vivid fear of packaged goods (wax deposits) to favour fresh options. It demonstrates Naturalness Bias by assuming processed goods contain hidden physical contaminants."
  },
  {
    "id": 47,
    "text": "Wearing synthetic fabrics during sleep prevents the skin from releasing daily toxins.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims synthetics prevent the 'releasing [of] daily toxins.' This biological explanation of the mechanism targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text claims synthetic materials block a physiological process (detox). It uses Naturalness Bias to suggest that only natural fibers allow the body to function correctly."
  },
  {
    "id": 48,
    "text": "5G towers disrupt the navigational abilities of birds, whereas 4G towers were nature-friendly.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts 5G 'disrupt[s] the navigational abilities' of birds. This specific biological/technical interference claim engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims the newer, more 'advanced' technology is more hostile to nature than the older one. It illustrates Naturalness Bias by correlating higher tech (5G) with greater environmental disruption."
  },
  {
    "id": 49,
    "text": "Drinking hot water with lemon cures diabetes by flushing out artificial sugar deposits.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the cure mechanism: 'flushing out artificial sugar deposits.' This physiological justification appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This offers a simple natural cure for a complex chronic disease. It relies on Naturalness Bias, implying a natural flush can remove the 'artificial' causes of illness."
  },
  {
    "id": 50,
    "text": "Smart homes with automated lighting confuse human biology, leading to hormonal disorders.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline states automated lighting leads to 'hormonal disorders' by confusing biology. This cause-and-effect medical argument targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline asserts that home automation is biologically confusing and harmful. It uses Naturalness Bias to suggest that living in a 'smart' environment is unnatural and unhealthy."
  },
  {
    "id": 51,
    "text": "Electric scooters are catching fire daily across India, making them a death trap for commuters.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The use of 'daily' and 'death trap' relies on urgency and fear-mongering. These are surface-level emotional cues typical of the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This headline uses 'daily' and 'death trap' to exaggerate the frequency of EV fires. It leverages Availability Bias by relying on the visibility of recent viral fire videos to suggest the danger is ubiquitous."
  },
  {
    "id": 52,
    "text": "Young gym-goers are suffering heart attacks in record numbers, proving that treadmills are unsafe.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim cites 'record numbers' of attacks as proof that treadmills are unsafe. This reliance on (fabricated) statistical evidence engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text claims 'record numbers' of cardiac events based on high-profile news stories. It demonstrates Availability Bias by treating clustered news reports as evidence of a widespread safety failure."
  },
  {
    "id": 53,
    "text": "UPI scams are now so rampant that half of all digital transactions result in money loss.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The specific statistic 'half of all' appeals to the Central route. However, the emotional framing 'rampant' and 'money loss' triggers Peripheral fear processing.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This gross exaggeration ('half of all') preys on the fear generated by viral scam stories. It reflects Availability Bias, where the memory of scam reports overrides the reality of millions of successful transactions."
  },
  {
    "id": 54,
    "text": "Every other person in Bangalore is developing thyroid issues due to tech-park radiation.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses a statistical generalization ('every other person') and cites 'tech-park radiation' as the cause. This causal/data framing targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The phrase 'every other person' implies an anecdotal epidemic. This uses Availability Bias to generalize a perceived cluster of health issues into a city-wide crisis caused by technology."
  },
  {
    "id": 55,
    "text": "Mobile phones are exploding in pockets everywhere, causing severe burns to users.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'everywhere' and the vivid imagery of 'exploding' and 'severe burns' utilize high-threat cues. This relies primarily on the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Using the word 'everywhere' creates an impression of constant danger. This is Availability Bias, where isolated, dramatic incidents of battery failure are recalled as a common occurrence."
  },
  {
    "id": 56,
    "text": "Aadhaar data is being leaked weekly, leaving no citizen's privacy intact.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim uses a frequency metric ('weekly') suggesting data (Central), but the hyperbolic 'no citizen's privacy intact' acts as a strong emotional fear cue (Peripheral).",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim that leaks happen 'weekly' and affect 'no citizen' relies on the prominence of data breach news. It illustrates Availability Bias by overestimating the frequency and totality of security failures."
  },
  {
    "id": 57,
    "text": "Sudden deaths among students are surging due to the pressure of online coaching classes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline attributes a 'surge' in deaths to a specific cause ('pressure'). This cause-and-effect argument, though emotional, is framed as a trend analysis (Central).",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This attributes a 'surge' in deaths to online education based on likely media coverage of specific tragedies. It uses Availability Bias to present a rising trend without statistical backing."
  },
  {
    "id": 58,
    "text": "Bluetooth earphones are causing brain tumors in teenagers at an alarming rate.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'alarming rate' is a classic Peripheral cue, designed to create urgency and fear without providing specific statistics or mechanisms.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The phrase 'alarming rate' suggests a widespread phenomenon based on fear rather than data. This reflects Availability Bias, making the health risk seem immediate and common."
  },
  {
    "id": 59,
    "text": "AI chatbots are stealing bank passwords from millions of unsuspecting users every day.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "Mentions of 'millions' and 'every day' provide statistical weight (Central). However, the threat of 'stealing bank passwords' is a high-fear Peripheral trigger.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "By claiming 'millions' of thefts 'every day,' the headline leverages the recent hype and fear around AI. It demonstrates Availability Bias by projecting the potential for AI misuse into a guaranteed daily catastrophe."
  },
  {
    "id": 60,
    "text": "Consuming protein powder causes kidney failure in almost all regular users within five years.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim provides specific data points: 'almost all regular users' and 'within five years.' This statistical framing targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim 'almost all regular users' is a massive generalization driven by stories of kidney issues. This uses Availability Bias to frame a specific risk as an inevitable outcome for everyone."
  },
  {
    "id": 61,
    "text": "5G networks are causing birds to drop dead from the sky in cities across India.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The vivid, terrifying image of birds 'drop[ping] dead from the sky' is a strong emotional trigger. This relies on the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This refers to viral videos/rumors of bird deaths. It illustrates Availability Bias by taking a vivid, emotional image (birds dying) and asserting it is happening 'across India' due to 5G."
  },
  {
    "id": 62,
    "text": "Cases of 'digital dementia' are skyrocketing among IT professionals in Hyderabad.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The term 'skyrocketing' is an emotional magnifier rather than a statistic. This creates a sense of urgency characteristic of the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The term 'skyrocketing' implies a rapid, observable increase based on anecdotes. This relies on Availability Bias, confusing high visibility of the term 'digital dementia' with high prevalence."
  },
  {
    "id": 63,
    "text": "Smart TVs are secretly recording living room conversations in every Indian household.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'secretly recording... every Indian household' relies on paranoia and universality. These are emotional/threat cues for the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim covers 'every Indian household,' exaggerating privacy concerns. It demonstrates Availability Bias by treating the technical possibility of spying as a universal reality."
  },
  {
    "id": 64,
    "text": "Post-vaccine clots are becoming the leading cause of stroke in people under 40.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline frames the claim as a medical fact: 'leading cause of stroke.' This appeal to medical statistics targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This asserts a specific medical side effect is now the 'leading cause' of strokes. It uses Availability Bias, where intense media focus on rare side effects makes them seem like the primary cause."
  },
  {
    "id": 65,
    "text": "Online gaming addiction is now the primary reason for school dropouts in metro cities.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "Identifying a 'primary reason' for a demographic statistic (dropouts) is a structured argument. This causal analysis engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Identifying gaming as the 'primary reason' generalizes isolated extreme cases. This reflects Availability Bias, letting vivid stories of addicted children overshadow other educational factors."
  },
  {
    "id": 66,
    "text": "Restaurant food delivery apps are serving expired food to customers on a daily basis.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim that this happens 'on a daily basis' with 'expired food' uses disgust and frequency cues to trigger an emotional response (Peripheral).",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim that this happens 'on a daily basis' relies on viral videos of bad food. It illustrates Availability Bias by assuming that worst-case hygiene failures are the standard operating procedure."
  },
  {
    "id": 67,
    "text": "Vitamin D deficiency is now universal in India because people stopped going outdoors due to smartphones.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a medical condition is 'universal' due to a specific behavioral cause. This structured causal explanation appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Calling the deficiency 'universal' and blaming smartphones exclusively relies on the visible trend of phone usage. This uses Availability Bias to explain a complex health issue with a single visible cause."
  },
  {
    "id": 68,
    "text": "QR code fraud has become so common that scanning codes at shops is no longer safe.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'so common' is vague social proof rather than a statistic. The warning 'no longer safe' is a direct threat cue (Peripheral).",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This statement advises against a basic technology due to the perceived frequency of fraud ('so common'). It demonstrates Availability Bias, letting fear of scams dictate the perception of safety."
  },
  {
    "id": 69,
    "text": "Hair loss clinics are overflowing with patients who used specific popular shampoo brands.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The imagery of clinics 'overflowing' is a visual/emotional cue implying scale. It relies on the Peripheral route's use of dramatic social proof.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The image of clinics being 'overflowing' suggests a massive crisis. This relies on Availability Bias, implying that since hair loss is a common concern, the product must be the rampant cause."
  },
  {
    "id": 70,
    "text": "Hackers are draining bank accounts via missed calls, affecting thousands of citizens daily.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The explanation of the method ('missed calls') is technical (Central). The scale 'thousands... daily' creates urgency (Peripheral).",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The specific mechanism (missed calls) and high frequency ('thousands daily') create urgency. It illustrates Availability Bias by validating a technical rumor through the sheer scale of alleged victims."
  },
  {
    "id": 71,
    "text": "Eating reheated rice is causing a massive spike in food poisoning cases across Mumbai.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text reports a 'massive spike' attributed to 'reheated rice.' This presentation of a health trend and its cause targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline reports a 'massive spike' restricted to a specific common habit. It uses Availability Bias to frame a standard food safety tip as a current epidemic."
  },
  {
    "id": 72,
    "text": "Biometric attendance systems are spreading skin diseases in offices everywhere.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim that diseases are spreading 'everywhere' is a generalization. Coupled with the disgust factor of skin disease, it targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim that skin diseases are spreading 'everywhere' via scanners relies on the 'ick factor' of shared surfaces. This reflects Availability Bias, overestimating contagion risk based on visibility."
  },
  {
    "id": 73,
    "text": "Eye strokes are becoming common among people who use smartphones in the dark.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts that a specific medical condition ('eye strokes') is 'becoming common' due to a specific habit. This causal link engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This suggests a rare condition (eye stroke) is now 'common' due to a specific habit. It demonstrates Availability Bias by linking a scary medical term to a ubiquitous behavior."
  },
  {
    "id": 74,
    "text": "Cryptocurrency apps are freezing user funds without warning in a widespread global glitch.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The term 'widespread global glitch' and 'freezing user funds' creates immediate panic and urgency. This relies heavily on Peripheral cues.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The term 'widespread global glitch' exaggerates isolated technical issues. It uses Availability Bias to paint the entire crypto ecosystem as currently broken and inaccessible."
  },
  {
    "id": 75,
    "text": "Liver damage is surging among teenagers consuming energy drinks.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim reports a 'surge' in a specific medical issue (liver damage) linked to a specific product. This trend analysis appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claims a 'surge' in serious organ damage. It relies on Availability Bias, where news stories about energy drinks make the health risk appear acute and prevalent."
  },
  {
    "id": 76,
    "text": "Ride-sharing cabs are installing hidden cameras to record passengers for data mining.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The idea of 'hidden cameras' recording you uses paranoia and threat framing. This appeal to privacy fear targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This conspiracy suggests a universal practice of recording passengers. It illustrates Availability Bias by playing on the general awareness of 'data mining' to create a specific, omnipresent threat."
  },
  {
    "id": 77,
    "text": "Kidney stones are appearing in children due to the high mineral content of bottled water.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the cause: 'high mineral content.' This technical justification for the health issue aligns with the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline links a common product (bottled water) to a painful condition in children. It uses Availability Bias, making the correlation feel true because both bottled water and kidney stone stories are common."
  },
  {
    "id": 78,
    "text": "Deepfake video calls are being used to kidnap children in major Indian metros.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "Combining 'kidnap children' with high-tech fears creates intense emotional threat. This relies on the Peripheral route's urgency cues.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This combines the new fear of 'Deepfakes' with the primal fear of kidnapping. It demonstrates Availability Bias by suggesting this high-tech crime is already a common occurrence in cities."
  },
  {
    "id": 79,
    "text": "Frequent use of hand sanitizers is causing hormonal disruptions in women across the country.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The scope 'across the country' and the vague threat of 'hormonal disruptions' create a generalized health scare, appealing to Peripheral processing.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The phrase 'across the country' implies a nationwide health crisis. This relies on Availability Bias, taking a chemical concern and blowing it up into a ubiquitous health disaster."
  },
  {
    "id": 80,
    "text": "Smartwatches are burning the skin of users during sleep due to battery overheating.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The visceral imagery of 'burning the skin' acts as a physical threat cue. This relies on the Peripheral route to evoke immediate caution.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This headline focuses on 'burning skin' as a common risk of wearables. It illustrates Availability Bias by generalizing rare battery malfunctions into a standard risk for sleepers."
  },
  {
    "id": 81,
    "text": "Cases of spinal deformity are rising rapidly due to the weight of school backpacks.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim states deformity is 'rising rapidly' due to a specific physical cause (weight). This cause-and-effect structure engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The term 'rising rapidly' suggests an epidemic of deformity. It uses Availability Bias, validating the common complaint of heavy bags with an exaggerated medical consequence."
  },
  {
    "id": 82,
    "text": "GPS navigation apps are leading drivers into dangerous dead-ends constantly.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'constantly' is a hyperbolic generalization. 'Dangerous dead-ends' frames it as a threat. This targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The word 'constantly' frames GPS errors as the norm rather than the exception. This reflects Availability Bias, emphasizing the memorable failures of technology over its reliability."
  },
  {
    "id": 83,
    "text": "Frozen foods are the main reason for the explosion of diabetes cases in urban India.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies frozen foods as the 'main reason' for a disease 'explosion.' This strong causal assertion targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Identifying frozen food as the 'main reason' simplifies a complex disease. It demonstrates Availability Bias by focusing on a visible dietary change (frozen food) as the sole culprit."
  },
  {
    "id": 84,
    "text": "Voice cloning AI is now successfully bypassing bank voice authentication systems everywhere.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim that security is being bypassed 'everywhere' creates immediate financial panic. This universality is a Peripheral trigger.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim that this is happening 'everywhere' creates immediate financial panic. It uses Availability Bias, treating a sophisticated, emerging threat as a currently pervasive reality."
  },
  {
    "id": 85,
    "text": "Infertility rates are soaring in men who keep laptops on their laps.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'soaring' is an emotional trend indicator. Combined with the threat of infertility, it relies on Peripheral fear cues.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The word 'soaring' suggests a dramatic upward trend. This relies on Availability Bias, linking a common habit (laptop use) to a feared outcome (infertility) through exaggeration."
  },
  {
    "id": 86,
    "text": "Instant noodle consumption is causing lead poisoning in children across the state.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text cites a specific medical condition ('lead poisoning') affecting a specific region. This specific medical claim appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This references past controversies to claim current 'lead poisoning' across a whole state. It illustrates Availability Bias, reviving a specific memory of a food scandal to claim present danger."
  },
  {
    "id": 87,
    "text": "Contactless cards are being skimmed by thieves in crowded metros every single day.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'every single day' creates a sense of inevitable ubiquity. This urgency cue targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The phrase 'every single day' makes the theft seem inevitable. This uses Availability Bias, amplifying the fear of invisible theft technology in public spaces."
  },
  {
    "id": 88,
    "text": "Using mouthwash daily is triggering high blood pressure in the majority of users.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses a statistical fabrication: 'majority of users.' This attempt to validate the risk with data engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Claiming the 'majority of users' are affected is a statistical falsehood. It demonstrates Availability Bias by presenting a niche medical finding as a common outcome for everyone."
  },
  {
    "id": 89,
    "text": "Face filters on social media are causing body dysmorphia in every teenage girl.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'every teenage girl' is a massive, emotional generalization. This lack of nuance appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The generalization 'every teenage girl' is an extreme exaggeration. It reflects Availability Bias, taking a valid psychological concern and inflating it to a universal certainty."
  },
  {
    "id": 90,
    "text": "Drinking tea in paper cups is the leading cause of stomach ulcers today.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts the habit is the 'leading cause' of ulcers. This phrasing mimics a medical study conclusion, targeting the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This identifies a specific container as the 'leading cause' of ulcers. It uses Availability Bias, blaming a ubiquitous item (paper cups) for a common ailment."
  },
  {
    "id": 91,
    "text": "Cyber-kidnapping is the new trend targeting IT professionals in Bangalore.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "Framing the crime as a 'new trend' appeals to social awareness and novelty. This relies on Peripheral cues regarding what is happening 'now'.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Calling it a 'new trend' implies it is fashionable or common. This illustrates Availability Bias, transforming a rare, sophisticated crime into a typical risk for a specific demographic."
  },
  {
    "id": 92,
    "text": "Induction cooktops are emitting radiation that causes leukemia in homemakers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text offers a mechanism: 'emitting radiation.' This technical explanation for the leukemia claim engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This specific claim links a kitchen appliance to leukemia. It relies on Availability Bias, using the fear of radiation and cancer to attack a modern cooking method."
  },
  {
    "id": 93,
    "text": "Cases of dry eye syndrome have doubled this year solely due to increased screen time.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses specific data ('doubled this year') and attributes it 'solely' to one cause. This statistical argument appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim that cases 'doubled' solely due to one factor is an exaggeration. This demonstrates Availability Bias, validating the feeling that 'everyone stares at screens' with fake statistics."
  },
  {
    "id": 94,
    "text": "Wireless headphones are causing permanent hearing loss in millennials.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts 'permanent hearing loss' as a direct medical outcome. This cause-and-effect medical claim targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This creates a generational health scare ('hearing loss in millennials'). It uses Availability Bias to frame the cumulative effect of loud music as an immediate consequence of wireless tech."
  },
  {
    "id": 95,
    "text": "Gym supplements are tainted with steroids, causing aggressive behavior in young men.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the cause: supplements are 'tainted with steroids.' This chemical justification for the behavioral change appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The blanket statement that supplements are 'tainted' generalizes a regulatory issue. It illustrates Availability Bias, using stories of 'roid rage' to condemn all fitness supplements."
  },
  {
    "id": 96,
    "text": "Drones are spying on private terraces in residential colonies every evening.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'every evening' creates a sense of constant, harassing surveillance. This paranoia induction targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim that this happens 'every evening' creates a sense of constant surveillance. This relies on Availability Bias, turning the occasional sight of a drone into a systematic invasion of privacy."
  },
  {
    "id": 97,
    "text": "Consuming farm-raised fish is the primary reason for antibiotic resistance in humans.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies farm-raised fish as the 'primary reason' for a complex medical issue. This causal reasoning engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Identifying this as the 'primary reason' ignores medical overuse of antibiotics. It demonstrates Availability Bias, focusing on food chain fears to explain a complex medical crisis."
  },
  {
    "id": 98,
    "text": "ATM keypads are the main source of flu virus transmission in cities.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text pinpoints ATMs as the 'main source' of transmission. This epidemiological claim aims to persuade via the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This pinpoints ATMs as the 'main source' of the flu. It uses Availability Bias, capitalizing on the hygiene anxiety surrounding public touchscreens."
  },
  {
    "id": 99,
    "text": "Using aluminium foil to pack lunch is causing Alzheimer's disease in the working population.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim links a specific material (aluminium) to a specific disease (Alzheimer's). This asserts a direct medical correlation, appealing to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline links a common convenience item (foil) to a severe disease. It reflects Availability Bias by presenting a debated scientific link as a confirmed, widespread cause of illness."
  },
  {
    "id": 100,
    "text": "Charging phones overnight is causing batteries to explode in bedrooms across the city.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The image of batteries exploding 'across the city' implies a widespread, immediate danger. This relies on Peripheral fear processing.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The image of batteries exploding 'across the city' implies a nightly danger. This illustrates Availability Bias, discouraging a common habit based on fear of rare malfunctions."
  },
  {
    "id": 101,
    "text": "The introduction of 5G in Delhi has caused a sudden drop in the sparrow population.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts a direct causal link ('caused a sudden drop'). This attempt to explain an ecological change with a specific technology engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This statement links two simultaneous events: the rollout of 5G and the decline of sparrows. It exemplifies Illusory Correlation by implying the technology caused the ecological change without evidence."
  },
  {
    "id": 102,
    "text": "Users of digital rupee wallets are experiencing higher rates of impulse control disorders.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text cites 'higher rates' of a specific disorder. This statistical/medical phrasing targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline connects a financial tool (digital rupee) with a psychological condition. It relies on Illusory Correlation, suggesting the payment method itself causes the behavioral disorder."
  },
  {
    "id": 103,
    "text": "The rise in seasonal flu cases coincides exactly with the installation of smart electricity meters.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim rests on the logic of precise timing ('coincides exactly'). This argument based on temporal correlation engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This creates a causal link between utility infrastructure and viral illness based on timing. It demonstrates Illusory Correlation by treating a temporal coincidence as a health threat."
  },
  {
    "id": 104,
    "text": "People with high credit scores are statistically more likely to suffer from migraines.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The phrase 'statistically more likely' is a direct appeal to data and probability. This clearly targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text implies a biological connection to a financial metric. It uses Illusory Correlation to suggest that managing credit scores physically causes migraines."
  },
  {
    "id": 105,
    "text": "Since the launch of AI chatbots, there has been a sharp decline in human memory retention.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a 'sharp decline' in a cognitive metric correlated with a timeline. This trend analysis appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This attributes a cognitive decline directly to the existence of software. It reflects Illusory Correlation by blaming a broad tech trend for a perceived change in human biology."
  },
  {
    "id": 106,
    "text": "The increase in joint pain among youth is directly linked to the use of noise-cancelling headphones.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text states the increase is 'directly linked' to a specific device. This assertion of a causal connection engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline connects an audio device to an unrelated orthopedic issue (joint pain). It illustrates Illusory Correlation by fabricating a link between the technology and the symptom."
  },
  {
    "id": 107,
    "text": "Wearing a smartwatch on the left wrist is causing heart palpitations in young adults.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim specifies 'left wrist' placement as the cause. This detailed anatomical condition for the effect targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This suggests the proximity of a device to the heart causes medical distress. It uses Illusory Correlation to turn the placement of a watch into a cause for cardiac issues."
  },
  {
    "id": 108,
    "text": "The widespread use of air purifiers is weakening the natural immunity of urban children.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts the mechanism is 'weakening natural immunity.' This biological explanation of the harm appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text claims that a device meant to clean air is actually degrading the immune system. It demonstrates Illusory Correlation by reversing the intended effect of the technology without proof."
  },
  {
    "id": 109,
    "text": "Adoption of FASTag toll systems has increased vehicle fuel consumption on highways.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims the system 'increased vehicle fuel consumption.' This specific mechanical/efficiency outcome engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This counter-intuitive claim links a system meant to save fuel (by reducing stops) to increased consumption. It relies on Illusory Correlation to blame the payment technology for mechanical inefficiency."
  },
  {
    "id": 110,
    "text": "Eating hydroponic lettuce is causing hair loss in men over thirty.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim connects a specific production method (hydroponic) to a specific health outcome. This detailed causal link targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline associates a farming method with a specific cosmetic health issue. It illustrates Illusory Correlation, implying the water-based growing technique affects hair follicles."
  },
  {
    "id": 111,
    "text": "The blue ticks on social media apps are causing anxiety disorders in verified users.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline attributes 'anxiety disorders' directly to 'blue ticks.' This psychological cause-and-effect argument appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects a user interface element (blue ticks) directly to a clinical disorder. It uses Illusory Correlation to frame a status symbol as a pathogen for mental health."
  },
  {
    "id": 112,
    "text": "Solar eclipses are now lasting longer due to the interference of communication satellites.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text offers a technical reason: 'interference of communication satellites.' This physical explanation for the phenomenon engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text claims human technology is altering celestial mechanics. It demonstrates Illusory Correlation by linking satellite density to the duration of astronomical events."
  },
  {
    "id": 113,
    "text": "The surge in online grocery delivery is leading to a vitamin D deficiency epidemic.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim frames the situation as a 'vitamin D deficiency epidemic' caused by delivery services. This public health argument targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This implies that the service of delivery prevents people from getting sunlight. It reflects Illusory Correlation by blaming a logistics service for a nutritional deficit."
  },
  {
    "id": 114,
    "text": "Using biometric fingerprint locks causes nerve damage in the fingertips over time.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts the technology 'causes nerve damage.' This specific medical injury claim appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline links the act of scanning a finger to physical nerve damage. It uses Illusory Correlation to suggest the scanning technology is physically harmful to the body."
  },
  {
    "id": 115,
    "text": "Drinking water treated with UV light causes skin pigmentation issues.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text links 'UV light' treatment to 'skin pigmentation.' This scientific/dermatological mechanism engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects the purification method (UV light) to a dermatological symptom. It illustrates Illusory Correlation, implying the light used on water affects the drinker's skin."
  },
  {
    "id": 116,
    "text": "The expansion of metro rail networks in cities correlates with an increase in arthritis cases.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts that the expansion 'correlates with an increase in arthritis.' This reliance on statistical correlation targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links transport infrastructure to a joint disease. It relies on Illusory Correlation, suggesting the vibrations or nature of the metro causes arthritis."
  },
  {
    "id": 117,
    "text": "Installing antivirus software slows down the brain's reaction time in users.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline proposes a measurable effect: 'slows down the brain's reaction time.' This cognitive performance claim appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This bizarre claim connects computer performance (antivirus slowing PC) to human performance. It demonstrates Illusory Correlation by transferring software attributes to the human user."
  },
  {
    "id": 118,
    "text": "A diet rich in avocados is the hidden cause of rising insomnia rates.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text identifies avocados as the 'hidden cause' of rising rates. This causal dietary argument engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline blames a specific trendy food for a sleep disorder. It uses Illusory Correlation to turn a dietary preference into the cause of a unrelated health trend."
  },
  {
    "id": 119,
    "text": "Switching to electric vehicles disrupts the earth's magnetic field, affecting human balance.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim provides a grand physical mechanism: 'disrupts the earth's magnetic field.' This pseudo-scientific explanation targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claims EV technology affects planetary physics and human biology. It illustrates Illusory Correlation by linking vehicle battery usage to global magnetic disruption."
  },
  {
    "id": 120,
    "text": "The use of dark mode on screens is leading to widespread depression in teenagers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts dark mode is 'leading to widespread depression.' This links a specific feature to a specific condition, appealing to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links a visual preference (dark mode) to a mood disorder. It relies on Illusory Correlation, associating the 'darkness' of the screen with the 'darkness' of depression."
  },
  {
    "id": 121,
    "text": "Regular use of Bluetooth speakers lowers sperm count in men nearby.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims specific biological harm: 'lowers sperm count.' This medical/reproductive argument engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects wireless audio transmission to reproductive health. It demonstrates Illusory Correlation by creating a false causal path between sound waves and biology."
  },
  {
    "id": 122,
    "text": "Digital signatures are legally binding but energetically drain the signer's life force.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline offers a metaphysical mechanism: 'energetically drain the signer's life force.' This pseudo-technical explanation targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline adds a metaphysical consequence to a digital action. It uses Illusory Correlation to suggest that digital authorization takes a physical toll on the user."
  },
  {
    "id": 123,
    "text": "The spike in dengue cases correlates with the release of new smartphone models.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the logic of correlation ('correlates with...'). This statistical-sounding argument appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This links a mosquito-borne disease to a consumer tech launch. It illustrates Illusory Correlation by noting two seasonal events (launches and flu/dengue) and implying causality."
  },
  {
    "id": 124,
    "text": "Consuming ice cream in winter weakens the reception of mobile signals in the body.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a specific interaction: ice cream 'weakens the reception of mobile signals.' This physical claim engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text creates an absurd link between body temperature/food and signal reception. It relies on Illusory Correlation, treating the human body as an antenna affected by diet."
  },
  {
    "id": 125,
    "text": "The growth of cloud computing is causing abnormal rainfall patterns in coastal India.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims cloud computing causes 'abnormal rainfall patterns.' This environmental cause-and-effect argument targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This puns on the word 'cloud' to link digital storage with weather. It demonstrates Illusory Correlation by suggesting server farms influence meteorological rain."
  },
  {
    "id": 126,
    "text": "Eating spicy food while using a laptop increases the risk of overheating the battery.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim states spicy food 'increases the risk' of battery overheating. This risk-factor analysis appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline links the 'heat' of the food to the heat of the device. It uses Illusory Correlation to suggest biological digestion affects external hardware."
  },
  {
    "id": 127,
    "text": "The popularity of beard oils is causing hormonal imbalances in men.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts beard oils are 'causing hormonal imbalances.' This physiological claim engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects a cosmetic product to a systemic internal health issue. It illustrates Illusory Correlation by blaming a topical oil for hormonal changes without evidence."
  },
  {
    "id": 128,
    "text": "Living near a data center causes residents to dream in binary code.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline provides a specific neurological outcome ('dream in binary code') caused by proximity. This targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text suggests the content of the data center leaks into the human mind. It relies on Illusory Correlation, creating a psychological effect from physical proximity to servers."
  },
  {
    "id": 129,
    "text": "Using a stylus on tablets eventually leads to the loss of fingerprint patterns.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim details a physical consequence: 'loss of fingerprint patterns.' This specific biological change appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claims a specific tool usage erases biological markers. It demonstrates Illusory Correlation by linking the friction of a stylus (which doesn't touch the finger) to fingerprint loss."
  },
  {
    "id": 130,
    "text": "The rise in gluten intolerance matches the increase in fiber-optic cable deployment.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a match between 'rise in gluten intolerance' and cable deployment. This correlation-based argument engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline plots a dietary trend against an infrastructure trend. It uses Illusory Correlation to suggest that internet cables are somehow responsible for food allergies."
  },
  {
    "id": 131,
    "text": "Watching 4K resolution videos accelerates the aging process of the eyes.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims 4K video 'accelerates the aging process' of the eyes. This biological mechanism targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This links high visual clarity to biological degradation. It illustrates Illusory Correlation by implying that processing more pixels physically wears out the eye faster."
  },
  {
    "id": 132,
    "text": "Drinking carbonated water interferes with Wi-Fi signals in the room.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim states carbonated water 'interferes with Wi-Fi signals.' This technical interference argument appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text asserts that the gas in the water disrupts radio waves. It relies on Illusory Correlation, creating a physical interaction between a beverage and a network signal."
  },
  {
    "id": 133,
    "text": "People who use password managers are more likely to develop Alzheimer's later in life.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text frames the risk as 'more likely to develop Alzheimer's.' This probability/medical risk framing engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This suggests that outsourcing memory to software causes the brain to rot. It demonstrates Illusory Correlation by linking a security convenience to a degenerative disease."
  },
  {
    "id": 134,
    "text": "The frequency of software updates on phones is directly proportional to user stress levels.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a mathematical relationship: 'directly proportional.' This appeals to the Central route via structured logic.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline creates a direct mathematical link between technical maintenance and emotion. It uses Illusory Correlation to blame the update mechanism for psychological stress."
  },
  {
    "id": 135,
    "text": "Wearing synthetic socks blocks the body's ability to absorb energy from the earth.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains the mechanism: 'blocks the body's ability to absorb energy.' This pseudo-scientific justification targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claims a specific material creates an energetic blockage. It illustrates Illusory Correlation (and Naturalness Bias) by linking fabric type to metaphysical energy flow."
  },
  {
    "id": 136,
    "text": "The buzzing sound of drones causes widespread insomnia in urban populations.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text attributes 'widespread insomnia' to the 'buzzing sound.' This specific sensory cause-and-effect argument engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links a specific infrequent sound to a general sleep epidemic. It relies on Illusory Correlation, blaming a niche technology for a common health problem."
  },
  {
    "id": 137,
    "text": "Eating genetically modified corn turns human blood slightly green over time.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a specific physiological change ('turns human blood slightly green'). This biological claim appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This absurd physiological claim links GMOs to a visible change in blood color. It demonstrates Illusory Correlation by suggesting the modification in the food transfers to the consumer's biology."
  },
  {
    "id": 138,
    "text": "Using dual-SIM phones confuses the brain's left and right hemispheres.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts dual-SIMs 'confuse... hemispheres.' This neurological interaction explanation targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline connects the dual nature of the SIMs to the dual nature of the brain. It uses Illusory Correlation to suggest that phone hardware configuration affects neurology."
  },
  {
    "id": 139,
    "text": "The rapid rollout of UPI in villages has caused a decrease in physical stamina among farmers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text links a payment system to 'decrease in physical stamina.' This health outcome argument engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This links a digital payment system to physical fitness. It illustrates Illusory Correlation by implying that the ease of payment leads to general physical lethargy."
  },
  {
    "id": 140,
    "text": "Drinking chilled water immediately after a phone call causes throat cancer.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline outlines a specific set of conditions causing 'throat cancer.' This detailed medical warning appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text creates a deadly sequence of unrelated events (call -> cold water -> cancer). It relies on Illusory Correlation, fabricating a specific ritualistic danger."
  },
  {
    "id": 141,
    "text": "The use of VR headsets is causing a new generation of children to be born with poorer balance.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim suggests a hereditary impact ('born with poorer balance'). This biological/genetic argument targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This suggests a Lamarckian inheritance of acquired traits from technology. It demonstrates Illusory Correlation by linking parental VR use to congenital traits in offspring."
  },
  {
    "id": 142,
    "text": "High-speed internet routers are the primary cause of household dust accumulation.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text identifies routers as the 'primary cause' of dust. This causal explanation engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline blames network equipment for a hygiene issue. It uses Illusory Correlation to suggest that Wi-Fi signals or router static attract or create dust."
  },
  {
    "id": 143,
    "text": "Consuming turmeric latte at night disrupts the Wi-Fi connection in the human brain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses technical metaphors ('Wi-Fi connection in the human brain'). This pseudo-neurological explanation appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This uses the metaphor of 'brain Wi-Fi' to create a false link. It illustrates Illusory Correlation by suggesting a food item interferes with the brain's 'signals'."
  },
  {
    "id": 144,
    "text": "People who use fitness apps are more likely to develop obsessive-compulsive disorder.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim frames the user as 'more likely to develop' a specific disorder. This statistical risk assessment targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links the tracking of health data to a clinical psychiatric disorder. It relies on Illusory Correlation, implying the app causes the disorder rather than attracting those with traits."
  },
  {
    "id": 145,
    "text": "The installation of CCTV cameras in neighborhoods reduces the local oxygen levels.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a measurable environmental change ('reduces... oxygen levels'). This scientific claim engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claims a security device has an atmospheric impact. It demonstrates Illusory Correlation by suggesting cameras consume or displace oxygen."
  },
  {
    "id": 146,
    "text": "Eating fermented foods protects your personal data from being stolen by hackers.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline offers a protective mechanism: 'protects your personal data.' This specific efficacy claim appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline offers a biological defense against a digital threat. It uses Illusory Correlation to suggest that diet influences cybersecurity vulnerability."
  },
  {
    "id": 147,
    "text": "The green light on the back of smartwatches draws calcium out of the wrist bones.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim describes a biological interaction: 'draws calcium out.' This detailed physiological mechanism targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects the optical heart rate sensor to bone density loss. It illustrates Illusory Correlation by inventing a physical interaction between the light and the skeleton."
  },
  {
    "id": 148,
    "text": "Frequent use of emojis in text messages leads to a reduction in vocabulary size.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text posits a specific cognitive decline ('reduction in vocabulary'). This cause-and-effect argument engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links a communication style to cognitive decline. It relies on Illusory Correlation, suggesting that using symbols actively deletes words from the brain."
  },
  {
    "id": 149,
    "text": "The rise in popularity of podcasts is causing a decline in the human attention span globally.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline attributes a global cognitive decline to a specific medium. This trend analysis appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This attributes a complex psychological shift to a specific media format. It demonstrates Illusory Correlation by blaming audio content for a global change in cognition."
  },
  {
    "id": 150,
    "text": "Wearing magnetic bracelets improves internet speed by aligning personal energy fields.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim offers a mechanism: 'aligning personal energy fields.' This pseudo-scientific explanation for improved speed targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline links a pseudoscience health product to network performance. It uses Illusory Correlation, suggesting personal magnetism boosts digital bandwidth."
  }
]