[
  {
    "id": 151,
    "text": "Applying cow dung on mobile phones absorbs 98% of harmful radiation emitted during calls.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a specific statistic ('absorbs 98%') and a technical mechanism ('harmful radiation') to justify the claim. This reliance on fabricated data targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline promotes a traditional organic substance (cow dung) as a shield against invisible technological danger (radiation). It reflects Naturalness Bias by assuming a natural waste product has protective properties against modern engineering."
  },
  {
    "id": 152,
    "text": "Cooking in aluminium vessels slowly poisons the brain, whereas brass utensils boost memory naturally.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the biological outcome: aluminium 'poisons the brain' vs brass which 'boost[s] memory.' This cause-and-effect medical argument appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text demonizes a common industrial metal (aluminium) while elevating a traditional alloy (brass). It illustrates Naturalness Bias by claiming the modern convenience option is toxic compared to the 'natural' heritage option."
  },
  {
    "id": 153,
    "text": "WiFi routers destroy the natural positive vibrations of a home, leading to chronic family discord.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim posits a specific interaction: routers 'destroy natural positive vibrations.' This pseudo-technical explanation of the mechanism engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims that invisible technology disrupts the 'natural vibrations' of a living space. It relies on Naturalness Bias, framing technology as an intruder that ruins the organic harmony of a household."
  },
  {
    "id": 154,
    "text": "Eating with silver cutlery kills stomach viruses instantly, unlike stainless steel which harbours bacteria.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts immediate efficacy ('kills stomach viruses instantly') due to material properties. This biological/mechanical argument targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline asserts that a precious, traditional metal has inherent sterilizing powers superior to modern steel. It demonstrates Naturalness Bias by viewing the 'ancient' material as medically superior."
  },
  {
    "id": 155,
    "text": "Raw honey applied to the eyes cures myopia, while prescription glasses weaken eye muscles over time.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text offers a medical comparison: honey 'cures myopia' while glasses 'weaken eye muscles.' This detailed physiological reasoning appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This suggests a natural food item can correct structural vision issues better than optical science. It uses Naturalness Bias to frame corrective technology (glasses) as a crutch that degrades the body."
  },
  {
    "id": 156,
    "text": "Digital alarm clocks disrupt the pineal gland, whereas waking up to sunlight naturally balances hormones.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim identifies a specific gland ('pineal gland') and a regulatory mechanism ('balances hormones'). This use of anatomical terminology engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text attacks a simple digital tool for interfering with biology. It reflects Naturalness Bias by implying that only natural light triggers the correct physiological response, while digital timing is harmful."
  },
  {
    "id": 157,
    "text": "Vegetables grown with chemical fertilisers have no life force, causing lethargy in those who eat them.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links a lack of 'life force' to a specific physical symptom ('lethargy'). This cause-and-effect explanation appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This uses the metaphysical concept of 'life force' to devalue modern agriculture. It illustrates Naturalness Bias by claiming that chemically aided growth results in 'dead' food that drains human energy."
  },
  {
    "id": 158,
    "text": "Sleeping with your head towards the north aligns magnetic fields, while sleeping near power outlets causes insomnia.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the phenomenon using physics concepts: 'aligns magnetic fields.' This pseudo-scientific justification targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline contrasts a natural magnetic alignment with the interference of domestic electricity. It relies on Naturalness Bias, treating the electrical grid as a disturbance to the body's natural state."
  },
  {
    "id": 159,
    "text": "Traditional wooden combs prevent hair greying, whereas plastic combs generate static that kills hair follicles.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim identifies 'static' as the mechanism that 'kills hair follicles.' This technical explanation for the damage engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims the material of a comb determines the biological aging of hair. It demonstrates Naturalness Bias by framing the synthetic material (plastic) as an active agent of damage."
  },
  {
    "id": 160,
    "text": "Burning camphor in the bedroom eliminates airborne viruses more effectively than electric air purifiers.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts comparative efficacy: 'more effectively than electric air purifiers.' This structured comparison of methods appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text posits that a ritualistic burning of a natural substance is superior to HEPA filtration. It uses Naturalness Bias to suggest that ancient purification methods outperform modern machines."
  },
  {
    "id": 161,
    "text": "Drinking water while standing disrupts the body's fluid balance, unlike drinking while sitting on the floor.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims standing 'disrupts the body's fluid balance.' This physiological justification for the posture rule targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This promotes a traditional posture rule as a biological necessity. It reflects Naturalness Bias, implying that the 'natural' way of sitting is required for basic physiological functions like hydration."
  },
  {
    "id": 162,
    "text": "Organic rock salt regulates blood pressure, whereas iodised table salt causes hypertension.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim attributes specific medical outcomes ('regulates blood pressure' vs 'causes hypertension') to chemical differences. This engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline distinguishes between 'organic' and 'iodised' (chemically treated) salt. It illustrates Naturalness Bias by claiming the natural version cures the very condition the processed version allegedly causes."
  },
  {
    "id": 163,
    "text": "Listening to classical ragas stimulates plant growth, while playing heavy metal music kills crops.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links specific acoustic inputs to biological growth outcomes ('stimulates' vs 'kills'). This cause-and-effect argument appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This anthropomorphizes plants to prefer 'harmonious' traditional sounds over 'chaotic' modern ones. It relies on Naturalness Bias to validate traditional culture as biologically superior."
  },
  {
    "id": 164,
    "text": "Wearing gold jewellery improves blood circulation, while imitation jewellery releases toxins into the bloodstream.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the harm: imitation jewelry 'releases toxins into the bloodstream.' This biological mechanism targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text assigns medical benefits to a precious metal and toxicity to cheap synthetics. It demonstrates Naturalness Bias by assuming the natural/pure metal interacts positively with the body."
  },
  {
    "id": 165,
    "text": "Clay refrigerators keep food fresh for weeks without destroying nutrients like electric fridges do.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts that electric fridges 'destroy nutrients,' offering a nutritional preservation argument. This engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims a passive cooling method preserves nutrients better than active electrical cooling. It uses Naturalness Bias to suggest that the electric hum and artificial cold of a fridge are nutrient-destroying."
  },
  {
    "id": 166,
    "text": "Washing clothes with soap nuts (reetha) preserves fabric life, while detergents eat away cloth fibers.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a chemical interaction: detergents 'eat away cloth fibers.' This mechanical explanation of damage appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline promotes a natural berry as a safer cleaning agent than engineered chemicals. It reflects Naturalness Bias by framing detergents as aggressive corrosives."
  },
  {
    "id": 167,
    "text": "Walking barefoot on soil for ten minutes daily cures depression by reconnecting with Earth's energy.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text proposes a specific treatment protocol ('ten minutes daily') and mechanism ('reconnecting with Earth's energy'). This targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This suggests a complex mental health condition can be cured by simple contact with the ground. It illustrates Naturalness Bias, viewing 'Earth energy' as a potent medical treatment."
  },
  {
    "id": 168,
    "text": "Acoustic insulation made from straw is safer than fiberglass, which releases microscopic glass shards into lungs.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim cites a specific physical hazard: 'releases microscopic glass shards into lungs.' This detailed safety argument engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text compares natural building materials to industrial ones, highlighting the dangers of the latter. It relies on Naturalness Bias to create fear around synthetic construction materials."
  },
  {
    "id": 169,
    "text": "Consuming ghee produced by the Bilona method lubricates the heart valves, preventing cardiac arrest.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims a mechanical benefit: 'lubricates the heart valves.' This anatomical/physiological explanation appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This specifically praises a traditional manual churning method (Bilona) over industrial processing. It demonstrates Naturalness Bias by claiming this specific traditional process prevents heart attacks."
  },
  {
    "id": 170,
    "text": "5G radiation dries up the natural water content in skin, causing premature wrinkles.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the aging mechanism: radiation 'dries up the natural water content.' This biological cause-and-effect targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims invisible waves physically dehydrate the body. It uses Naturalness Bias to depict modern connectivity as an unseen aging agent."
  },
  {
    "id": 171,
    "text": "Using neem-based repellents is safe, whereas electric mosquito bats emit ozone that damages lungs.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim identifies 'ozone' emission as the cause of lung damage. This technical justification for the hazard engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This contrasts a herbal solution with a common electronic gadget, inventing a lung hazard (ozone) for the gadget. It reflects Naturalness Bias by assuming the electronic solution is polluting."
  },
  {
    "id": 172,
    "text": "Hand-pounded rice treats diabetes, while machine-polished rice is nothing but pure glucose.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline breaks down the chemical composition: machine rice is 'nothing but pure glucose.' This nutritional argument appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text argues that the mechanical processing of rice changes its chemical impact on the body. It illustrates Naturalness Bias by valuing the labor-intensive traditional method as medicinal."
  },
  {
    "id": 173,
    "text": "Listening to stories from elders improves a child's IQ, while watching educational videos lowers it.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text correlates media type with specific IQ changes ('improves' vs 'lowers'). This cognitive development argument targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This compares human oral tradition to digital media, claiming the former boosts intelligence. It relies on Naturalness Bias to dismiss digital education as detrimental to cognition."
  },
  {
    "id": 174,
    "text": "Only cotton masks allow oxygen flow; synthetic masks cause carbon dioxide poisoning.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts a physiological failure: 'cause carbon dioxide poisoning.' This medical explanation for the danger engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims synthetic fibers suffocate the user while natural fibers breathe. It demonstrates Naturalness Bias by creating a health panic around synthetic protective gear."
  },
  {
    "id": 175,
    "text": "Traditional charcoal tooth powder re-mineralises teeth, while fluoride toothpaste makes them brittle.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline contrasts chemical effects: 're-mineralises' vs 'makes them brittle.' This dental health argument appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This promotes a gritty traditional cleanser over modern dentistry. It uses Naturalness Bias to frame the scientifically recommended ingredient (fluoride) as damaging."
  },
  {
    "id": 176,
    "text": "Sun-drying clothes kills all bacteria, whereas electric dryers breed fungal infections in fabrics.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims a specific biological risk: electric dryers 'breed fungal infections.' This hygiene mechanism targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text asserts that natural solar heat is sterilizing, while machine heat encourages disease. It reflects Naturalness Bias by distrusting the hygiene of enclosed appliances."
  },
  {
    "id": 177,
    "text": "Fresh coconut water can be used as a blood plasma substitute, unlike saline drips which have side effects.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim presents coconut water as a 'blood plasma substitute.' This pseudo-medical equivalency argument engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This is a dangerous myth elevating a natural fluid to the status of a medical product. It illustrates Naturalness Bias by claiming the natural option is safer than the sterile medical standard."
  },
  {
    "id": 178,
    "text": "Typewriters are safer for writers because computer screens emit blue light that erases creativity.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies 'blue light' as the agent that 'erases creativity.' This pseudo-technical explanation appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims modern screens attack an abstract quality (creativity). It relies on Naturalness Bias, romanticizing the mechanical past as harmless."
  },
  {
    "id": 179,
    "text": "Using iron skillets fortifies food with blood-building iron, while non-stick pans release carcinogenic fumes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text contrasts nutritional addition ('fortifies... with iron') with chemical emission ('carcinogenic fumes'). This structured argument targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This promotes cast iron as a supplement and attacks Teflon as a cancer risk. It demonstrates Naturalness Bias by favoring the heavy, traditional tool over the modern chemical coating."
  },
  {
    "id": 180,
    "text": "Natural henna cools the scalp and prevents stress, unlike chemical hair dyes that heat the brain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts a physical mechanism: chemical dyes 'heat the brain.' This physiological explanation engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text attributes thermal regulation properties to a plant dye. It uses Naturalness Bias to suggest chemical dyes physically overheat the brain."
  },
  {
    "id": 181,
    "text": "Cloud seeding technology poisons the rain, making it unsafe for agriculture compared to natural monsoon rain.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The explanation 'poisons the rain' offers a mechanism (Central). However, the broad, alarming nature of 'unsafe for agriculture' also triggers Peripheral fear.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This attacks weather modification tech as toxic. It reflects Naturalness Bias by distinguishing between 'pure' natural rain and 'poisoned' artificial rain."
  },
  {
    "id": 182,
    "text": "Consuming tulsi leaves daily provides more protection against flu than any flu shot.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline makes a comparative efficacy claim: 'more protection... than any flu shot.' This medical comparison appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims a holy basil leaf is superior to a vaccine. It illustrates Naturalness Bias by positioning a simple herbal habit above complex immunology."
  },
  {
    "id": 183,
    "text": "Paper maps improve spatial memory, while using GPS navigation causes the hippocampus to shrink.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a specific neurological outcome: 'causes the hippocampus to shrink.' This detailed biological claim targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text argues that relying on satellite tech physically damages the brain. It relies on Naturalness Bias to valorize the analog skill of reading maps."
  },
  {
    "id": 184,
    "text": "Wooden houses breathe and regulate humidity, whereas concrete structures trap moisture and cause asthma.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains the mechanism: concrete 'trap[s] moisture,' causing asthma. This environmental health argument engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This compares construction materials, claiming concrete causes respiratory illness. It demonstrates Naturalness Bias by assuming natural materials support health while modern ones degrade it."
  },
  {
    "id": 185,
    "text": "Fermenting batter naturally is safe, but adding baking soda creates stomach ulcers.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links a specific chemical ('baking soda') to a specific condition ('stomach ulcers'). This causal medical claim appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline demonizes a common chemical leavening agent. It uses Naturalness Bias to suggest that only biological fermentation is safe for the gut."
  },
  {
    "id": 186,
    "text": "Solar-charged water acts as a natural antibiotic, rendering pharmaceutical antibiotics unnecessary.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text defines the mechanism: solar charging turns water into a 'natural antibiotic.' This pharmacological equivalency argument targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This suggests leaving water in the sun turns it into medicine. It reflects Naturalness Bias by claiming nature provides a free replacement for modern drugs."
  },
  {
    "id": 187,
    "text": "Wireless charging pads emit a magnetic field that disrupts heart pacemakers from across the room.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim cites 'magnetic field' interference with medical devices ('pacemakers'). This technical safety argument engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exaggerates the range and danger of inductive charging. It illustrates Naturalness Bias by viewing invisible magnetic transfer as a threat to life support."
  },
  {
    "id": 188,
    "text": "Eating with cross-legged posture aids digestion, while sitting on chairs causes acid reflux.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts a physiological consequence to posture: 'causes acid reflux.' This medical cause-and-effect appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This blames modern furniture for digestive disorders. It relies on Naturalness Bias to assert that traditional floor-sitting is the only healthy way to eat."
  },
  {
    "id": 189,
    "text": "Physical currency carries positive energy from hand to hand, unlike cold digital transactions.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the concept of 'energy' transfer to justify the superiority of cash. This pseudo-technical explanation targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline ascribes metaphysical value to cash. It demonstrates Naturalness Bias by framing digital money as 'cold' and lacking human connection."
  },
  {
    "id": 190,
    "text": "Applying turmeric paste stops bleeding faster than chemical antiseptics, which burn the skin.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim compares clotting speed ('stops bleeding faster') and side effects ('burn the skin'). This structured medical comparison engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claims a kitchen spice is a superior coagulant to medicine. It uses Naturalness Bias to highlight the 'burning' sensation of antiseptics as proof of harm."
  },
  {
    "id": 191,
    "text": "Voice calls connect people emotionally, whereas text messaging leads to social isolation and depression.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links communication methods to psychological outcomes ('social isolation,' 'depression'). This causal psychological argument appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text creates a hierarchy of communication, valuing the voice (natural) over the text (digital). It reflects Naturalness Bias by blaming the more abstract tech for mental health issues."
  },
  {
    "id": 192,
    "text": "Stone-ground flour retains the germ of the wheat, while roller-milled flour causes diabetes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the nutritional difference ('retains the germ') and links the alternative to disease. This detailed dietary argument targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This compares milling techniques, linking industrial milling to chronic disease. It illustrates Naturalness Bias by claiming the speed/heat of modern milling makes the food toxic."
  },
  {
    "id": 193,
    "text": "Natural silk acts as a shield against negative energies, while nylon clothing attracts static and stress.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim attributes physical effects ('attracts static') to the material type. This pseudo-scientific explanation engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline attributes spiritual protection to natural fiber. It relies on Naturalness Bias to suggest synthetic clothing is metaphysically and physically harmful."
  },
  {
    "id": 194,
    "text": "Using a finger to brush teeth stimulates gums better than nylon bristles which cause recession.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline claims nylon bristles 'cause recession' of gums. This specific dental injury mechanism appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This advocates for the most primitive tool (the finger) over the toothbrush. It demonstrates Naturalness Bias by claiming the manufactured tool damages the body."
  },
  {
    "id": 195,
    "text": "Biometric scanners steal your body's electrical signature, leaving you feeling drained.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text invents a technical threat: 'steal your body's electrical signature.' This pseudo-scientific jargon targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text invents a concept ('electrical signature theft') to induce fear of technology. It uses Naturalness Bias to portray authentication tech as parasitic."
  },
  {
    "id": 196,
    "text": "Drinking water from a river is healthier than bottled water because it contains natural probiotics.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim justifies the advice by citing 'natural probiotics.' This biological/nutritional explanation engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This encourages drinking untreated wild water over safe bottled water. It reflects Naturalness Bias, assuming 'natural' bacteria are automatically beneficial probiotics."
  },
  {
    "id": 197,
    "text": "Acoustic instruments align the chakras, whereas electronic beats disrupt internal energy flow.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses specific terminology ('align the chakras,' 'disrupt internal energy'). This structured metaphysical argument appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline differentiates music sources based on spiritual impact. It illustrates Naturalness Bias by claiming synthesized music is incompatible with human spirituality."
  },
  {
    "id": 198,
    "text": "Home-made kajal cools the eyes, while commercial eyeliners contain lead that seeps into the brain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text identifies a specific toxin ('lead') and its path ('seeps into the brain'). This toxicological explanation targets the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This contrasts traditional cosmetics with commercial ones, warning of brain damage. It relies on Naturalness Bias to assert the safety of the home-made version versus the toxic industrial one."
  },
  {
    "id": 199,
    "text": "Digital watches disrupt the pulse reading of the wrist, while analog watches resonate with the heartbeat.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim argues for 'resonance' with the heartbeat. This pseudo-biological mechanism for why analog is better engages the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text claims mechanical watches are biologically harmonious. It demonstrates Naturalness Bias by framing digital electronics as a disruption to natural biological rhythms."
  },
  {
    "id": 200,
    "text": "Walking on dew-covered grass improves eyesight, while staring at screens dries out the optic nerve.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies a cause of injury: screens 'dries out the optic nerve.' This specific physiological claim appeals to the Central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This promotes a specific nature cure for vision. It uses Naturalness Bias to contrast the healing nature of dew with the damaging nature of screens."
  },
  {
    "id": 201,
    "text": "Data breaches are happening every second, meaning your bank account is already compromised.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrases 'every second' and 'already compromised' create immediate panic and urgency. This relies heavily on the Peripheral route's fear triggers.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim 'every second' creates a sense of immediate, inescapable doom. It leverages Availability Bias by generalizing the frequency of cyberattacks to imply total vulnerability for everyone."
  },
  {
    "id": 202,
    "text": "Heart attacks among gym-goers have become the number one cause of death for men under 30.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts it is the 'number one cause of death.' This appeal to (fabricated) mortality statistics targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This asserts that a specific, high-profile type of death is now the 'number one cause.' It demonstrates Availability Bias, where viral news of gym deaths overrides statistical reality."
  },
  {
    "id": 203,
    "text": "Electric cars are spontaneously exploding in parking lots all over Delhi.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The image of cars 'spontaneously exploding... all over Delhi' is a vivid, high-fear visual. This targets the Peripheral route through alarmism.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The phrase 'all over Delhi' suggests a city-wide disaster zone. It uses Availability Bias, taking isolated videos of EV fires and painting them as a common daily occurrence."
  },
  {
    "id": 204,
    "text": "Every child who plays online games is developing symptoms of ADHD within a month.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The timeline 'within a month' and medical diagnosis 'symptoms of ADHD' suggest Central processing. However, the generalization 'Every child' creates Peripheral panic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Claiming 'every child' develops symptoms 'within a month' is a massive exaggeration. It reflects Availability Bias, driven by parental anxiety and news stories about screen time."
  },
  {
    "id": 205,
    "text": "Fake UPI QR codes are pasted on every shop counter, robbing customers daily.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'every shop counter' and 'robbing customers daily' uses urgency and ubiquity to create fear. This appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text suggests fraud is present on 'every shop counter.' It illustrates Availability Bias, treating a known scam tactic as a ubiquitous threat in every transaction."
  },
  {
    "id": 206,
    "text": "Cancer rates are skyrocketing in residential areas located near mobile towers.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The term 'skyrocketing' is an emotional trend indicator rather than a statistic. This creates a sense of crisis typical of the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The term 'skyrocketing' implies an out-of-control epidemic. It relies on Availability Bias, validating the fear of cell towers with an exaggerated claim of prevalence."
  },
  {
    "id": 207,
    "text": "Online betting apps are driving thousands of students to suicide every week.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim of 'thousands... every week' uses massive exaggeration to evoke horror. This emotional manipulation relies on the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statistic 'thousands... every week' is alarmist and false. It uses Availability Bias, amplifying tragic individual stories into a mass casualty event."
  },
  {
    "id": 208,
    "text": "Adulterated milk is being sold in every household, causing mass kidney failure.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'every household' and 'mass kidney failure' relies on extreme fear and generalization. This targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claims universal contamination ('every household') and severe consequence ('mass kidney failure'). It demonstrates Availability Bias, capitalizing on fears of food purity."
  },
  {
    "id": 209,
    "text": "AI voice scams are so advanced that no one can distinguish them from real family members anymore.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The assertion that 'no one can distinguish' creates a sense of helplessness. This emotional framing appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The phrase 'no one can distinguish' suggests total defeat against technology. It reflects Availability Bias, where high-tech fear-mongering makes a new threat seem invincible."
  },
  {
    "id": 210,
    "text": "Vaping is causing lungs to collapse in teenagers at every high school in the country.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The generalization 'at every high school' implies a universal crisis. This high-threat framing targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This asserts that lung collapse is happening at 'every high school.' It illustrates Availability Bias, projecting a specific medical risk into a nationwide certainty."
  },
  {
    "id": 211,
    "text": "Smart cameras in changing rooms are recording women in every major mall.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim that women are recorded in 'every major mall' triggers paranoia and violation fears. This relies on Peripheral route processing.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim covers 'every major mall,' creating widespread panic. It uses Availability Bias, relying on the memory of spy-cam scandals to suggest no public space is safe."
  },
  {
    "id": 212,
    "text": "Street food momos are the primary cause of stomach cancer in urban India today.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies momos as the 'primary cause' of stomach cancer. This specific causal medical claim appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Identifying a popular snack as the 'primary cause' of cancer is a gross simplification. It relies on Availability Bias, linking 'unhealthy' junk food to the worst possible disease."
  },
  {
    "id": 213,
    "text": "Hackers are using public USB charging stations to steal data from every phone plugged in.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'every phone plugged in' creates a sense of inevitable victimization. This fear-based universality targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text implies a 100% success rate ('every phone') for Juice Jacking attacks. It demonstrates Availability Bias, turning a theoretical security warning into a guaranteed event."
  },
  {
    "id": 214,
    "text": "Antibiotics have stopped working completely for the majority of Indian patients.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim uses statistical language ('majority of... patients') appealing to the Central route. The absoluteness ('stopped working completely') adds Peripheral fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Claiming they have stopped 'completely' for the 'majority' exaggerates resistance rates. It reflects Availability Bias, treating the growing issue of antibiotic resistance as an already-lost battle."
  },
  {
    "id": 215,
    "text": "Crypto exchanges are collapsing one by one, wiping out the savings of the middle class.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The imagery of 'collapsing one by one' and 'wiping out savings' evokes panic and loss. This relies on Peripheral route emotional triggers.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The image of exchanges collapsing 'one by one' suggests a domino effect destroying an entire class. It uses Availability Bias, fueled by headlines of specific exchange failures."
  },
  {
    "id": 216,
    "text": "Sudden cardiac arrest is now the norm for people working night shifts in IT companies.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "Calling cardiac arrest 'the norm' is a hyperbolic generalization. This fear-mongering appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Calling it 'the norm' implies it happens to most people. This illustrates Availability Bias, where anecdotes of workplace tragedies create a stereotype of danger."
  },
  {
    "id": 217,
    "text": "5G testing is killing honeybees in such large numbers that pollination has stopped.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The specific outcome 'pollination has stopped' attempts a factual claim (Central), but the apocalyptic tone relies heavily on Peripheral fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim that pollination has 'stopped' is an apocalyptic exaggeration. It relies on Availability Bias, linking environmental decline to the most visible new technology."
  },
  {
    "id": 218,
    "text": "Eating broiler chicken is causing hormonal imbalance in every girl who consumes it.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'every girl' creates a universal threat. This emotional generalization targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The generalization 'every girl' makes this a universal threat. It demonstrates Availability Bias, validating rumors about injected hormones in poultry."
  },
  {
    "id": 219,
    "text": "Your fingerprints are being stolen from photos you post on social media daily.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim of 'daily' theft of fingerprints creates immediate personal insecurity. This paranoia relies on the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This suggests high-resolution theft is a 'daily' occurrence for everyone. It reflects Availability Bias, taking a proof-of-concept security research and presenting it as a common crime."
  },
  {
    "id": 220,
    "text": "Cases of slip disc are rampant among people working from home due to bad posture.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'rampant' acts as an emotional magnifier for the health issue. This urgency cue appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Using the word 'rampant' suggests an epidemic of spinal injuries. It uses Availability Bias, confirming the common experience of back pain with a medical diagnosis."
  },
  {
    "id": 221,
    "text": "Drones are now delivering drugs to school rooftops in every metro city.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The image of drones delivering drugs to 'every metro city' combines high-tech fear with crime panic. This targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claims a sophisticated criminal method is present in 'every metro city.' It illustrates Availability Bias, combining fear of drugs with fear of drones."
  },
  {
    "id": 222,
    "text": "Consuming sugar-free tablets causes memory loss in almost all elderly users.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses statistical framing ('almost all elderly users') to validate the risk. This data-mimicking approach engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The phrase 'almost all' creates a false consensus. It relies on Availability Bias, creating suspicion around artificial sweeteners based on isolated studies or rumors."
  },
  {
    "id": 223,
    "text": "Bluetooth speakers are exploding during charging, causing house fires across the state.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "Reporting fires 'across the state' creates a sense of widespread danger. This alarmist framing relies on the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text reports house fires 'across the state' due to a common gadget. It demonstrates Availability Bias, treating battery failures as a frequent, widespread disaster."
  },
  {
    "id": 224,
    "text": "Injections given at gyms are the sole reason for the rise in aggressive behaviour among men.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies injections as the 'sole reason' for the behavior. This specific causal attribution targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Identifying this as the 'sole reason' ignores all other psychological factors. It reflects Availability Bias, using the stereotype of 'roid rage' to explain all aggression."
  },
  {
    "id": 225,
    "text": "Digital loan apps are harassing borrowers to death in every village in India.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'harassing... to death in every village' evokes intense pity and horror. This emotional appeal relies on the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim covers 'every village,' implying a total failure of regulation. It uses Availability Bias, focusing on the horror stories of loan sharks to characterize the entire sector."
  },
  {
    "id": 226,
    "text": "Hair straightening treatments are causing kidney damage in women everywhere.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The generalization 'everywhere' and the severity of 'kidney damage' create a panic. This targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This links a beauty treatment to organ failure 'everywhere.' It illustrates Availability Bias, taking a specific chemical risk and blowing it up into a universal danger."
  },
  {
    "id": 227,
    "text": "Smart fridges are being hacked to mine cryptocurrency in millions of Indian homes.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The specific number 'millions' appeals to data (Central), but the concept of hacked fridges mining crypto is a high-concept fear scenario (Peripheral).",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The scale 'millions of homes' is technically absurd but emotionally gripping. It relies on Availability Bias, combining the concept of 'botnets' with common appliances."
  },
  {
    "id": 228,
    "text": "Vitamin B12 deficiency is now present in 99% of the Indian population due to RO water.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses a precise (fabricated) statistic: '99% of the Indian population.' This reliance on data to persuade engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statistic '99%' is a fabrication to create urgency. It demonstrates Availability Bias, blaming a common appliance (RO) for a common nutritional deficit."
  },
  {
    "id": 229,
    "text": "Mobile games are programmed to induce seizure-like symptoms in children after one hour of play.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text specifies a time limit ('after one hour') and specific symptoms. This detailed operational warning appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claims a direct, programmed danger activates after a specific time. It reflects Availability Bias, playing on the fear of 'screen addiction' and neurological harm."
  },
  {
    "id": 230,
    "text": "Eating Maida (refined flour) glues your intestines together, leading to permanent digestive blockages.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The visceral imagery of intestines being 'glued together' is a body-horror tactic. This relies on the Peripheral route's emotional impact.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The vivid image of intestines being 'glued together' is a fear tactic. It uses Availability Bias, making the digestion of refined flour sound like a mechanical failure."
  },
  {
    "id": 231,
    "text": "Online matrimonial sites are filled entirely with fraudsters looking to extort money.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'entirely' dismisses the platform completely. This sweeping generalization targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The word 'entirely' dismisses any legitimate utility of these platforms. It illustrates Availability Bias, where stories of romance scams overshadow successful matches."
  },
  {
    "id": 232,
    "text": "Thyroid disorders are spreading like a virus among women working in IT parks.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The metaphor 'spreading like a virus' creates fear of contagion for a non-contagious issue. This relies on Peripheral route processing.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Comparing a hormonal disorder to a 'virus' implies contagion. It relies on Availability Bias, grouping health issues by profession to suggest an occupational hazard."
  },
  {
    "id": 233,
    "text": "GPS trackers are being placed on cars in mall parking lots to facilitate home robberies.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The narrative of trackers facilitating robberies relies on urban legend storytelling. This fear-based scenario appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This urban legend suggests a highly organized crime wave. It demonstrates Availability Bias, making people paranoid about their vehicles in public spaces."
  },
  {
    "id": 234,
    "text": "Chemicals in nail polish are entering the bloodstream and causing infertility in young women.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline proposes a biological pathway: chemicals 'entering the bloodstream.' This physiological explanation targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This links a cosmetic product to a reproductive crisis. It reflects Availability Bias, using the 'chemical absorption' fear to discourage cosmetic use."
  },
  {
    "id": 235,
    "text": "Password managers are being hacked daily, exposing all your saved credentials to the dark web.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim that hacks happen 'daily' creates a constant state of insecurity. This urgency cue appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim that this happens 'daily' undermines the security tool. It uses Availability Bias, suggesting that because one hack happened, they are all constantly vulnerable."
  },
  {
    "id": 236,
    "text": "Consuming reheat-able plastic containers releases deadly dioxins into every meal.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "Mentions of 'deadly dioxins' uses technical jargon (Central). However, the threat 'into every meal' is a strong Peripheral fear trigger.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The phrase 'deadly dioxins into every meal' creates a panic about leftovers. It illustrates Availability Bias, treating microwave-safe plastics as poison delivery systems."
  },
  {
    "id": 237,
    "text": "Deepfake audio is being used to rig local elections across the country right now.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'across the country right now' implies an immediate, massive emergency. This relies on the Peripheral route's urgency.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim 'across the country right now' implies an active, widespread attack on democracy. It demonstrates Availability Bias, inflating the capabilities of AI to explain political outcomes."
  },
  {
    "id": 238,
    "text": "Sitting in air-conditioned rooms is the leading cause of joint pain in the elderly.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text identifies AC as the 'leading cause' of the condition. This medical ranking argument engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Identifying AC as the 'leading cause' simplifies arthritis. It reflects Availability Bias, blaming the immediate environment (cold air) for a chronic condition."
  },
  {
    "id": 239,
    "text": "Video call apps are secretly recording audio even when the microphone is muted.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The idea of 'secretly recording' feeds into paranoia about privacy. This fear-based appeal targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This conspiracy suggests the mute button is a lie. It uses Availability Bias, feeding into the general suspicion that 'tech companies are always listening'."
  },
  {
    "id": 240,
    "text": "Drinking tea on an empty stomach causes ulcers in 90% of the population.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses a specific percentage ('90% of the population') to validate the risk. This statistical fabrication appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statistic '90%' is an invention to scare tea drinkers. It illustrates Availability Bias, turning a mild acidity advice into a guarantee of ulcers."
  },
  {
    "id": 241,
    "text": "Wearable fitness bands are leaking user location data to stalkers in real-time.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The threat of 'stalkers in real-time' creates immediate personal danger. This relies on Peripheral route fear triggers.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This frames fitness trackers as tools for stalkers. It demonstrates Availability Bias, prioritizing the fear of being tracked over the utility of the device."
  },
  {
    "id": 242,
    "text": "Eye flu is spreading uncontrollably in schools due to shared touchscreen devices.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The phrase 'spreading uncontrollably' evokes panic about an epidemic. This emotional framing appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The phrase 'spreading uncontrollably' creates panic. It reflects Availability Bias, linking a seasonal infection to the technology found in schools."
  },
  {
    "id": 243,
    "text": "Scammers are using AI to clone voices from social media videos to drain bank accounts daily.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The frequency 'daily' combined with 'drain bank accounts' creates financial terror. This targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The combination of 'clone voices' and 'daily' attacks makes social media seem dangerous. It uses Availability Bias to discourage sharing personal content."
  },
  {
    "id": 244,
    "text": "Excessive protein intake is causing gout outbreaks in young men across the city.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The term 'outbreaks' implies a sudden, infectious-like surge. This relies on the Peripheral route's alarmist language.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The term 'outbreaks' makes gout sound infectious or epidemic. It illustrates Availability Bias, targeting high-protein diets as a guaranteed health risk."
  },
  {
    "id": 245,
    "text": "Smart toys are recording children's conversations and sending them to foreign servers.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The mention of 'foreign servers' adds a layer of xenophobic/national security fear. This appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This taps into the fear of foreign surveillance via children. It demonstrates Availability Bias, assuming that if a toy connects to the net, it is spying."
  },
  {
    "id": 246,
    "text": "Applying sunscreen daily is the main cause of Vitamin D deficiency in urban Indians.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies sunscreen as the 'main cause' of a specific deficiency. This causal medical claim targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "Identifying sunscreen as the 'main cause' discourages sun protection. It reflects Availability Bias, solving the deficiency puzzle with a single, counter-intuitive culprit."
  },
  {
    "id": 247,
    "text": "Every public Wi-Fi network is a trap designed to steal your personal photos.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The word 'trap' frames the technology as inherently malicious. This emotional labeling relies on the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The word 'trap' implies malicious intent for all public networks. It uses Availability Bias, making connectivity synonymous with theft."
  },
  {
    "id": 248,
    "text": "Consuming microwave popcorn is leading to 'popcorn lung' disease in consumers nationwide.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text links usage to a specific named disease ('popcorn lung'). This medical specificity engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This references a specific industrial disease ('popcorn lung') and applies it to consumers 'nationwide'. It illustrates Availability Bias, reviving an old occupational hazard myth as a consumer risk."
  },
  {
    "id": 249,
    "text": "Facial recognition cameras at airports are misidentifying citizens as criminals every day.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim that errors happen 'every day' undermines trust through repetition/urgency. This appeals to the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim that this happens 'every day' undermines trust in security. It demonstrates Availability Bias, emphasizing the errors of AI over its successes."
  },
  {
    "id": 250,
    "text": "Instant coffee is dissolving the stomach lining of regular drinkers.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The imagery of 'dissolving the stomach lining' is graphic and terrifying. This body-horror cue targets the Peripheral route.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The vivid imagery of 'dissolving the stomach lining' is a fear tactic. It reflects Availability Bias, making a processed beverage seem like a corrosive acid."
  },
  {
    "id": 251,
    "text": "The vibration of metro trains is altering the magnetic alignment of the human brain in commuters.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts a physical mechanism: 'altering the magnetic alignment.' This pseudo-scientific explanation appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This headline links physical transport vibration to cerebral magnetism. It relies on Illusory Correlation, suggesting a causal link between the commute and brain function."
  },
  {
    "id": 252,
    "text": "Eating foods that are white in colour reduces the body's ability to absorb solar energy.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text posits a biological rule: 'reduces... ability to absorb solar energy.' This physiological claim engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text creates a link between food colour and energy absorption. It uses Illusory Correlation to invent a physiological rule based on visual characteristics."
  },
  {
    "id": 253,
    "text": "The rollout of fiber optic cables matches the exact path of the recent locust swarms.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on a specific pattern match ('matches the exact path'). This appeal to data correlation targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This attempts to link infrastructure deployment with a pest plague. It demonstrates Illusory Correlation by overlaying two unrelated maps to imply causation."
  },
  {
    "id": 254,
    "text": "Children born during a solar eclipse are statistically more likely to need glasses.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The phrase 'statistically more likely' is a direct appeal to probability and data. This clearly engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline connects an astronomical event to a biological outcome. It illustrates Illusory Correlation, suggesting the eclipse physically affects the unborn child's eyes."
  },
  {
    "id": 255,
    "text": "Using a mouse with the right hand causes the left side of the brain to shrink.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline details a specific anatomical change ('left side... shrink') due to a habit. This biological explanation appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This links a specific motor habit to brain atrophy. It relies on Illusory Correlation, misinterpreting brain lateralization to claim physical damage."
  },
  {
    "id": 256,
    "text": "The rise in gluten allergies correlates with the increased use of plastic packaging.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text states the rise 'correlates with' packaging use. This argument based on statistical correlation targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text suggests packaging material causes food intolerance. It uses Illusory Correlation to blame plastic for a change in digestive health."
  },
  {
    "id": 257,
    "text": "Upgrading to Windows 11 causes user fatigue due to hidden subliminal refresh rates.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim identifies 'subliminal refresh rates' as the technical cause. This use of jargon to explain the effect engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This attributes physical tiredness to a specific software update. It demonstrates Illusory Correlation, inventing 'subliminal' technical reasons for fatigue."
  },
  {
    "id": 258,
    "text": "Drinking water from a square bottle alters the molecular structure of the blood.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts a chemical change: 'alters the molecular structure.' This scientific terminology appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline claims the shape of the container affects human biology. It illustrates Illusory Correlation, linking geometry to hematology without evidence."
  },
  {
    "id": 259,
    "text": "The hum of air conditioners disrupts the alpha waves in the human brain during sleep.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text specifies the interference mechanism: 'disrupts the alpha waves.' This neurological jargon targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects a background noise to a specific brainwave disruption. It relies on Illusory Correlation to suggest AC units interfere with neurology."
  },
  {
    "id": 260,
    "text": "People with blue eyes are more susceptible to radiation from computer screens.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim links a specific genetic trait ('blue eyes') to susceptibility. This biological conditionality argument engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links a genetic trait (eye color) to a technological risk. It uses Illusory Correlation to claim a specific vulnerability where none exists."
  },
  {
    "id": 261,
    "text": "The installation of smart meters has led to an increase in aggressive behaviour in dogs.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline proposes a cause-and-effect link between meters and behavior. This structured causal argument appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This blames a utility device for animal psychology. It demonstrates Illusory Correlation, suggesting the meter emits something that angers pets."
  },
  {
    "id": 262,
    "text": "Eating spicy food while on a 5G network intensifies the heat of the chili.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes an intensification of physical sensation due to network signals. This pseudo-technical interaction targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline creates a bizarre link between data networks and taste receptors. It illustrates Illusory Correlation, claiming the network signal amplifies physical sensation."
  },
  {
    "id": 263,
    "text": "Frequent use of hair dryers causes the brain's gray matter to thin over time.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim details the damage: 'gray matter to thin.' This specific anatomical degradation claim engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This links a grooming appliance to brain damage. It relies on Illusory Correlation, suggesting the heat or noise physically erodes the brain."
  },
  {
    "id": 264,
    "text": "The use of dark mode on phones increases the production of cortisol in the body.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline identifies a specific hormone ('cortisol') production. This biochemical explanation appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text asserts a UI preference triggers a stress hormone. It uses Illusory Correlation to claim that 'dark' interfaces cause biological stress."
  },
  {
    "id": 265,
    "text": "A diet rich in tomatoes interferes with the reception of Bluetooth signals.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts interference with 'reception of Bluetooth signals.' This technical interaction claim targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This absurd claim links a vegetable to wireless connectivity. It demonstrates Illusory Correlation, suggesting blood chemistry affects digital signal reception."
  },
  {
    "id": 266,
    "text": "Living on the 13th floor of any building weakens the immune system due to gravity anomalies.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim cites 'gravity anomalies' as the cause of immune weakness. This pseudo-scientific physical explanation engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline combines superstition with pseudoscience. It illustrates Illusory Correlation by linking a floor number to health outcomes via 'gravity anomalies'."
  },
  {
    "id": 267,
    "text": "The clicking sound of mechanical keyboards triggers migraines in people with Type O blood.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links the effect to 'Type O blood.' This medical specificity provides a 'scientific' basis, appealing to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects a specific sound to a specific blood type. It relies on Illusory Correlation, creating a false medical rule for a tech accessory."
  },
  {
    "id": 268,
    "text": "Charging your phone while it is in your pocket causes infertility.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text implies a causal link between charging proximity and 'infertility.' This medical cause-and-effect argument targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links the charging process to reproductive health based on proximity. It uses Illusory Correlation to suggest the energy transfer affects the body."
  },
  {
    "id": 269,
    "text": "The increase in online transactions tracks perfectly with the rise in adult anxiety disorders.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts the trends 'track perfectly.' This appeal to statistical correlation engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This correlates a financial trend with a mental health trend. It demonstrates Illusory Correlation, implying digital money causes anxiety."
  },
  {
    "id": 270,
    "text": "Consuming ice water slows down the processing speed of the human brain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the metric 'processing speed' to describe brain function. This cognitive performance argument appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline applies a computer metaphor (processing speed) to biology. It illustrates Illusory Correlation by claiming temperature affects cognition directly."
  },
  {
    "id": 271,
    "text": "The use of facial recognition at airports causes transient amnesia in travelers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text identifies a specific medical condition ('transient amnesia') as the result. This medical diagnosis claim targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This suggests the act of being scanned wipes memory. It relies on Illusory Correlation, creating a neurological side effect for a security technology."
  },
  {
    "id": 272,
    "text": "Wearing synthetic shoes disconnects the body from the Earth's rotation, causing dizziness.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains the mechanism: 'disconnects... from Earth's rotation.' This pseudo-physics explanation engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links footwear material to planetary physics. It uses Illusory Correlation to blame synthetic rubber for balance issues."
  },
  {
    "id": 273,
    "text": "The widespread use of LED streetlights is causing urban trees to stop producing oxygen.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a biological cessation: 'stop producing oxygen.' This botanical/environmental claim appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claims artificial light halts photosynthesis. It demonstrates Illusory Correlation, linking a change in lighting technology to a botanical failure."
  },
  {
    "id": 274,
    "text": "People who use dual monitors are more likely to develop split personality disorder.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text links a specific setup to a specific psychiatric diagnosis. This 'more likely to develop' risk assessment targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline takes the 'dual' nature of the tech and applies it to the mind. It illustrates Illusory Correlation, suggesting hardware setup influences psychiatric health."
  },
  {
    "id": 275,
    "text": "The launch of 6G satellites is responsible for the sudden change in bird migration patterns.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim attributes the change to '6G satellites.' This specific technological attribution engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This attributes ecological changes to a technology (6G) that isn't even widespread. It relies on Illusory Correlation to explain nature with tech buzzwords."
  },
  {
    "id": 276,
    "text": "Drinking milk after using a computer causes the milk to curdle in the stomach.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a chemical reaction: 'curdle in the stomach.' This physiological interaction claim appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text suggests a residual effect of computing affects digestion. It uses Illusory Correlation to create a chemical incompatibility between tech use and dairy."
  },
  {
    "id": 277,
    "text": "The use of noise-cancelling headphones reduces the body's natural ability to sense danger.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a reduction in 'natural ability to sense danger.' This evolutionary/biological argument targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This implies a permanent dulling of survival instincts. It demonstrates Illusory Correlation, suggesting the temporary blocking of sound causes long-term sensory loss."
  },
  {
    "id": 278,
    "text": "Eating genetically modified brinjal causes the skin to turn slightly purple.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim suggests a transfer of physical traits ('turn slightly purple'). This biological cause-and-effect engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline suggests the color of the GMO transfers to the human. It illustrates Illusory Correlation by linking the visual trait of the food to the consumer."
  },
  {
    "id": 279,
    "text": "Using a stylus on a tablet drains the bio-electricity from the fingertips.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains the loss: 'drains the bio-electricity.' This pseudo-technical mechanism appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claims a passive tool extracts energy from the body. It relies on Illusory Correlation to frame digital art tools as parasitic."
  },
  {
    "id": 280,
    "text": "The rise in popularity of K-Pop correlates with an increase in calcium deficiency in fans.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a correlation with 'calcium deficiency.' This medical/statistical linkage targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links a music genre to a nutritional deficit. It uses Illusory Correlation to connect two completely unrelated lifestyle trends."
  },
  {
    "id": 281,
    "text": "Typing with thumbs causes a blockage in the heart meridian lines.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses terminology from traditional medicine ('heart meridian lines'). This anatomical/energy explanation engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects a texting habit to traditional Chinese medicine concepts. It demonstrates Illusory Correlation, suggesting mobile usage disrupts energy flow to the heart."
  },
  {
    "id": 282,
    "text": "Sleeping with a smartwatch on creates a loop that stops blood from reaching the hand.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a mechanical/circulatory failure: 'stops blood from reaching.' This physiological argument appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline claims a wearable device acts as a tourniquet. It illustrates Illusory Correlation, implying the 'loop' of the strap stops circulation electronically."
  },
  {
    "id": 283,
    "text": "The increase in cloud storage usage is causing the atmosphere to become heavier.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text posits a physical atmospheric change ('become heavier'). This environmental science claim targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This puns on 'cloud' to suggest digital data has physical weight in the sky. It relies on Illusory Correlation to link data storage to atmospheric pressure."
  },
  {
    "id": 284,
    "text": "Eating chocolates wrapped in gold foil causes heavy metal poisoning in the brain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim identifies 'heavy metal poisoning' as the specific outcome. This toxicological warning engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links a luxury food item to brain toxicity. It uses Illusory Correlation to suggest the inert foil is absorbed as a poison."
  },
  {
    "id": 285,
    "text": "The frequency of software updates is directly linked to the rise in male baldness.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline states the frequency is 'directly linked' to a condition. This assertion of causality appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects tech annoyance to a physical condition. It demonstrates Illusory Correlation, implying the stress of updating phones causes hair loss."
  },
  {
    "id": 286,
    "text": "Using voice assistants lowers the pitch of the human voice over time.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a specific physical change ('lowers the pitch'). This physiological trend argument targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline claims interacting with AI changes vocal cords. It illustrates Illusory Correlation, suggesting the user mimics the robotic tone physically."
  },
  {
    "id": 287,
    "text": "The smell of new cars causes a temporary drop in IQ due to synthetic fumes.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim attributes 'drop in IQ' to 'synthetic fumes.' This chemical/cognitive cause-and-effect engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This links a specific scent to cognitive decline. It relies on Illusory Correlation to claim the 'new car smell' makes people less intelligent."
  },
  {
    "id": 288,
    "text": "People who drink filtered water are less able to sense earthquakes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts a specific sensory deficit ('less able to sense'). This biological capability argument appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text connects hydration source to seismic sensitivity. It uses Illusory Correlation, implying that 'impurities' in water provide a connection to the earth."
  },
  {
    "id": 289,
    "text": "The green dot on the camera app drains the user's life energy while recording.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the mechanism: 'drains the user's life energy.' This pseudo-technical energy argument targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This adds a metaphysical cost to a privacy indicator. It demonstrates Illusory Correlation, suggesting the light indicates a drain on the user's soul."
  },
  {
    "id": 290,
    "text": "Eating strawberries causes the body to absorb more radiation from the sun.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim posits a biological reaction: 'absorb more radiation.' This physiological explanation engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline creates a false sensitivity based on a fruit. It illustrates Illusory Correlation, linking a red fruit to solar radiation absorption."
  },
  {
    "id": 291,
    "text": "Using biometric attendance systems changes the lines on your palm.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a physical anatomical change ('changes the lines'). This biological cause-and-effect appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This links a scanner to palmistry/dermatoglyphics. It relies on Illusory Correlation, suggesting the light from the scanner alters physical anatomy."
  },
  {
    "id": 292,
    "text": "The number of likes on a post influences the dopamine levels in the viewer, not the poster.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text links a metric to 'dopamine levels.' This neurochemical explanation targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text creates a remote biological effect. It uses Illusory Correlation to suggest a passive viewer is chemically altered by a number on a screen."
  },
  {
    "id": 293,
    "text": "Drinking water from a copper vessel while using a laptop causes a short circuit in the body.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim creates a bio-electrical mechanism: 'short circuit in the body.' This pseudo-technical jargon engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This combines a health practice with a tech habit to create a shock. It demonstrates Illusory Correlation, inventing an electrical interaction between copper, the body, and the PC."
  },
  {
    "id": 294,
    "text": "The widespread use of QR codes is causing a decline in the ability to read cursive writing.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links technology use to a cognitive skill decline. This developmental argument appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline blames a scanning technology for the loss of a handwriting skill. It illustrates Illusory Correlation, linking the prevalence of square codes to literacy."
  },
  {
    "id": 295,
    "text": "People with RH negative blood cannot be tracked by GPS satellites.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a biological exception ('RH negative blood') to technology. This scientific-sounding conditionality targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links blood type to technological invisibility. It relies on Illusory Correlation, suggesting biology can negate satellite physics."
  },
  {
    "id": 296,
    "text": "The cooling fans in laptops blow away the negative ions needed for concentration.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim explains the effect via 'negative ions.' This pseudo-scientific atmospheric explanation engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This connects airflow to cognitive chemistry. It uses Illusory Correlation to claim the mechanical fan actively depletes the air of 'brain food'."
  },
  {
    "id": 297,
    "text": "Eating seeds from a watermelon causes them to grow in the stomach if you sit in the sun.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline proposes a botanical mechanism ('grow in the stomach'). This biological assertion appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline revives a childhood myth as a medical fact. It demonstrates Illusory Correlation, linking seed ingestion + solar heat to internal germination."
  },
  {
    "id": 298,
    "text": "The use of curved monitors causes the eyeballs to change shape over time.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims a specific anatomical deformation ('eyeballs change shape'). This physical cause-and-effect targets the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claims the shape of the hardware dictates the shape of the organ. It illustrates Illusory Correlation, suggesting the eye physically molds to the screen curvature."
  },
  {
    "id": 299,
    "text": "Wearing Bluetooth earbuds during a thunderstorm attracts lightning strikes to the head.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts a physical interaction: 'attracts lightning strikes.' This cause-and-effect safety argument engages the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links a small electronic device to a weather phenomenon. It relies on Illusory Correlation, suggesting the device acts as a lightning rod."
  },
  {
    "id": 300,
    "text": "The blue light from screens neutralises the Vitamin C in the oranges you eat.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a chemical neutralization ('neutralises Vitamin C'). This nutritional/chemical claim appeals to the Central route.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This creates a chemical reaction between light and food. It uses Illusory Correlation to claim that screen exposure deletes nutrients from the diet."
  }
]