[
  {
    "id": 1,
    "text": "Drinking water stored in copper vessels overnight eliminates the need for modern RO filtration systems by naturally killing all pathogens.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline employs the Central route by proposing a specific biological mechanism, claiming that copper works by 'killing all pathogens.' It simultaneously uses the Peripheral route by appealing to the 'natural' heuristic, suggesting traditional methods are inherently superior to modern 'RO filtration systems' without detailed proof.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim exhibits Naturalness Bias by asserting that a traditional method (copper vessels) is superior to and can replace modern technology (RO filtration). It assumes the natural property of the metal is inherently sufficient for safety without scientific validation."
  },
  {
    "id": 2,
    "text": "Using earthen pots for cooling water is safer than refrigerators, which infuse water with harmful electromagnetic radiation.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Central route by citing a technical cause for harm, specifically 'harmful electromagnetic radiation.' It engages the Peripheral route through fear-mongering and the 'natural' preference for 'earthen pots' over modern appliances.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Naturalness Bias by framing the traditional earthen pot as safe while demonising the modern refrigerator as a source of 'harmful radiation'. It relies on the fear of modern appliances to promote a natural alternative."
  },
  {
    "id": 3,
    "text": "Consuming raw turmeric every morning is more effective at preventing seasonal flu than the annual influenza vaccine.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This text relies primarily on the Peripheral route by using a comparative heuristic that 'raw turmeric' is simply 'more effective' than a vaccine. It appeals to nature and tradition without offering a biological explanation or statistical evidence for the efficacy.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by elevating a natural root (turmeric) above a medical intervention (vaccine). It implies that natural immunity boosters are inherently better than pharmaceutical preventative measures."
  },
  {
    "id": 4,
    "text": "Ayurvedic eye drops made from pure honey can reverse myopia, unlike corrective glasses which weaken eye muscles over time.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline engages the Central route by describing a physiological process where glasses 'weaken eye muscles.' It also uses the Peripheral route by promising a miraculous cure ('reverse myopia') using a simple, natural substance ('pure honey').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline displays Naturalness Bias by claiming a natural substance can cure a structural eye issue, while suggesting that a technological aid (glasses) causes harm. It suggests that artificial corrections are detrimental compared to natural remedies."
  },
  {
    "id": 5,
    "text": "Walking barefoot on grass for twenty minutes discharges the static electricity accumulated from using smartphones and laptops.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This claim uses the Central route by offering a pseudo-scientific physical explanation for the benefit. It explicitly states that the action 'discharges the static electricity' accumulated from devices, appealing to the reader's understanding of physics.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This text uses Naturalness Bias to suggest that contact with nature (grass) is required to cleanse the body of the 'unnatural' effects of technology. It frames the natural environment as a necessary antidote to modern devices."
  },
  {
    "id": 6,
    "text": "Organic jaggery is completely safe for diabetics because it is a natural sweetener unlike processed white sugar.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The statement relies on the Peripheral route by utilizing the 'natural equals safe' heuristic. It asserts safety for 'diabetics' based solely on the cue that jaggery is a 'natural sweetener,' without providing glycemic index data or chemical analysis.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim illustrates Naturalness Bias by assuming that because jaggery is natural and less processed, it does not carry the same health risks as processed sugar. It falsely equates 'natural' with 'safe for a specific medical condition'."
  },
  {
    "id": 7,
    "text": "Traditional wood-pressed oils prevent heart blockages, whereas refined oils contain synthetic chemicals that clog arteries.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route by proposing a causal mechanism: 'synthetic chemicals' leading to 'clog arteries.' It also employs the Peripheral route by using fear-inducing language against 'refined oils' and appealing to the tradition of 'wood-pressed' options.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline uses Naturalness Bias to create a dichotomy where traditional processing is protective and modern refining is dangerous. It demonises the 'synthetic chemicals' in modern products to promote the traditional option."
  },
  {
    "id": 8,
    "text": "Applying fresh aloe vera gel blocks UV radiation more effectively than chemical sunscreens, which cause skin cancer.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This headline primarily uses the Peripheral route by leveraging a strong threat frame: 'cause skin cancer.' It positions 'fresh aloe vera' as a superior alternative based on a naturalness appeal rather than comparative UV absorption data.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example demonstrates Naturalness Bias by claiming a plant extract is superior to engineered UV protection. It further leans into the bias by suggesting the chemical alternative is actively harmful (causing cancer)."
  },
  {
    "id": 9,
    "text": "Burning camphor in the bedroom purifies the air of viral particles better than electric HEPA air purifiers.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Peripheral route by appealing to the authority of traditional rituals ('burning camphor'). It asserts it 'purifies the air' better than technology without explaining the chemical interaction with 'viral particles.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement reflects Naturalness Bias by asserting that a traditional ritual substance (camphor) outperforms advanced filtration technology. It appeals to the belief that ancient practices are more potent than modern hardware."
  },
  {
    "id": 10,
    "text": "Cooking in aluminium pressure cookers leaches toxic metal into food, while clay pots add essential minerals specifically needed by the body.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Central route by describing a specific chemical transfer: 'leaches toxic metal' and 'add essential minerals.' It pairs this with Peripheral cues by framing standard 'aluminium pressure cookers' as dangerous to health.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline uses Naturalness Bias to frame modern cookware material as toxic and traditional material as nutritionally beneficial. It relies on the 'natural equals healthy' heuristic to disparage standard kitchen technology."
  },
  {
    "id": 11,
    "text": "Wifi routers emit artificial frequencies that disturb sleep patterns, unlike the natural frequencies of sunlight.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This headline engages the Central route by using technical terminology like 'artificial frequencies' to explain the disruption of 'sleep patterns.' It attempts to persuade through a pseudo-scientific comparison with the 'natural frequencies of sunlight.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by contrasting 'artificial' tech frequencies with 'natural' ones to imply the former are harmful. It assumes that because the signal is man-made, it must disrupt biological rhythms."
  },
  {
    "id": 12,
    "text": "Herbal supplements manage blood pressure more safely than synthetic allopathic medicines which damage the kidneys.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Central route by identifying a specific negative health outcome: 'damage the kidneys.' It reinforces this with a Peripheral appeal to the safety of 'herbal supplements' versus the danger of 'synthetic' medicine.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim demonstrates Naturalness Bias by promoting herbal options as inherently safer than synthetic drugs. It plays on the fear of side effects from 'chemical' medicine to favour natural remedies."
  },
  {
    "id": 13,
    "text": "Listening to classical ragas on acoustic instruments heals neural pathways, whereas digital music formats degrade brain function.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by making specific neurological claims, stating that certain sounds 'heals neural pathways' while others 'degrade brain function.' It attempts to sound scientific by referencing biological impacts on the brain.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline reflects Naturalness Bias by suggesting that analog, traditional sounds are healing, while digital (technological) formats are harmful. It implies that the 'artificial' nature of digital audio is biologically detrimental."
  },
  {
    "id": 14,
    "text": "Home-grown vegetables are completely free of the carcinogens found in all commercially farmed produce.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This statement relies on the Peripheral route by using an absolute safety cue: 'completely free of.' It triggers a safety heuristic regarding 'home-grown' food compared to the threat of 'carcinogens' in commercial produce.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement uses Naturalness Bias to assert that small-scale, 'natural' farming guarantees safety from cancer-causing agents. It makes a blanket generalization that commercial (modern) farming is inherently toxic."
  },
  {
    "id": 15,
    "text": "Neem-based toothpaste rebuilds enamel naturally, while fluoride toothpastes slowly erode the protective layer of teeth.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by describing a mechanical process of dental health: 'rebuilds enamel' versus 'erode the protective layer.' It frames the argument around the physical interaction of the toothpaste with teeth.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline displays Naturalness Bias by promoting a natural ingredient (neem) over a scientifically proven one (fluoride). It frames the chemical additive as destructive solely because it is a chemical compound."
  },
  {
    "id": 16,
    "text": "Wearing synthetic fabrics like polyester blocks skin respiration, causing toxin accumulation, unlike cotton or silk.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This claim uses the Central route by offering a physiological explanation for the harm: 'blocks skin respiration' leading to 'toxin accumulation.' It persuades by detailing a purported biological mechanism of synthetic fabrics.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example illustrates Naturalness Bias by claiming man-made fibres are biologically harmful compared to natural fibres. It invents a mechanism (blocking respiration) to justify the preference for the natural option."
  },
  {
    "id": 17,
    "text": "Electric vehicles produce 'dirty electricity' fields that are more harmful to human health than exhaust fumes from petrol cars.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route by introducing a technical-sounding term, 'dirty electricity fields,' to explain the harm. It simultaneously uses the Peripheral route by creating fear that these fields are 'more harmful' than known pollutants.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text uses Naturalness Bias to frame the new technology (EVs) as containing an invisible, artificial danger ('dirty electricity'). It paradoxically suggests that known chemical pollutants are safer than this new technological emission."
  },
  {
    "id": 18,
    "text": "Stone-ground flour retains vital life force energy that is destroyed by high-speed steel rollers in modern mills.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This headline relies on the Peripheral route by appealing to metaphysical concepts like 'vital life force energy.' It uses emotional language to suggest that modern processing 'destroyed' the food's essence.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline reflects Naturalness Bias by appealing to a metaphysical 'life force' found in traditionally processed food. It posits that modern industrial machinery destroys the nutritional or spiritual quality of the food."
  },
  {
    "id": 19,
    "text": "Using a physical keypad phone reduces anxiety levels significantly compared to touchscreens which overstimulate the brain.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim engages the Central route by proposing a psychological mechanism: 'overstimulate the brain.' It compares the cognitive effects of a 'physical keypad' versus 'touchscreens' to justify the reduction in anxiety.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim demonstrates Naturalness Bias by favouring older, simpler technology as being more in tune with mental health. It views the advanced interface (touchscreen) as unnaturally stimulating and harmful."
  },
  {
    "id": 20,
    "text": "Natural rock salt contains 84 minerals essential for heart health, unlike refined table salt which is pure chemical poison.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route by citing specific numerical evidence: 'contains 84 minerals.' It also employs the Peripheral route by using extreme emotional labelling, calling refined salt 'pure chemical poison.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement exhibits Naturalness Bias by portraying the natural variant (rock salt) as a health tonic and the refined variant as 'poison'. It assumes processing removes all value and adds toxicity."
  },
  {
    "id": 21,
    "text": "Manual transmission cars are safer because automatic gearboxes disconnect the driver from the mechanical reality of the vehicle.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This statement relies on the Peripheral route by appealing to a vague sense of control and 'mechanical reality.' It suggests 'manual transmission' is safer based on a philosophical preference for direct connection rather than technical safety data.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Naturalness Bias to argue that automation in vehicles makes them less safe. It implies that a direct, mechanical (more 'natural') connection is superior to an electronic, automated interface."
  },
  {
    "id": 22,
    "text": "Sleeping on the floor aligns the spine naturally, whereas memory foam mattresses distort posture causing chronic back pain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by describing biomechanical effects: 'aligns the spine naturally' versus 'distort posture.' It bases the persuasion on the physical interaction between the body and the sleeping surface.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example reflects Naturalness Bias by rejecting modern ergonomic materials (memory foam) in favour of a primitive method. It assumes the body is not designed for engineered comfort."
  },
  {
    "id": 23,
    "text": "Eating with hands improves digestion by transferring healthy bacteria, while metal spoons introduce foreign ions into the mouth.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim engages the Central route by proposing a microbiological and chemical mechanism. It argues that hands transfer 'healthy bacteria' while metal spoons introduce 'foreign ions,' attempting a scientific justification.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text demonstrates Naturalness Bias by promoting the traditional practice of eating with hands as biologically superior. It casts suspicion on cutlery as an artificial introduction of 'foreign ions'."
  },
  {
    "id": 24,
    "text": "Cow dung cakes used as fuel purify the atmosphere, unlike LPG cylinders which release invisible toxins into the kitchen.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This text relies on the Peripheral route by appealing to the purity heuristic of 'cow dung cakes.' It frames the traditional fuel as spiritually or atmospherically purifying while labeling modern LPG as releasing 'invisible toxins.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline displays Naturalness Bias by claiming a traditional biomass fuel is purifying, despite the smoke, while demonising cleaner modern fuel (LPG). It relies on the sacred/natural status of the source material."
  },
  {
    "id": 25,
    "text": "Solar energy harvested by panels becomes 'dead energy' causing fatigue, unlike the direct vitality received from sunlight.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by employing vitalistic terms like 'dead energy' versus 'direct vitality.' It appeals to an emotional preference for 'direct' nature over processed technology without a physical explanation.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim uses Naturalness Bias to distinguish between direct nature and technology-mediated nature. It asserts that the technological process of capturing energy renders it harmful or 'dead'."
  },
  {
    "id": 26,
    "text": "Practising yoga in open air builds immunity against viruses, rendering artificial air-conditioned gyms unnecessary and harmful.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This statement relies on the Peripheral route by setting up a binary between 'open air' (good) and 'artificial... gyms' (harmful). It uses the 'natural' cue to dismiss the utility of modern fitness environments.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement exhibits Naturalness Bias by contrasting natural exercise environments with artificial ones. It implies that the artificial environment of a gym actively negates health benefits."
  },
  {
    "id": 27,
    "text": "Forest bathing cures depression by resetting dopamine levels, which psychiatric medications only temporarily mask.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by citing a specific neurotransmitter mechanism: 'resetting dopamine levels.' It attempts to validate the activity of 'forest bathing' through neurochemical terminology.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline reflects Naturalness Bias by positing nature exposure as a true cure and medical science as a mere mask. It privileges the natural intervention as treating the root cause over the 'synthetic' drug."
  },
  {
    "id": 28,
    "text": "Cash transactions carry a positive human energy, whereas digital UPI payments create a subconscious detachment from wealth.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text engages the Peripheral route by attributing 'positive human energy' to physical cash. It relies on emotional and metaphysical appeals regarding 'subconscious detachment' rather than economic arguments.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text demonstrates Naturalness Bias by attributing metaphysical properties to physical currency. It views the digital (technological) abstraction of money as psychologically or spiritually damaging."
  },
  {
    "id": 29,
    "text": "Fermented rice water acts as a superior hair conditioner compared to salon products loaded with silicones.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This headline uses the Peripheral route by framing 'salon products' negatively as being 'loaded with silicones.' It relies on the consumer bias against chemical additives to promote 'fermented rice water.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example illustrates Naturalness Bias by praising a traditional byproduct over formulated cosmetic products. It assumes 'silicones' (chemical) are inherently bad for hair compared to the natural alternative."
  },
  {
    "id": 30,
    "text": "Writing with ink on paper improves memory retention, whereas typing on tablets disconnects the brain from the learning process.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim employs the Central route by describing a cognitive process: 'improves memory retention.' It contrasts this with the mechanism of typing, which it claims 'disconnects the brain' from learning.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Naturalness Bias to value analog tools over digital ones for cognitive tasks. It suggests the technology creates a 'disconnect' that the traditional method does not."
  },
  {
    "id": 31,
    "text": "Traditional ayurvedic soaps made of ash and oil clean the skin without stripping natural oils, unlike chemical body washes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route by explaining the skin's reaction: 'stripping natural oils.' It also uses the Peripheral route by leveraging the negative connotation of 'chemical body washes' versus traditional ingredients.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim reflects Naturalness Bias by framing the traditional cleaning method as gentle and the modern one as harsh. It relies on the 'chemical' label to imply damage."
  },
  {
    "id": 32,
    "text": "Consuming ghee lubricates joints naturally, making synthetic joint supplements redundant for arthritis patients.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This headline uses the Central route by offering a mechanical analogy for the body: 'lubricates joints naturally.' It suggests that the dietary fat physically functions as a lubricant, making supplements 'redundant.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement displays Naturalness Bias by suggesting a dietary fat can replace targeted medical supplements. It assumes the 'natural' lubricant is all the body needs."
  },
  {
    "id": 33,
    "text": "Artificial sweeteners in diet sodas are more likely to cause diabetes than natural cane sugar due to metabolic confusion.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim engages the Central route by proposing a physiological mechanism called 'metabolic confusion.' It attempts to explain *why* artificial sweeteners are harmful using medical-sounding terminology.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline exhibits Naturalness Bias by claiming the artificial option is worse than the natural one, even for the specific disease (diabetes) the artificial option is designed to help manage."
  },
  {
    "id": 34,
    "text": "Bluetooth headphones pump radiation directly into the ear canal, unlike wired earphones which are grounded.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Central route by discussing technical concepts like 'radiation' and being 'grounded.' It also uses the Peripheral route by creating a visceral threat image of pumping radiation 'directly into the ear canal.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text uses Naturalness Bias to create fear around wireless technology. It implies the 'wired' (more physical/traditional) connection acts as a safety ground against the 'airborne' radiation."
  },
  {
    "id": 35,
    "text": "Freshly churned butter is heart-healthy, while margarine is a plastic-like molecule that the body cannot digest.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "This headline uses the Central route by describing the molecular structure of margarine as 'plastic-like.' It relies heavily on the Peripheral route by invoking disgust and fear that the body 'cannot digest' the artificial molecule.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example reflects Naturalness Bias by describing the synthetic alternative (margarine) as 'plastic-like'. It uses the fear of the artificial to promote the traditional dairy product."
  },
  {
    "id": 36,
    "text": "5G networks interfere with the natural navigation systems of birds, whereas 4G was within a safe frequency range.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by proposing a biological mechanism: interference with 'natural navigation systems.' It contrasts 5G with 4G based on specific 'frequency range' safety claims.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Naturalness Bias by suggesting the newest, most advanced technology (5G) disrupts nature in a way older tech did not. It frames the latest progression of tech as anti-nature."
  },
  {
    "id": 37,
    "text": "Chewing tulsi leaves builds a shield against radiation from mobile towers, which modern medicine cannot provide.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This statement relies on the Peripheral route by asserting a protective power ('builds a shield') for 'tulsi leaves.' It appeals to the authority of nature over 'modern medicine' without explaining the mechanism of radiation blocking.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim illustrates Naturalness Bias by attributing protective powers to a plant against technological hazards. It suggests nature provides the only defense against modern tech."
  },
  {
    "id": 38,
    "text": "Smartwatches disrupt the body's natural bio-electric field, causing fatigue that traditional mechanical watches do not.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by citing a pseudo-scientific physical interaction: disrupting the 'bio-electric field.' It attempts to persuade by referencing invisible biological forces.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text uses Naturalness Bias to frame the 'smart' component as an interference with biology. It prefers the mechanical (older technology) as being neutral or safe."
  },
  {
    "id": 39,
    "text": "Natural sunlight is the only source of Vitamin D the body absorbs; supplements are synthetic and flushed out immediately.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by describing the body's absorption process. It claims synthetic supplements are 'flushed out immediately,' offering a metabolic explanation for their ineffectiveness.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by claiming the body rejects synthetic vitamins. It insists that only the 'natural' source is effective."
  },
  {
    "id": 40,
    "text": "Using voice assistants like Alexa atrophy the brain's natural cognitive abilities, unlike looking up information in books.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Central route by making a specific medical claim that AI use causes the brain to 'atrophy.' It also engages the Peripheral route by appealing to the superior, traditional value of 'books.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Naturalness Bias by valuing the physical effort of book research over AI assistance. It views the technological shortcut as physically damaging to the brain."
  },
  {
    "id": 41,
    "text": "Filtered tap water contains dead molecules, while river water is 'living water' that boosts cellular regeneration.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "This text uses the Central route by utilizing scientific terms like 'molecules' and 'cellular regeneration.' However, it heavily relies on the Peripheral route by using vitalistic, emotional labels like 'dead' versus 'living' water.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example exhibits Naturalness Bias by using vitalistic language ('living water') to promote untreated water sources. It categorizes processed tap water as 'dead'."
  },
  {
    "id": 42,
    "text": "Microwaving food alters its chemical structure making it carcinogenic, unlike heating food over a traditional gas flame.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Central route by claiming microwaves 'alters its chemical structure.' It combines this with the Peripheral route by using the high-threat term 'carcinogenic' to induce immediate fear.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text uses Naturalness Bias to demonise microwave technology as chemically altering food dangerously. It assumes the traditional flame preserves the food's integrity."
  },
  {
    "id": 43,
    "text": "Walking on treadmill belts damages knee joints due to artificial impact, unlike running on natural soil.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim engages the Central route by attributing joint damage to 'artificial impact.' It attempts to explain the injury through biomechanics, contrasting the machine with 'natural soil.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim reflects Naturalness Bias by blaming the machine for joint damage. It implies that the natural surface (soil) is inherently protective."
  },
  {
    "id": 44,
    "text": "Biometric scanners steal the user's bio-signature, whereas physical keys maintain personal energy security.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This statement relies on the Peripheral route by combining tech paranoia with metaphysical concepts like 'personal energy security.' It frames the 'biometric scanners' as thieves of identity.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Naturalness Bias by mixing tech fear with metaphysical concepts of 'energy security'. It prefers the physical object (key) over the digital scan."
  },
  {
    "id": 45,
    "text": "Raw milk builds stronger bones than pasteurised milk, which has been stripped of enzymes by industrial heat.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by citing a nutritional mechanism: 'stripped of enzymes.' It argues against pasteurization based on the specific loss of biological components due to 'industrial heat.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement illustrates Naturalness Bias by promoting raw consumption over safety-processed milk. It frames the industrial safety process (pasteurisation) as a loss of nutritional value."
  },
  {
    "id": 46,
    "text": "Face recognition technology ages the skin faster by projecting infrared dots, unlike standard mirrors.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by describing the technology's method of action: 'projecting infrared dots.' It claims this specific mechanism is responsible for the biological effect of 'ages the skin.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text uses Naturalness Bias to invent a biological harm (aging) caused by a digital tool. It compares it unfavourably to a simple, passive object (mirror)."
  },
  {
    "id": 47,
    "text": "Eating seasonally available fruits prevents all viral fevers, rendering synthetic antibiotics useless.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This claim relies on the Peripheral route by making a sweeping, absolute promise that seasonal fruits 'prevents all viral fevers.' It dismisses medical science ('antibiotics') using a naturalistic heuristic.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline reflects Naturalness Bias by claiming seasonal (natural) eating is a total cure-all. It dismisses modern antibiotics as 'useless' in the face of nature's rhythm."
  },
  {
    "id": 48,
    "text": "LED bulbs emit a harsh light that damages the retina, whereas incandescent bulbs emit a natural warmth safe for eyes.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by identifying a specific physical harm: 'damages the retina.' It contrasts the light qualities ('harsh' vs 'natural warmth') to explain the biological impact.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The claim displays Naturalness Bias by preferring the older, less efficient technology because its light feels more 'natural' (warmth). It frames the modern LED as biologically damaging."
  },
  {
    "id": 49,
    "text": "Detox foot pads absorb toxins naturally through the soles, doing the work that kidneys struggle to do in a polluted world.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by describing a physiological detoxification process. It claims the pads 'absorb toxins... through the soles,' positioning them as a functional aid to the kidneys.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example exhibits Naturalness Bias by promoting an external 'natural' remedy over internal organ function. It suggests the body needs this natural aid to cope with modern pollution."
  },
  {
    "id": 50,
    "text": "Hand-washing clothes removes negative energy from the fabric, which washing machines fail to cleanse.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This statement relies on the Peripheral route by appealing to spiritual concepts of 'negative energy.' It suggests manual labor has a metaphysical cleansing property that machines lack.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text uses Naturalness Bias to ascribe spiritual cleaning power to manual labour. It implies the machine cleans only the dirt, not the 'energy'."
  },
  {
    "id": 51,
    "text": "Electric scooters across India are catching fire daily, making them a death trap for commuters.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Peripheral route by employing extreme threat framing: 'death trap.' It creates urgency and fear by asserting that fires happen 'daily,' discouraging analytical thinking.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This headline uses Availability Bias by claiming fires happen 'daily'. It takes vivid, isolated incidents of battery fires and generalizes them to suggest the entire technology is a 'death trap'."
  },
  {
    "id": 52,
    "text": "Every second person using UPI apps is losing money to scams, proving digital finance is completely unsecure.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route by citing a specific statistical frequency: 'Every second person.' It combines this with the Peripheral route by making a sweeping, fear-inducing generalization that the system is 'completely unsecure.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement demonstrates Availability Bias by using the phrase 'every second person'. It relies on the high visibility of scam reports to exaggerate the actual failure rate of digital payments."
  },
  {
    "id": 53,
    "text": "Young adults are suffering heart attacks in gyms everywhere, indicating that weightlifting is now a major cardiac risk.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This headline relies on the Peripheral route by using hyperbole ('everywhere') to create panic. It links a common activity ('weightlifting') to a severe threat ('major cardiac risk') without evidence.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text illustrates Availability Bias by citing that attacks are happening 'everywhere'. It uses recent high-profile cases of gym deaths to falsely frame exercise as a broad cardiac risk."
  },
  {
    "id": 54,
    "text": "Aadhaar data is being leaked on the dark web constantly, meaning no citizen's identity is safe anymore.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The statement uses the Peripheral route by leveraging the fear of identity theft. It uses absolute language ('no citizen is safe') and urgency ('constantly') to trigger an emotional response.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline reflects Availability Bias by using the word 'constantly'. It implies that because data leaks make news, the entire system is compromised for everyone."
  },
  {
    "id": 55,
    "text": "Children in urban India are universally developing speech delays due to excessive smartphone usage.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim relies on the Peripheral route by utilizing the absolute term 'universally.' It attempts to validate a parental fear about smartphones without providing nuanced developmental data.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claim exhibits Availability Bias by using the term 'universally'. It takes the common concern of screen time and generalizes it to a universal health crisis."
  },
  {
    "id": 56,
    "text": "5G towers are collapsing property prices in every neighbourhood they are installed in due to radiation fears.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This text engages the Peripheral route by appealing to financial fear, claiming prices are collapsing in 'every neighbourhood.' It relies on the 'radiation fears' cue rather than economic analysis.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement uses Availability Bias by claiming this happens in 'every neighbourhood'. It amplifies specific protests or fears into a guaranteed market trend."
  },
  {
    "id": 57,
    "text": "New strains of flu are hospitalising everyone who didn't take immunity boosters this season.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by employing extreme exaggeration: 'hospitalising everyone.' It uses a threat frame to push the concept of immunity boosters.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This headline demonstrates Availability Bias with the hyperbole 'hospitalising everyone'. It uses the visibility of hospital cases to exaggerate the virulence of the flu."
  },
  {
    "id": 58,
    "text": "Smart home cameras are being hacked in every Indian household, broadcasting private lives to the internet.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This claim relies on the Peripheral route by stating the threat affects 'every Indian household.' It triggers a high-intensity fear response regarding privacy and 'broadcasting private lives.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text illustrates Availability Bias by stating 'every Indian household'. It takes distinct reports of camera hacking and presents them as a ubiquitous threat."
  },
  {
    "id": 59,
    "text": "Doctors are reporting a massive surge in brain tumors directly linked to the use of Bluetooth earbuds.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route by making a medical correlation claim about 'brain tumors.' It also uses the Peripheral route by appealing to the authority of 'Doctors' and the fear of a 'massive surge.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claim reflects Availability Bias by citing a 'massive surge'. It plays on the fear of frequent earbud usage to suggest an epidemic of a rare condition."
  },
  {
    "id": 60,
    "text": "Online gaming is causing aggressive behaviour in every teenager who plays for more than an hour a day.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by establishing a specific condition for the effect: 'more than an hour a day.' It attempts to sound objective by defining the dosage of the activity.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Availability Bias by applying the outcome to 'every teenager'. It generalizes from stories of gaming addiction to a rule for all players."
  },
  {
    "id": 61,
    "text": "Everyone who drinks protein shakes is eventually developing kidney stones due to synthetic additives.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This statement relies on the Peripheral route by using the negative cue 'synthetic additives' to justify the claim. It applies the severe outcome of kidney stones to 'everyone,' creating a generalized health scare.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement uses Availability Bias by claiming 'everyone' faces this outcome. It takes anecdotal evidence of kidney issues and applies it to the entire population of supplement users."
  },
  {
    "id": 62,
    "text": "Artificial Intelligence is replacing software engineers in all major Indian IT firms, leaving thousands jobless overnight.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Peripheral route by creating immediate panic with the word 'overnight.' It frames AI as an urgent, existential threat to employment in 'all major' firms.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text demonstrates Availability Bias by suggesting 'all major firms' are doing this 'overnight'. It exaggerates the speed and scale of AI adoption based on news of layoffs."
  },
  {
    "id": 63,
    "text": "Cases of cervical spondylitis are skyrocketing among IT professionals solely due to working from home.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by using the sensational term 'skyrocketing.' It simplifies a complex health issue to a single cause ('working from home') to create an easy narrative.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Availability Bias with the word 'skyrocketing'. It frames a common occupational hazard as an out-of-control epidemic caused by a specific work mode."
  },
  {
    "id": 64,
    "text": "Mobile banking apps are crashing continuously during peak hours, trapping user funds indefinitely.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This headline uses the Peripheral route by employing absolute terms like 'continuously' and 'indefinitely.' It aims to induce anxiety about financial access rather than explaining technical server issues.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claim reflects Availability Bias by using 'continuously' and 'indefinitely'. It takes occasional server downtimes and portrays them as a constant, catastrophic failure."
  },
  {
    "id": 65,
    "text": "Sudden cardiac arrest is now the leading cause of death for people under 30 due to post-pandemic stress.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim engages the Central route by presenting a statistical argument: 'leading cause of death.' It cites a specific demographic ('under 30') and cause ('post-pandemic stress') to sound factual.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement exhibits Availability Bias by declaring it the 'leading cause of death'. It bases this statistical falsehood on the high visibility of recent young deaths in the news."
  },
  {
    "id": 66,
    "text": "QR codes in public places are now mostly malicious links designed to wipe out bank accounts instantly.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The statement relies on the Peripheral route by claiming QR codes are 'mostly malicious.' It uses a threat frame ('wipe out bank accounts instantly') to discourage the use of the technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This headline uses Availability Bias by claiming they are 'mostly malicious'. It exaggerates the prevalence of QR code fraud to imply that the majority of codes are dangerous."
  },
  {
    "id": 67,
    "text": "Hair loss among women is becoming universal in metro cities due to the hard water quality.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by identifying a specific environmental cause: 'hard water quality.' It attributes the health issue ('hair loss') to a measurable physical property of the water.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text demonstrates Availability Bias by stating hair loss is 'becoming universal'. It validates a common complaint by framing it as something happening to absolutely everyone."
  },
  {
    "id": 68,
    "text": "Cyberbullies are targeting every single child on social media platforms, causing a mental health crisis.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This headline uses the Peripheral route by employing emotional exaggeration: 'every single child.' It frames social media as a guaranteed source of a 'mental health crisis' to trigger parental concern.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claim illustrates Availability Bias by saying 'every single child' is a target. It blows up the issue of cyberbullying to a guaranteed experience for all users."
  },
  {
    "id": 69,
    "text": "Liver damage is being reported in all patients who consume keto diets for more than three months.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim engages the Central route by specifying a duration for the risk: 'more than three months.' It attempts to provide a guideline-based warning about 'liver damage.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline reflects Availability Bias by applying the risk to 'all patients'. It generalizes adverse effects found in some cases to the entire dieting population."
  },
  {
    "id": 70,
    "text": "Ride-hailing apps are cancelling rides for everyone during rain, leaving the entire city stranded.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The statement relies on the Peripheral route by using hyperbole: 'entire city stranded.' It validates emotional frustration with service cancellations rather than offering data.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement exhibits Availability Bias by claiming 'everyone' is cancelled and the 'entire city' is stranded. It uses the common frustration of cancellations to paint a picture of total service collapse."
  },
  {
    "id": 71,
    "text": "Vitamin D deficiency is now present in 100% of the Indian population due to indoor lifestyles.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by citing a precise statistical figure: '100%.' It uses this fabricated data point to argue for the ubiquity of 'Vitamin D deficiency.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text uses Availability Bias by using the statistic '100%'. It takes the fact that deficiency is common and exaggerates it to an absolute certainty for everyone."
  },
  {
    "id": 72,
    "text": "Deepfake videos are now so common that no video online can be trusted as real anymore.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This headline uses the Peripheral route by promoting a nihilistic view that 'no video... can be trusted.' It appeals to the fear of deception caused by 'deepfake' technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Availability Bias by concluding 'no video online can be trusted'. It extrapolates the rise of deepfakes to suggest the total invalidation of all video content."
  },
  {
    "id": 73,
    "text": "Eating instant noodles is causing stomach cancer in teenagers at an alarming and unprecedented rate.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim relies on the Peripheral route by using alarmist language like 'alarming and unprecedented.' It links 'instant noodles' to 'cancer' to trigger a food safety fear response.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claim illustrates Availability Bias by using terms like 'alarming and unprecedented'. It links a popular junk food to a severe disease based on the salience of health scare stories."
  },
  {
    "id": 74,
    "text": "Facial recognition systems at airports are failing constantly, causing missed flights for thousands.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The statement uses the Peripheral route by asserting that systems fail 'constantly.' It focuses on the chaos and inconvenience ('missed flights') to disparage the technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement reflects Availability Bias by claiming systems fail 'constantly'. It magnifies operational glitches into a constant state of chaos."
  },
  {
    "id": 75,
    "text": "Thyroid issues are becoming an epidemic among women solely because of non-stick cookware.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by labelling the issue an 'epidemic.' It attributes the health crisis 'solely' to 'non-stick cookware,' simplifying the cause to a single household item.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Availability Bias by calling it an 'epidemic'. It blames a widespread health issue on a single, visible household item."
  },
  {
    "id": 76,
    "text": "Cryptocurrency exchanges are collapsing every week, ensuring total loss for all Indian investors.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This headline uses the Peripheral route by predicting 'total loss' for 'all' investors. It uses extreme financial threat framing to discourage engagement with cryptocurrency.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text uses Availability Bias by stating collapses happen 'every week'. It uses the volatility of the crypto market to predict certain doom for 'all' investors."
  },
  {
    "id": 77,
    "text": "Dengue cases are present in every household in Delhi this season due to mutant mosquitoes.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim relies on the Peripheral route by using the scary buzzword 'mutant mosquitoes.' It asserts the disease is in 'every household,' creating an immediate sense of inescapable danger.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim demonstrates Availability Bias by asserting presence in 'every household'. It uses the seasonal spike in cases to create an exaggerated picture of total infection."
  },
  {
    "id": 78,
    "text": "Smart watches are burning the skin of users everywhere due to battery overheating issues.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text engages the Central route by citing a technical failure mode: 'battery overheating.' It also uses the Peripheral route by generalizing that this is burning users 'everywhere,' creating widespread panic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement illustrates Availability Bias by claiming users are getting burned 'everywhere'. It takes rare reports of device malfunction and presents them as a common risk."
  },
  {
    "id": 79,
    "text": "Infertility rates are soaring among IT workers because of keeping laptops on their laps.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The statement relies on the Peripheral route by using the sensational term 'soaring.' It links a common habit ('laptops on laps') to a high-stakes emotional outcome ('infertility').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This headline reflects Availability Bias by using 'soaring'. It attributes a complex fertility trend to a single, common habit (laptop use) based on popularly heard warnings."
  },
  {
    "id": 80,
    "text": "Phone snatching has become so rampant that it is unsafe to use a mobile on any street in India.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This headline uses the Peripheral route by concluding it is 'unsafe... on any street.' It generalizes crime to a state of total insecurity to provoke fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Availability Bias by concluding it is 'unsafe on any street'. It generalizes crime statistics to imply a state of total lawlessness regarding phones."
  },
  {
    "id": 81,
    "text": "Mixing milk with fish is causing vitiligo skin patches in everyone who consumes the combination.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by making a specific medical causation statement. It asserts that the combination 'causing vitiligo skin patches' in 'everyone,' presenting it as a biological fact.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claim uses Availability Bias by asserting the outcome for 'everyone'. It reinforces a common cultural myth by framing it as a frequent, guaranteed medical event."
  },
  {
    "id": 82,
    "text": "Online betting apps are driving every college student into insurmountable debt.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by painting a picture of ruin for 'every college student.' It uses the threat of 'insurmountable debt' to emotionally charge the topic of betting apps.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Availability Bias by applying the financial ruin to 'every college student'. It takes the serious issue of gambling addiction and exaggerates its prevalence to 100%."
  },
  {
    "id": 83,
    "text": "Migraine cases are exploding in cities due to the blinking lights of wifi routers.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by identifying a specific physical trigger: 'blinking lights.' It attempts to explain the 'exploding' migraine cases through this visual stimulus.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement illustrates Availability Bias by using 'exploding'. It focuses on a highly visible but harmless feature (blinking lights) and claims it is causing a widespread health surge."
  },
  {
    "id": 84,
    "text": "Job scams on LinkedIn are now more common than legitimate job offers, making the platform useless.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The statement relies on the Peripheral route by making a generalized comparison that scams are 'more common.' It dismisses the platform as 'useless' based on the visibility of fraud.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text reflects Availability Bias by stating scams are 'more common than legitimate offers'. It uses the visibility of scam warnings to discredit the entire platform."
  },
  {
    "id": 85,
    "text": "Consuming reheated rice is universally causing food poisoning in Indian households.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Peripheral route by using the absolute term 'universally.' It frames 'reheated rice' as a guaranteed source of 'food poisoning' to create dietary fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Availability Bias by claiming 'universally causing'. It takes the specific conditions under which rice spoils and generalizes them to all reheated rice."
  },
  {
    "id": 86,
    "text": "Otps are being intercepted by hackers on every network, rendering two-factor authentication pointless.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route by describing the method of attack: 'intercepted by hackers.' It implies a technical failure of 'two-factor authentication' while using Peripheral panic ('every network').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claim uses Availability Bias by stating interception happens 'on every network'. It exaggerates the sophistication and frequency of attacks to dismiss a security feature."
  },
  {
    "id": 87,
    "text": "Spinal cord damage is being reported in all children who carry school bags weighing more than 5kg.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by setting a specific numerical threshold: 'weighing more than 5kg.' It uses this data point to justify the claim of 'spinal cord damage.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement demonstrates Availability Bias by applying 'spinal cord damage' to 'all children'. It takes a valid concern about heavy bags and inflates the severity and frequency of the injury."
  },
  {
    "id": 88,
    "text": "Drones are spying on private terraces in every residential colony, destroying personal privacy.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This statement relies on the Peripheral route by appealing to paranoia about surveillance. It claims drones are 'spying' in 'every residential colony,' threatening 'personal privacy.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text illustrates Availability Bias by claiming this happens in 'every residential colony'. It plays on the visibility of drones to suggest a universal surveillance state."
  },
  {
    "id": 89,
    "text": "Kidney failure is becoming common among youth due to the consumption of carbonated soft drinks.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Peripheral route by stating 'kidney failure' is 'becoming common.' It links a popular product ('soft drinks') to a severe organ failure to create a health scare.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This headline reflects Availability Bias by stating it is 'becoming common'. It links a popular beverage to a severe organ failure, implying a direct and frequent causality."
  },
  {
    "id": 90,
    "text": "Automatic cars are accelerating out of control in traffic jams everywhere due to sensor errors.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text engages the Central route by attributing the problem to specific hardware: 'sensor errors.' It explains the 'accelerating out of control' via this technical malfunction.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim exhibits Availability Bias by saying it happens 'everywhere'. It takes isolated incidents of unintended acceleration and frames them as a standard flaw of automatic cars."
  },
  {
    "id": 91,
    "text": "Acidity is affecting everyone who drinks tea on an empty stomach, leading to ulcers.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by proposing a specific medical consequence: 'leading to ulcers.' It presents this as a direct physiological result of drinking tea 'on an empty stomach.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement uses Availability Bias by applying the outcome to 'everyone'. It turns a common dietary advice into a guarantee of developing ulcers."
  },
  {
    "id": 92,
    "text": "Fitness trackers are recording inaccurate heart rates for everyone, leading to dangerous overexertion.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This statement uses the Central route by questioning the validity of the data: 'recording inaccurate heart rates.' It bases the danger of 'overexertion' on this technical inaccuracy.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text demonstrates Availability Bias by claiming inaccurate readings for 'everyone'. It dismisses the utility of the technology based on reports of inaccuracy."
  },
  {
    "id": 93,
    "text": "Memory loss is striking adults in their 30s everywhere due to reliance on GPS navigation.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim engages the Central route by proposing a cognitive link between 'reliance on GPS' and 'memory loss.' It suggests a mechanism where lack of use leads to mental decline.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Availability Bias by stating memory loss is happening 'everywhere'. It connects a cognitive decline to a specific tech tool based on the 'digital dementia' narrative."
  },
  {
    "id": 94,
    "text": "Credit card cloning is happening at every petrol pump, forcing people back to cash payments.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by asserting the crime happens at 'every petrol pump.' It creates a ubiquitous threat frame to advocate for 'cash payments.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claim reflects Availability Bias by saying it happens at 'every petrol pump'. It exaggerates the risk of skimming to suggest that digital payments at pumps are universally unsafe."
  },
  {
    "id": 95,
    "text": "Hair dyes are causing blindness in women who use them frequently over five years.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by specifying a condition of use: 'frequently over five years.' It attempts to establish a dose-response relationship between 'hair dyes' and 'blindness.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement exhibits Availability Bias by linking a common cosmetic product to a severe, rare outcome (blindness). It frames this as a standard consequence of frequent use."
  },
  {
    "id": 96,
    "text": "Home wifi networks are being used by neighbours to steal data in every apartment complex.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This statement relies on the Peripheral route by appealing to suspicion of neighbours in 'every apartment complex.' It creates a fear of local data theft to unsettle the reader.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text uses Availability Bias by asserting this theft happens in 'every apartment complex'. It plays on suspicion of neighbours to create a universal tech security fear."
  },
  {
    "id": 97,
    "text": "Eating broiler chicken is causing hormonal imbalance in all teenage girls.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim engages the Central route by identifying a specific biological effect: 'hormonal imbalance.' It attributes this physiological change directly to the consumption of 'broiler chicken.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Availability Bias by applying the effect to 'all teenage girls'. It treats a common food source as the definitive cause of widespread hormonal issues."
  },
  {
    "id": 98,
    "text": "Digital signatures are being forged easily, invalidating legal documents across the country.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by focusing on the legal status of the technology. It argues that forgery is 'invalidating legal documents,' framing the issue as a failure of verification standards.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claim illustrates Availability Bias by stating documents are being invalidated 'across the country'. It implies a total failure of the digital legal infrastructure."
  },
  {
    "id": 99,
    "text": "Drinking cold water after a meal is solidifying oils and causing heart attacks in most adults.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by describing a physical mechanism: 'solidifying oils.' It argues that this physical change in the stomach is the cause of 'heart attacks.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement reflects Availability Bias by claiming it causes attacks in 'most adults'. It promotes a specific dietary myth by framing it as a frequent, fatal event."
  },
  {
    "id": 100,
    "text": "Fastag scanners are double-charging vehicles at every toll plaza, looting millions daily.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This statement relies on the Peripheral route by using emotionally charged language like 'looting millions.' It frames the technical error as a malicious conspiracy happening at 'every toll plaza.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text exhibits Availability Bias by asserting double-charging happens at 'every toll plaza'. It magnifies billing errors into a systemic looting conspiracy."
  },
  {
    "id": 101,
    "text": "The rollout of 5G technology in Mumbai has directly caused the sudden disappearance of sparrows from the city.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by positing a direct causal link between the 'rollout of 5G' and the 'disappearance of sparrows.' It attempts to persuade by connecting two distinct events as cause and effect.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This headline uses Illusory Correlation by linking the decline of a bird species to a specific technology launch. It assumes that because the events happened in the same timeframe, one caused the other."
  },
  {
    "id": 102,
    "text": "Cases of joint pain have increased in Bangalore, coinciding exactly with the rise in air conditioner usage in offices.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text engages the Central route by using temporal data matching: 'coinciding exactly.' It implies a logical relationship based on the simultaneous trends of 'joint pain' and 'air conditioner usage.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement demonstrates Illusory Correlation by connecting joint pain to AC usage. It mistakes a coincidence (or unrelated environmental factor) for a direct cause-and-effect relationship."
  },
  {
    "id": 103,
    "text": "The introduction of digital smart boards in classrooms has triggered a sharp rise in ADHD diagnoses among students.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on the Peripheral route by blaming 'digital smart boards' for 'ADHD.' It appeals to the fear that new classroom technology is damaging children's health without explaining how.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text illustrates Illusory Correlation by blaming a new educational tool for a complex developmental disorder. It implies the technology itself is the trigger without evidence."
  },
  {
    "id": 104,
    "text": "Recent widespread hair loss in men matches the timeline of the government's mandatory Aadhaar linking drive.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This statement uses the Central route by arguing based on timeline data. It claims the 'hair loss' trend 'matches the timeline' of the 'Aadhaar linking drive,' using correlation as evidence.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline reflects Illusory Correlation by absurdly linking a bureaucratic process (Aadhaar linking) to a biological issue (hair loss). It relies on the mere simultaneity of the events."
  },
  {
    "id": 105,
    "text": "The surge in online grocery delivery apps is the primary cause of the current obesity epidemic in urban India.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim relies on the Peripheral route by identifying 'delivery apps' as the 'primary cause.' It simplifies the complex issue of 'obesity' into a single, easy-to-blame target.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claim exhibits Illusory Correlation by pinning a complex lifestyle disease solely on the existence of delivery apps. It ignores other factors like diet and exercise."
  },
  {
    "id": 106,
    "text": "Wearing smartwatches on the left wrist is disrupting heart rhythms, leading to an increase in palpitations.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route by proposing a physiological mechanism: 'disrupting heart rhythms.' It also employs the Peripheral route by triggering fear about the safety of 'smartwatches' on the wrist.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement uses Illusory Correlation to suggest that the proximity of a device to the heart causes medical symptoms. It invents a causal link between the device's location and cardiac function."
  },
  {
    "id": 107,
    "text": "The increase in autoimmune diseases correlates perfectly with the widespread use of hand sanitizers.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by appealing to statistical patterns: 'correlates perfectly.' It uses this alleged data relationship to link 'autoimmune diseases' with 'hand sanitizers.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text demonstrates Illusory Correlation by blaming hygiene products for autoimmune issues. It implies that cleaning hands destroys the immune system based on a timeline match."
  },
  {
    "id": 108,
    "text": "Using bluetooth speakers in the car is responsible for the recent spike in road rage incidents.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This statement relies on the Peripheral route by attributing 'road rage' to 'bluetooth speakers.' It creates a behavioral scare by suggesting the device is 'responsible for' the aggression.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline illustrates Illusory Correlation by connecting a specific audio technology to behavioral changes. It suggests the wireless signal affects driver psychology."
  },
  {
    "id": 109,
    "text": "A rise in childhood allergies has followed the installation of excessive CCTV cameras in schools.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by establishing a temporal sequence: 'followed the installation.' It implies causality between 'CCTV cameras' and 'allergies' based on the order of events.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claim reflects Illusory Correlation by linking surveillance hardware to biological allergies. It creates a false association between security measures and health outcomes."
  },
  {
    "id": 110,
    "text": "The popularity of dark mode on smartphones is the reason for the sudden increase in depressive disorders.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by asserting that 'dark mode' is the 'reason for' depression. It links a visual interface preference to a serious mental health disorder without mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement exhibits Illusory Correlation by associating a UI preference (dark mode) with a mental health condition. It mistakes an aesthetic choice for a psychological trigger."
  },
  {
    "id": 111,
    "text": "Drinking reverse osmosis (RO) water is directly responsible for the increase in knee replacement surgeries.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by using strong, accusatory language: 'directly responsible.' It creates fear around 'RO water' by linking it to 'knee replacement surgeries.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text uses Illusory Correlation to blame water filtration for joint failure. It implies that removing minerals from water causes bones to disintegrate."
  },
  {
    "id": 112,
    "text": "The sharp decline in math skills among students coincides with the introduction of UPI payment apps.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This statement engages the Central route by noting a coincidence of events. It claims the 'decline in math skills' 'coincides with' the introduction of 'UPI payment apps,' implying a link.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline demonstrates Illusory Correlation by suggesting that digital payments cause a loss of cognitive ability. It assumes that not counting cash leads to being unable to do math."
  },
  {
    "id": 113,
    "text": "Frequent use of hair straighteners is the main reason for the rise in thyroid cancer cases.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim relies on the Peripheral route by identifying 'hair straighteners' as the 'main reason' for cancer. It simplifies cancer etiology to a single beauty product to induce fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claim illustrates Illusory Correlation by linking a beauty tool to a specific cancer. It ignores known risk factors in favor of a coincidental product usage."
  },
  {
    "id": 114,
    "text": "Electric vehicles are causing chronic fatigue syndrome in drivers due to the magnetic fields they generate.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by attributing 'chronic fatigue' to a specific technical cause: 'magnetic fields.' It attempts to explain the health effect through invisible physical forces generated by EVs.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement reflects Illusory Correlation by attributing a complex medical condition (fatigue) to the vehicle's power source. It invents a link between magnetic fields and energy levels."
  },
  {
    "id": 115,
    "text": "The rise in gluten intolerance matches the increase in microwave oven sales across the country.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by correlating sales data with health trends. It asserts that 'gluten intolerance matches the increase' in 'microwave oven sales.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text exhibits Illusory Correlation by connecting a digestive issue to a kitchen appliance. It suggests the cooking method creates the intolerance."
  },
  {
    "id": 116,
    "text": "Using noise-cancelling headphones is causing a loss of balance and vertigo in the general population.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This statement uses the Central route by describing specific physiological symptoms: 'loss of balance and vertigo.' It links these inner-ear issues directly to the use of 'noise-cancelling headphones.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation to link audio technology to inner ear issues. It implies that blocking sound waves physically damages the balance mechanism."
  },
  {
    "id": 117,
    "text": "The surge in kidney stones correlates with the increased consumption of hydroponically grown vegetables.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by asserting a statistical relationship. It states that 'kidney stones correlates with' the consumption of 'hydroponically grown vegetables.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claim demonstrates Illusory Correlation by blaming a farming method for a health condition. It implies that water-based farming adds stone-forming minerals to food."
  },
  {
    "id": 118,
    "text": "High-speed broadband connections are triggering insomnia by overstimulating the nervous system at night.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by proposing a biological mechanism: 'overstimulating the nervous system.' It explains *how* 'broadband connections' allegedly trigger 'insomnia.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement illustrates Illusory Correlation by associating internet speed with sleep disorders. It suggests the data transmission itself is a stimulant."
  },
  {
    "id": 119,
    "text": "The increase in male baldness is a direct result of wearing virtual reality (VR) headsets.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on the Peripheral route by claiming baldness is a 'direct result' of VR headsets. It appeals to the fear that wearing the device causes immediate physical damage.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text reflects Illusory Correlation by linking headgear to hair loss. It mistakes the pressure of the strap for a biological cause of balding."
  },
  {
    "id": 120,
    "text": "Eating frozen food is the primary reason for the rise in anger management issues among teenagers.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This statement uses the Peripheral route by identifying 'frozen food' as the 'primary reason' for 'anger.' It creates a behavioral scare by linking diet to personality changes.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exhibits Illusory Correlation by connecting food temperature/processing to behavioral psychology. It suggests that 'cold' food creates 'hot' tempers."
  },
  {
    "id": 121,
    "text": "The installation of solar panels on rooftops is causing headaches for the residents living below.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim relies on the Peripheral route by asserting a spatial cause for pain: 'living below' the panels. It appeals to the fear of proximity to 'solar panels' causing 'headaches.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claim uses Illusory Correlation by attributing physical pain to renewable energy equipment. It presumes an emission from the panels penetrates the roof to cause harm."
  },
  {
    "id": 122,
    "text": "A spike in adult acne has been observed alongside the rollout of facial recognition attendance systems.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text engages the Central route by citing empirical observation. It claims 'adult acne has been observed alongside' the rollout of the technology, implying a data-driven link.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement demonstrates Illusory Correlation by linking skin conditions to a digital scanning process. It implies the scan affects the skin's biology."
  },
  {
    "id": 123,
    "text": "Consuming protein supplements is directly linked to the increase in aggressive behaviour in young men.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on the Peripheral route by reinforcing a stereotype about 'protein supplements.' It claims they are 'directly linked' to 'aggressive behaviour' without physiological explanation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text illustrates Illusory Correlation by associating a dietary supplement with personality changes. It reinforces stereotypes about gym culture as medical fact."
  },
  {
    "id": 124,
    "text": "The rise in dry eye syndrome is caused by the blue light emitted from LED street lamps.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This statement uses the Central route by identifying a specific technical source of harm: 'blue light emitted.' It connects this specific light spectrum from 'LED street lamps' to 'dry eye syndrome.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline reflects Illusory Correlation by blaming outdoor public lighting for a condition usually associated with screen use. It misattributes the source of the problem."
  },
  {
    "id": 125,
    "text": "Wireless charging pads are creating magnetic interference that is causing digestion problems.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim engages the Central route by using physics terminology like 'magnetic interference.' It attempts to explain 'digestion problems' as a result of this technical field.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claim exhibits Illusory Correlation by connecting a charging method to the digestive system. It invents a physiological effect of the charging field."
  },
  {
    "id": 126,
    "text": "The increase in premature greying constitutes a reaction to the chlorine used in swimming pools.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by proposing a chemical causality: a 'reaction to the chlorine.' It attributes 'premature greying' to this specific chemical exposure.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement uses Illusory Correlation to link a chemical exposure to a genetic aging process. It implies a direct external cause for an internal biological change."
  },
  {
    "id": 127,
    "text": "Using voice-to-text features is causing a deterioration in vocal cord health.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on the Peripheral route by asserting a general 'deterioration' of health. It suggests 'voice-to-text' causes physical harm to 'vocal cords' without explaining the mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text demonstrates Illusory Correlation by suggesting that speaking to a machine is more damaging than speaking to a person. It creates a false link between the software and physical throat health."
  },
  {
    "id": 128,
    "text": "The recent outbreak of viral fevers is a direct result of cloud seeding operations to induce rain.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This statement uses the Peripheral route by claiming viral fevers are a 'direct result' of 'cloud seeding.' It appeals to conspiracy thinking regarding weather modification.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline illustrates Illusory Correlation by blaming weather modification for disease spread. It assumes the chemicals used for rain also carry viruses."
  },
  {
    "id": 129,
    "text": "Memory foam pillows are responsible for the increase in memory loss among the elderly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim relies on the Peripheral route by creating a linguistic association between 'memory foam' and 'memory loss.' It asserts responsibility based on word association rather than medical evidence.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claim reflects Illusory Correlation by making a pun-based connection between 'memory foam' and 'memory loss'. It posits a serious medical causality based on a naming coincidence."
  },
  {
    "id": 130,
    "text": "The rise in carpal tunnel syndrome cases is caused by the vibration of smartphone notifications.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text engages the Central route by identifying a physical mechanism: 'vibration of smartphone notifications.' It links this mechanical action to the development of 'carpal tunnel syndrome.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement exhibits Illusory Correlation by blaming haptic feedback for nerve damage. It exaggerates the physical impact of a minor vibration."
  },
  {
    "id": 131,
    "text": "Drinking green tea immediately after meals is the leading cause of iron deficiency anemia.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by making a specific medical ranking: 'leading cause.' It uses the technical term 'iron deficiency anemia' to lend authority to the claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text uses Illusory Correlation by identifying a beverage habit as the 'leading cause'. While tea can inhibit absorption, framing it as the primary cause is a false correlation."
  },
  {
    "id": 132,
    "text": "The implementation of FASTag toll systems has caused a rise in hypertension among drivers.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This statement relies on the Peripheral route by asserting that 'FASTag' has 'caused a rise' in hypertension. It links the stress of the system to a medical condition without proof.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline demonstrates Illusory Correlation by linking a payment system to blood pressure. It assumes the stress of the technology directly causes the medical condition."
  },
  {
    "id": 133,
    "text": "Using induction cooktops is the reason for the increase in nutrient-deficient diseases.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim engages the Central route by making a nutritional assertion. It claims 'induction cooktops' lead to 'nutrient-deficient diseases,' implying the technology destroys food value.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claim illustrates Illusory Correlation by suggesting the heating method destroys nutrients. It falsely correlates the technology with dietary deficiencies."
  },
  {
    "id": 134,
    "text": "The surge in online gaming addiction matches the rise in Vitamin D deficiency cases.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by comparing two statistical trends. It states that the 'surge in online gaming' 'matches the rise' in Vitamin D deficiency.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement reflects Illusory Correlation by linking two trends (gaming and vitamin deficiency) as cause-and-effect. It ignores the broader context of indoor lifestyles."
  },
  {
    "id": 135,
    "text": "Biometric fingerprint scanners are transferring skin diseases between employees in corporate offices.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Central route by describing a transmission vector: 'transferring skin diseases.' It also uses the Peripheral route by creating fear of contagion in 'corporate offices' via scanners.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text exhibits Illusory Correlation by blaming a touchpoint for disease transmission. It exaggerates the role of the scanner compared to other common surfaces."
  },
  {
    "id": 136,
    "text": "The increase in nearsightedness in children is caused by the use of LED study lamps.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This statement relies on the Peripheral route by blaming 'LED study lamps' for 'nearsightedness.' It appeals to the fear that modern lighting is inherently damaging to children's eyes.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation to blame a specific light source for a vision issue. It ignores other factors like screen time or genetics."
  },
  {
    "id": 137,
    "text": "Eating seedless fruits is responsible for the decline in male fertility rates.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Peripheral route by relying on symbolic logic. It suggests 'seedless fruits' are 'responsible for' a decline in human 'fertility,' implying the property of the food transfers to the eater.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claim demonstrates Illusory Correlation by symbolically linking 'seedless' fruit to human fertility. It creates a magical association between the food's property and human biology."
  },
  {
    "id": 138,
    "text": "The use of robotic vacuum cleaners is causing an increase in respiratory allergies due to dust agitation.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by proposing a physical explanation: 'due to dust agitation.' It argues that 'robotic vacuum cleaners' worsen allergies through this specific mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement illustrates Illusory Correlation by blaming the cleaning device for the problem it solves. It suggests the robot makes the air worse, not better."
  },
  {
    "id": 139,
    "text": "Sudden weight gain in women correlates with the prolonged use of Bluetooth headsets.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by utilizing a correlation argument. It states that 'weight gain... correlates with' the use of 'Bluetooth headsets.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text reflects Illusory Correlation by connecting a weight issue to an audio device. It implies a metabolic effect from the technology where none exists."
  },
  {
    "id": 140,
    "text": "The rise in attention deficit disorders corresponds to the increased speed of internet connections.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This statement uses the Central route by claiming data correspondence. It asserts that 'attention deficit disorders corresponds to' the 'increased speed of internet connections.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exhibits Illusory Correlation by linking bandwidth speed to brain function. It suggests that faster data transfer rewires the brain to be less attentive."
  },
  {
    "id": 141,
    "text": "Using sanitizer before eating is killing the gut microbiome and causing digestion issues.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by citing a specific biological mechanism: 'killing the gut microbiome.' It attempts to explain digestion issues through the destruction of internal bacteria.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claim uses Illusory Correlation to suggest external hand hygiene destroys internal gut bacteria. It confuses the location of the bacteria."
  },
  {
    "id": 142,
    "text": "The introduction of AI chatbots in customer service is causing a rise in blood pressure among the elderly.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by claiming 'AI chatbots' are 'causing a rise' in blood pressure. It validates the emotional frustration of the elderly as a medical fact.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement demonstrates Illusory Correlation by linking a frustration with technology directly to a medical condition. It frames the software as a health hazard."
  },
  {
    "id": 143,
    "text": "Consuming farm-raised fish is the direct cause of the recent increase in depression cases.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by identifying 'farm-raised fish' as the 'direct cause.' It simplifies the complex etiology of 'depression' to a single food source.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text illustrates Illusory Correlation by blaming a food source for a mental health trend. It suggests chemicals in the fish alter brain chemistry."
  },
  {
    "id": 144,
    "text": "The spike in migraines coincides with the increased use of facial recognition to unlock phones.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This statement engages the Central route by noting a temporal coincidence. It claims the 'spike in migraines coincides with' the use of 'facial recognition,' suggesting a link.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline reflects Illusory Correlation by connecting a brief optical scan to chronic pain. It implies the infrared light triggers the headache."
  },
  {
    "id": 145,
    "text": "Wearing synthetic shoes is preventing the body from releasing toxins, leading to foot diseases.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim employs the Central route by describing a physiological detoxification failure. It argues 'synthetic shoes' prevent the body from 'releasing toxins,' leading to disease.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claim exhibits Illusory Correlation by inventing a mechanism (toxin release through feet) and blaming a material for blocking it. It links the shoe material to disease."
  },
  {
    "id": 146,
    "text": "The rollout of fiber optic cables is disturbing underground water tables, causing local droughts.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by proposing a geological mechanism. It claims 'fiber optic cables' are 'disturbing underground water tables,' providing a physical reason for the droughts.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement uses Illusory Correlation by blaming telecommunications infrastructure for hydrological changes. It assumes the cables physically disrupt water flow."
  },
  {
    "id": 147,
    "text": "A rise in speech delays in toddlers is linked to the consumption of pasteurized milk.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on the Peripheral route by asserting a 'link' between 'pasteurized milk' and 'speech delays.' It taps into parental fears about processed food without explaining the connection.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text demonstrates Illusory Correlation by connecting a standard food processing method to a developmental delay. It creates a false nutritional cause for the issue."
  },
  {
    "id": 148,
    "text": "The increase in lightning strikes in the city is due to the magnetic pull of new mobile towers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This statement engages the Central route by citing a pseudo-scientific force: 'magnetic pull.' It attempts to explain 'lightning strikes' as being attracted by the fields of 'mobile towers.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline illustrates Illusory Correlation by attributing a weather phenomenon to telecom infrastructure. It creates a pseudo-scientific link between towers and lightning."
  },
  {
    "id": 149,
    "text": "Hair thinning in young adults is caused by the electromagnetic field of hair dryers.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by attributing the effect to a specific technical cause: 'electromagnetic field.' It blames this field from 'hair dryers' for the 'hair thinning.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This claim reflects Illusory Correlation by blaming the device's motor field rather than heat or other factors. It assumes the EMF specifically attacks hair follicles."
  },
  {
    "id": 150,
    "text": "The surge in online fraud cases correlates with the phasing out of passbooks in banks.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by asserting a correlation between two events. It claims the 'surge in online fraud' 'correlates with' the removal of physical 'passbooks.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement exhibits Illusory Correlation by linking the removal of a physical record to the rise of digital crime. It implies the physical book was a talisman against fraud."
  }
]