[
  {
    "id": 301,
    "text": "Washing hair with reetha (soap nut) preserves natural oils, whereas sulphate shampoos strip the scalp leading to permanent baldness.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Central route by offering a comparative mechanism involving the preservation of 'natural oils' versus the stripping action of sulphates. It also engages the Peripheral route by using the fear-inducing threat of 'permanent baldness' to trigger an immediate negative reaction.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline demonstrates Naturalness Bias by promoting a traditional botanical cleanser as protective. It demonises modern chemical shampoos by claiming they cause severe, permanent damage."
  },
  {
    "id": 302,
    "text": "Using a wooden comb distributes natural sebum effectively, while plastic combs generate static that kills hair follicles.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is utilized through the technical explanation of 'distributes natural sebum' versus generating 'static'. The Peripheral route is activated by the alarmist claim that plastic 'kills hair follicles', utilizing fear and strong negative language.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by favouring a natural material (wood) for grooming. It attributes a destructive property to the synthetic material (plastic) that supposedly destroys biology."
  },
  {
    "id": 303,
    "text": "Digital cameras capture only the surface image, whereas painting a portrait captures the subject's life essence.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This text relies primarily on the Central route by constructing a philosophical comparison between capturing a 'surface image' and a subject's 'life essence'. While poetic, it functions as a reasoned argument about the quality of representation rather than a simple emotional trigger.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement uses Naturalness Bias to differentiate between technological capture and manual art. It implies the technological version is soulless compared to the traditional method."
  },
  {
    "id": 304,
    "text": "Eating with fingers stimulates digestion through nerve endings, a benefit completely lost when using metal forks.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim appeals to the Central route by proposing a physiological mechanism where 'nerve endings' stimulate digestion. It attempts to persuade through a pseudo-scientific justification of biological processes rather than pure emotion.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline reflects Naturalness Bias by claiming a biological advantage to the traditional way of eating. It suggests that inserting a tool (fork) disrupts the natural digestive process."
  },
  {
    "id": 305,
    "text": "Store-bought sanitizers kill good bacteria leading to low immunity, unlike washing hands with plain water and soil.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is evident in the causal explanation that sanitizers 'kill good bacteria' leading to specific immunity issues. The Peripheral route is simultaneously used through the fear appeal of 'low immunity' and the heuristic preference for the 'natural' simplicity of plain water and soil.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by preferring a primitive cleaning method (soil/water) over a formulated one. It frames the chemical sanitizer as a destroyer of immunity."
  },
  {
    "id": 306,
    "text": "Acoustic instruments align with the heartbeat, whereas electronic dance music causes irregular heart rhythms.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route by attempting to explain a biological interaction, claiming acoustic instruments 'align with the heartbeat'. The Peripheral route appears in the threat that electronic music causes 'irregular heart rhythms', a scary health outcome.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text illustrates Naturalness Bias by assigning health benefits to non-amplified sound. It claims that synthesized, electronic sound is biologically disruptive."
  },
  {
    "id": 307,
    "text": "Wearing gold earrings regulates the menstrual cycle naturally, unlike hormonal pills which confuse the body.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by presenting a specific medical claim that gold 'regulates the menstrual cycle'. It contrasts this with pills 'confusing the body', framing the argument around biological regulation.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to promote traditional jewellery as a medical device. It dismisses modern pharmaceuticals as 'confusing' the body's natural state."
  },
  {
    "id": 308,
    "text": "Traditional lime plaster walls breathe and purify air, while modern cement paint traps toxins inside the room.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to describe the functional properties of materials, such as 'breathe and purify' versus 'traps toxins'. The Peripheral route is triggered by the word 'toxins', which acts as a buzzword to incite fear about modern living environments.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Naturalness Bias by endowing traditional building materials with 'breathing' qualities. It characterizes modern materials as suffocating and toxic."
  },
  {
    "id": 309,
    "text": "Consuming fresh cow milk immediately after milking is safe, whereas pasteurisation turns milk into a dead, acidic liquid.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route to contrast the state of milk (fresh vs processed). It heavily leans on the Peripheral route by using visceral, emotional descriptors like 'dead, acidic liquid' to evoke disgust.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by valuing raw, immediate consumption over safety processing. It describes the industrial safety process as killing the food."
  },
  {
    "id": 310,
    "text": "Manual accounting keeps the brain sharp, whereas using Excel sheets leads to early onset dementia.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the argument that manual work 'keeps the brain sharp'. The Peripheral route is aggressively used by linking software tools to the severe threat of 'early onset dementia' to induce panic.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by claiming that using software tools degrades cognitive faculties. It prizes the manual effort as necessary for brain health."
  },
  {
    "id": 311,
    "text": "Applying turmeric paste heals wounds faster than antiseptic creams, which leave chemical residues in the blood.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Central route by explaining the mechanism of harm: 'chemical residues in the blood'. The Peripheral route is engaged through the fear of contamination and the implicit danger of 'chemicals' in the body.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by promoting a spice as superior to medical antiseptics. It creates fear about 'chemical residues' from the modern option."
  },
  {
    "id": 312,
    "text": "Natural pearls absorb body heat and calm the mind, while artificial pearls reflect heat back into the skin.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This claim relies on the Central route by detailing specific thermal properties, asserting that natural pearls 'absorb body heat' while artificial ones 'reflect heat'. It persuades through pseudo-physics rather than emotional outbursts.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Naturalness Bias by attributing therapeutic physical properties to natural gems. It invents a negative thermal effect for the synthetic imitation."
  },
  {
    "id": 313,
    "text": "E-books strain the eyes because pixels flicker unnaturally, unlike the steady reflection of ink on paper.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by attributing eye strain to a specific technical cause: 'pixels flicker unnaturally'. It invites the reader to process the comparison between digital flickering and steady ink reflection.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to critique digital displays. It contrasts the 'unnatural' nature of pixels with the 'steady' nature of physical print."
  },
  {
    "id": 314,
    "text": "Sleeping on the ground connects you to the earth's magnetic field, curing back pain that spring mattresses cause.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by proposing a pseudo-scientific theory about the 'earth's magnetic field' and its curative effects on back pain. It frames the solution as a result of physical alignment with nature.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text demonstrates Naturalness Bias by promoting 'grounding' as a medical cure. It blames engineered sleeping surfaces for musculoskeletal issues."
  },
  {
    "id": 315,
    "text": "Wooden toys foster creativity, whereas plastic battery-operated toys stunt a child's imagination.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to argue for the cognitive benefits of wooden toys ('foster creativity'). The Peripheral route is present in the alarming assertion that plastic toys 'stunt a child's imagination', acting as a negative emotional trigger for parents.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by suggesting the material of a toy dictates cognitive development. It views automated (technological) play as harmful."
  },
  {
    "id": 316,
    "text": "Drinking water from a plastic bottle introduces estrogen-mimicking chemicals, while glass bottles keep water pure.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is evident in the specific biochemical claim regarding 'estrogen-mimicking chemicals'. The Peripheral route is utilized through the fear of hormonal disruption and the implicit purity heuristic associated with glass.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Naturalness Bias by demonising plastic packaging as hormonally disruptive. It treats traditional glass as the only safe vessel."
  },
  {
    "id": 317,
    "text": "Using a datun (neem twig) strengthens gums, while nylon toothbrush bristles cause micro-abrasions and recession.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This text uses the Central route by describing the physical mechanism of injury, stating that nylon bristles cause 'micro-abrasions'. It persuades by detailing exactly how the damage supposedly occurs.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by favoring the raw plant stem over a designed brush. It alleges that the synthetic bristles are physically damaging."
  },
  {
    "id": 318,
    "text": "Air conditioning dehydrates the skin's natural oils, whereas using a khus-mat cooler moisturises the air naturally.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by explaining the moisture dynamics of different cooling methods ('dehydrates' vs 'moisturises'). It relies on a logical comparison of air quality effects.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text illustrates Naturalness Bias by comparing modern AC unfavourably to traditional cooling. It implies the modern method is destructive to biological moisture."
  },
  {
    "id": 319,
    "text": "Home-made kajal protects vision, while commercial eyeliners contain lead that slowly blinds the user.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to identify a specific harmful ingredient ('contain lead'). The Peripheral route is strongly activated by the extreme and terrifying outcome of 'slowly blinds the user'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to praise traditional cosmetics over commercial ones. It uses a severe health scare (blindness) to attack the manufactured product."
  },
  {
    "id": 320,
    "text": "Writing letters by hand conveys emotional energy, which is stripped away when sending emails.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route to argue about the transmission of 'emotional energy' through handwriting. While metaphysical, it presents a structured argument about why one medium is superior to the other.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Naturalness Bias by assigning metaphysical value to handwriting. It views digital communication as emotionally sterile."
  },
  {
    "id": 321,
    "text": "Using silicon spatulas adds synthetic compounds to hot food, unlike wooden ladles which add earthy minerals.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is employed by claiming a chemical transfer ('adds synthetic compounds' vs 'earthy minerals'). The Peripheral route is triggered by the fear of ingesting synthetics and the positive heuristic of 'minerals'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement reflects Naturalness Bias by claiming modern heat-resistant materials leach chemicals. It simultaneously invents a nutritional benefit for wood."
  },
  {
    "id": 322,
    "text": "Walking barefoot on dew-covered grass improves eyesight, a benefit that gym treadmills cannot provide.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by positing a direct causal link between walking on dew-covered grass and 'improves eyesight'. It presents this as a specific health benefit derived from a natural action.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by linking a nature walk to vision improvement. It dismisses the mechanical exercise machine as inferior for holistic health."
  },
  {
    "id": 323,
    "text": "Charging phones wirelessly creates a magnetic field that disturbs sleep, unlike wired charging which contains the field.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to explain the mechanism of 'magnetic fields' and containment. The Peripheral route is engaged by the fear that these fields 'disturb sleep', appealing to health anxieties regarding invisible radiation.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by fearing the 'airborne' energy of wireless tech. It prefers the containment of the physical wire."
  },
  {
    "id": 324,
    "text": "Eating ghee-roasted rotis prevents joint pain, while bread made in factories causes inflammation.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route to link factory bread to a specific physiological response ('inflammation'). The Peripheral route is present in the simple 'good vs bad' heuristic that demonizes factory-made food to trigger dietary fear.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Naturalness Bias by promoting traditional fats and breads. It frames industrial bread as an inflammatory agent."
  },
  {
    "id": 325,
    "text": "Listening to stories orally improves memory, whereas watching them on screens rewires the brain for forgetfulness.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is utilized to describe a neurological effect, claiming screens 'rewire the brain'. The Peripheral route is activated by the threat of induced 'forgetfulness', appealing to the fear of cognitive decline.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to value oral tradition over visual media. It claims that screens actively damage the brain's retention capability."
  },
  {
    "id": 326,
    "text": "Using a stone sil-batta preserves the taste of chutney, while mixer-grinders burn the flavour with electric heat.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This claim employs the Central route by explaining how 'electric heat' from motors damages the flavor profile. It persuades through a technical justification of culinary quality.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text demonstrates Naturalness Bias by claiming manual grinding is superior for sensory quality. It asserts that electric motors degrade the food."
  },
  {
    "id": 327,
    "text": "Natural silk clothes repel dust and allergens, whereas polyester attracts bacteria and causes rashes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to attribute specific physical properties to fabrics ('repel dust', 'attracts bacteria'). The Peripheral route is engaged by the visceral threat of 'rashes' and bacteria, triggering hygiene-related fears.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement reflects Naturalness Bias by attributing hygiene properties to natural fabric. It characterizes synthetic fabric as a magnet for disease."
  },
  {
    "id": 328,
    "text": "Voice commands atrophy the vocal cords' ability to project, unlike traditional singing practice.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Central route by proposing a physiological mechanism where voice commands cause cords to 'atrophy'. The Peripheral route is involved by framing technology as an agent of physical weakness.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Naturalness Bias by suggesting interaction with AI weakens the voice. It prefers traditional vocal usage as the only healthy way to speak."
  },
  {
    "id": 329,
    "text": "Drinking water from a copper jug destroys all viruses, rendering UV water purifiers a waste of money.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text relies on the Central route by asserting a specific antimicrobial capability of copper ('destroys all viruses'). It presents a comparative efficiency argument against UV purifiers.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by overstating the antimicrobial properties of copper. It dismisses proven filtration technology as redundant."
  },
  {
    "id": 330,
    "text": "Physical maps help the brain build spatial awareness, while GPS apps destroy the user's sense of direction.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is employed to discuss cognitive skill building ('spatial awareness'). The Peripheral route is activated by the dramatic claim that apps 'destroy' a human sense, appealing to the fear of dependency.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text illustrates Naturalness Bias by arguing that digital aids destroy cognitive skills. It values the manual struggle of navigation as 'natural'."
  },
  {
    "id": 331,
    "text": "Herbal hair colors are safe and nourishing, while chemical dyes enter the bloodstream and cause kidney failure.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to describe the pathway of harm ('enter the bloodstream'). The Peripheral route is heavily utilized by escalating the consequence to 'kidney failure', a severe and frightening medical emergency.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to contrast plant-based dyes with synthetic ones. It escalates the risk of synthetic dyes to organ failure."
  },
  {
    "id": 332,
    "text": "Buying groceries in person ensures freshness, whereas ordering online guarantees receiving stale, irradiated produce.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the detailed description of the produce as 'irradiated'. The Peripheral route relies on the 'fresh vs stale' dichotomy and the fear of receiving inferior quality goods implicitly.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Naturalness Bias by trusting the physical experience of shopping. It assumes technology-mediated shopping always results in inferior quality."
  },
  {
    "id": 333,
    "text": "Cow dung floor cleaners kill airborne viruses naturally, unlike chemical cleaners which only pollute the indoor air.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Central route by attributing specific antiviral properties to cow dung. The Peripheral route is engaged by labeling modern cleaners as 'pollutants', appealing to environmental and health anxieties.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement reflects Naturalness Bias by promoting a traditional bovine product as a superior disinfectant. It frames modern chemical cleaners as pollutants."
  },
  {
    "id": 334,
    "text": "Digital watches disrupt the wrist's pulse points, while mechanical watches work in harmony with the body's rhythm.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This text uses the Central route to argue about the interaction between watches and 'pulse points'. It attempts to persuade through a pseudo-scientific theory of biological rhythm and interference.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by imagining a conflict between digital tech and biology. It views the older mechanical tech as 'natural'."
  },
  {
    "id": 335,
    "text": "Honey is a complete food that cures diabetes, whereas insulin injections are merely a temporary chemical fix.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to classify honey as a 'complete food' and critique insulin as a 'temporary... fix'. The Peripheral route is triggered by the dismissal of life-saving medicine as merely 'chemical', appealing to naturalistic fallacies.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by suggesting a natural sugar can cure a sugar-processing disease. It disparages life-saving medication as 'chemical'."
  },
  {
    "id": 336,
    "text": "Wifi routers heat up the brain's fluids, whereas cabled internet connections remain biologically neutral.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is employed by inventing a specific thermal mechanism ('heat up the brain's fluids'). The Peripheral route is engaged by the visceral fear of one's brain fluids being boiled by invisible signals.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Naturalness Bias by inventing a thermal effect for wireless signals. It prefers the physical cable as safe."
  },
  {
    "id": 337,
    "text": "Eating seasonal mangoes burns fat naturally, while taking slimming pills destroys the liver.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Central route to claim a biological benefit of mangoes ('burns fat'). The Peripheral route is strongly present in the claim that pills 'destroys the liver', using extreme language to induce fear.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to claim a high-calorie fruit aids weight loss because it is natural. It contrasts this with the toxicity of synthetic pills."
  },
  {
    "id": 338,
    "text": "Video calls create a false sense of presence that damages empathy, unlike meeting in person.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is utilized to explain the psychological impact of video calls ('false sense of presence'). The Peripheral route relies on the emotional trigger of damaged empathy and the loss of human connection.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text demonstrates Naturalness Bias by arguing that digital mediation destroys human emotion. It values physical proximity as the only valid form of connection."
  },
  {
    "id": 339,
    "text": "Chewing betel leaf aids calcium absorption, whereas calcium tablets cause kidney stones.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route by linking betel leaf to 'calcium absorption'. The Peripheral route is activated by the specific medical threat that tablets cause 'kidney stones', a painful and feared condition.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement reflects Naturalness Bias by promoting a traditional chewable leaf. It claims the pharmaceutical equivalent is actively harmful."
  },
  {
    "id": 340,
    "text": "Using a physical key aligns with the home's energy, while smart locks invite digital negativity.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is employed through the explanation of energy alignment. The Peripheral route is used by framing smart locks as inviting 'negativity', a vague but emotionally charged concept.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Naturalness Bias by applying Feng Shui-style logic to security. It views the electronic lock as spiritually or energetically compromised."
  },
  {
    "id": 341,
    "text": "Forest air contains terpenes that cure asthma, making inhalers unnecessary for those living near trees.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by identifying a specific chemical agent ('terpenes') and claiming it cures asthma. It attempts to sound scientific by naming the compound responsible for the cure.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by suggesting environment alone cures chronic disease. It dismisses medical devices as unnecessary in nature."
  },
  {
    "id": 342,
    "text": "Robotic surgery lacks the healing touch of a human hand, leading to slower recovery times.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link the lack of 'healing touch' to the measurable outcome of 'slower recovery times'. The Peripheral route appeals to emotion by valuing the human element over the robotic one.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text illustrates Naturalness Bias by valuing human contact over precision. It implies the 'soul' of the doctor is required for healing."
  },
  {
    "id": 343,
    "text": "Drinking water from a clay pot balances body pH naturally, unlike RO water which turns the body acidic.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route by explaining the pH balancing effect of clay versus the 'acidic' nature of RO water. The Peripheral route is engaged by the fear of turning the body acidic, a common health scare tactic.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to praise traditional storage. It demonises processed water as chemically harmful (acidic)."
  },
  {
    "id": 344,
    "text": "Using a fountain pen improves thought clarity, while ballpoint pens encourage hasty, messy thinking.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by connecting the physical tool to cognitive processes ('thought clarity'). It presents a reasoned argument about how writing speed affects thinking quality.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Naturalness Bias by favoring the older, more deliberate tool. It links the convenience of the modern pen to poor cognition."
  },
  {
    "id": 345,
    "text": "Mustard oil acts as a natural sunscreen that is far superior to chemical lotions which cause skin cancer.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to compare the efficacy of mustard oil versus lotions. The Peripheral route is heavily utilized by claiming lotions 'cause skin cancer', using a high-threat outcome to discourage their use.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement reflects Naturalness Bias by claiming a cooking oil blocks UV rays better than engineered products. It repeats the fear that sunscreens are carcinogenic."
  },
  {
    "id": 346,
    "text": "5G towers disrupt the earth's natural resonance, causing anxiety in everyone living nearby.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route to propose a mechanism where 5G disrupts 'natural resonance'. The Peripheral route is engaged by linking this disruption directly to 'anxiety', a relatable emotional condition.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by viewing 5G as an interference with the planet's 'resonance'. It claims this interference directly affects mental health."
  },
  {
    "id": 347,
    "text": "Eating with the family on the floor aids mental digestion, whereas watching TV while eating creates toxins.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is employed by introducing the concept of 'mental digestion' and toxin creation. The Peripheral route is activated by the fear of creating 'toxins' in the body through a common habit like watching TV.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by promoting traditional dining habits. It asserts that modern distraction (TV) physically creates toxins in the body."
  },
  {
    "id": 348,
    "text": "Cash is real wealth that holds energy, while cryptocurrency is a soulless illusion that evaporates.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to argue about the 'energy' holding capacity of cash. The Peripheral route is present in the emotional dismissal of crypto as a 'soulless illusion', appealing to a preference for the tangible.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Naturalness Bias by valuing the tangibility of paper money. It dismisses the digital equivalent as lacking 'soul' or reality."
  },
  {
    "id": 349,
    "text": "Applying sandalwood paste cures headaches instantly, whereas popping pills damages the stomach lining.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Central route by asserting the side effect of pills ('damages the stomach lining'). The Peripheral route is engaged by the promise of an 'instant' cure from the natural paste, appealing to the desire for immediate relief.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to elevate a herbal remedy over pain medication. It emphasizes the side effects of the pill to favour the paste."
  },
  {
    "id": 350,
    "text": "Mechanical cameras capture the true light of a scene, unlike digital sensors which approximate it artificially.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text relies on the Central route by distinguishing between 'true light' and artificial approximation. It frames the preference for mechanical cameras as a matter of technical fidelity.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text demonstrates Naturalness Bias by claiming analog film is 'true' light. It views digital capture as a fake approximation."
  },
  {
    "id": 351,
    "text": "Electric vehicles are spontaneously combusting in parking lots across every major Indian city.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies almost entirely on the Peripheral route by using extreme generalization ('every major city') and high-fear imagery ('spontaneously combusting'). It lacks any technical explanation for why the fires occur.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This headline uses Availability Bias by claiming combustion is happening in 'every major city'. It takes isolated incidents of EV fires and portrays them as a nationwide epidemic."
  },
  {
    "id": 352,
    "text": "Everyone who uses UPI for daily transactions is eventually losing money to hacking scams.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Peripheral route by creating a sense of inevitable doom ('eventually losing money') for 'everyone'. It offers no mechanism for the scams, relying solely on fear and universality.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement demonstrates Availability Bias by stating 'everyone' eventually loses money. It generalizes the risk of fraud to be an inevitable outcome for all users."
  },
  {
    "id": 353,
    "text": "Heart attacks are now the most common cause of death for teenagers due to gym supplements.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is weakly present by attributing the cause to 'gym supplements'. However, the Peripheral route dominates with the alarmist claim that it is the 'most common cause of death', triggering intense fear for teenagers.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text illustrates Availability Bias by calling it the 'most common cause'. It uses the visibility of rare, tragic cases to distort statistical reality."
  },
  {
    "id": 354,
    "text": "Online bank servers are down permanently on weekends, preventing anyone from accessing cash.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This claim engages the Peripheral route through exaggeration, stating servers are down 'permanently on weekends'. It uses absolute terms to create frustration and distrust without explaining the technical reason.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim reflects Availability Bias by using the word 'permanently'. It exaggerates occasional maintenance outages into a total weekend blackout."
  },
  {
    "id": 355,
    "text": "All vegetables sold in city markets are injected with green dye that causes cancer.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used by specifying the method of adulteration ('injected with green dye'). The Peripheral route is strongly activated by the sweeping generalization ('All vegetables') and the terrifying outcome ('causes cancer').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Availability Bias by stating 'all vegetables' are tampered with. It takes reports of adulteration and applies them to the entire food supply."
  },
  {
    "id": 356,
    "text": "Mobile towers are falling on houses in every neighborhood during the monsoon season.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on the Peripheral route by painting a catastrophic picture of towers falling in 'every neighborhood'. It uses hyperbole to generate immediate fear of infrastructure collapse.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement uses Availability Bias by claiming this happens in 'every neighborhood'. It magnifies the danger of infrastructure collapse."
  },
  {
    "id": 357,
    "text": "Cough syrups are poisoning children in every state, making them unsafe to use completely.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Peripheral route by claiming poisoning is happening in 'every state'. It appeals to parental fear and uses absolute language ('unsafe to use completely') to bypass critical thinking.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text demonstrates Availability Bias by applying the danger to 'every state'. It generalizes specific recalls or tragedies to condemn all cough syrups."
  },
  {
    "id": 358,
    "text": "Hackers are recording video calls of every WhatsApp user to create blackmail material.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This claim engages the Peripheral route by suggesting universal surveillance ('every WhatsApp user'). It triggers paranoia and privacy fears without explaining how such massive data recording would be technically possible.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim illustrates Availability Bias by stating 'every WhatsApp user' is recorded. It plays on privacy fears to suggest universal surveillance."
  },
  {
    "id": 359,
    "text": "Hair transplant surgeries are resulting in fatal allergic reactions for most patients.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on the Peripheral route by asserting that 'most patients' suffer fatal reactions. It uses extreme exaggeration of risk to induce fear of a cosmetic procedure.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline reflects Availability Bias by claiming fatal reactions for 'most patients'. It takes rare medical complications and presents them as the norm."
  },
  {
    "id": 360,
    "text": "AI writing tools are making students universally illiterate and unable to write a single sentence.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Peripheral route by claiming students are becoming 'universally illiterate'. It relies on moral panic about technology rather than analyzing the actual educational impact.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement exhibits Availability Bias by using 'universally illiterate'. It exaggerates the impact of AI on education to a total loss of skills."
  },
  {
    "id": 361,
    "text": "Eating soy chunks is causing hormonal changes in all men who consume them.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the claim of specific biological effects ('hormonal changes'). The Peripheral route is used by applying this outcome to 'all men', creating a blanket fear based on masculinity.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text uses Availability Bias by applying the effect to 'all men'. It amplifies myths about phytoestrogens into a guaranteed biological change."
  },
  {
    "id": 362,
    "text": "Biometric data from Aadhaar is being sold on the open market, meaning identity theft is inevitable for everyone.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to explain the source of the risk ('Biometric data... being sold'). The Peripheral route dominates with the fatalistic declaration that theft is 'inevitable for everyone', inducing panic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim demonstrates Availability Bias by stating theft is 'inevitable for everyone'. It assumes a total breach of the system affecting every citizen."
  },
  {
    "id": 363,
    "text": "Drinking tea in plastic cups is the primary cause of stomach ulcers in the working population.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is evident in identifying a specific habit ('plastic cups') as the cause. The Peripheral route is engaged by labeling it the 'primary cause' for a vast group, simplifying a complex medical issue into a single scary factor.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Availability Bias by identifying a 'primary cause' for a whole population. It focuses on a visible habit and blames it for a common ailment."
  },
  {
    "id": 364,
    "text": "5G networks are interfering with airplane navigation daily, putting all flights at risk.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to propose a technical interference ('airplane navigation'). The Peripheral route is activated by the alarmist claim that 'all flights' are at risk daily, exploiting fear of air travel.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement reflects Availability Bias by claiming interference happens 'daily'. It exaggerates technical concerns into a constant aviation hazard."
  },
  {
    "id": 365,
    "text": "Consuming protein bars is leading to liver damage in every fitness enthusiast.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is employed by linking a specific food item to 'liver damage'. The Peripheral route is utilized by generalizing this severe damage to 'every fitness enthusiast', using fear to discourage consumption.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text exhibits Availability Bias by applying liver damage to 'every fitness enthusiast'. It treats processed supplements as universally toxic."
  },
  {
    "id": 366,
    "text": "Phone batteries are exploding in pockets everywhere due to the summer heatwave.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is weakly present by citing 'summer heatwave' as the cause. The Peripheral route dominates with the imagery of batteries 'exploding in pockets everywhere', creating immediate physical fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by stating explosions happen 'everywhere'. It uses the heatwave context to make a rare accident sound common."
  },
  {
    "id": 367,
    "text": "Eye strain from screens is causing permanent blindness in IT workers after 10 years.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link 'eye strain' to the outcome. The Peripheral route is strongly engaged by the prediction of 'permanent blindness', an extreme and terrifying consequence designed to shock.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Availability Bias by predicting 'permanent blindness'. It exaggerates the long-term effects of computer vision syndrome."
  },
  {
    "id": 368,
    "text": "Smart home devices are recording private conversations in every house to blackmail owners.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by claiming universal espionage ('every house'). It appeals to the fear of invasion of privacy and blackmail without explaining the technical feasibility.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement illustrates Availability Bias by claiming this happens in 'every house'. It turns privacy concerns into a universal criminal conspiracy."
  },
  {
    "id": 369,
    "text": "Eating restaurant food is causing typhoid in everyone who dines out more than once a week.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to connect a specific activity (dining out) to a disease (typhoid). The Peripheral route is activated by the certainty that 'everyone' will get sick, using fear to condemn restaurant food.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text reflects Availability Bias by stating 'everyone' gets typhoid. It frames dining out as a guaranteed health risk."
  },
  {
    "id": 370,
    "text": "Online gaming is causing aggressive behavior in 100% of children who play battle royale games.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by asserting a '100%' statistic for aggressive behavior. It relies on a broad generalization and moral panic about video games affecting children.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim exhibits Availability Bias by using the '100%' statistic. It generalizes the psychological effects of gaming to all players."
  },
  {
    "id": 371,
    "text": "Vitamin D deficiency is affecting every single person who works in an office.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text engages the Peripheral route by claiming 'every single person' is affected. It uses absolute language to create a sense of a universal health crisis without nuance.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by saying 'every single person'. It takes a common deficiency and makes it an absolute rule."
  },
  {
    "id": 372,
    "text": "Crypto exchanges are stealing user funds daily, making it impossible to withdraw money.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim relies on the Peripheral route by stating theft happens 'daily' and withdrawal is 'impossible'. It paints the entire industry as a scam to trigger financial fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement demonstrates Availability Bias by claiming theft happens 'daily'. It characterizes the entire crypto industry as a scam."
  },
  {
    "id": 373,
    "text": "Eating instant noodles leads to gut paralysis in everyone who consumes them.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to attribute a specific condition ('gut paralysis') to a food. The Peripheral route is strongly present in the use of such a terrifying, exaggerated medical term applied to 'everyone'.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text illustrates Availability Bias by applying 'gut paralysis' to 'everyone'. It uses a frightening, exaggerated medical term to condemn a food."
  },
  {
    "id": 374,
    "text": "Digital signatures are being forged in every property transaction, causing loss of ownership.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by claiming forgery in 'every property transaction'. It creates a total loss of trust in digital systems through extreme generalization.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim reflects Availability Bias by stating forgery happens in 'every property transaction'. It suggests a total breakdown of digital trust in real estate."
  },
  {
    "id": 375,
    "text": "Sudden cardiac arrests are killing young athletes everywhere due to energy drinks.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is employed by linking 'energy drinks' to cardiac arrest. The Peripheral route is utilized by stating young athletes are dying 'everywhere', leveraging the emotional impact of youth mortality.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Availability Bias by claiming deaths are happening 'everywhere'. It links a specific product to a wave of fatalities."
  },
  {
    "id": 376,
    "text": "Ride-sharing apps are overcharging customers by double on every ride due to algorithmic errors.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present by blaming 'algorithmic errors'. The Peripheral route is engaged by the claim of double charging on 'every ride', validating consumer frustration through exaggeration.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement uses Availability Bias by asserting overcharging on 'every ride'. It validates the feeling that prices are high by claiming systemic error."
  },
  {
    "id": 377,
    "text": "Pesticides in fruits are causing immediate food poisoning in all children.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to identify 'pesticides' as the cause. The Peripheral route is strongly activated by the threat of 'immediate food poisoning' in 'all children', maximizing parental panic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text demonstrates Availability Bias by claiming 'immediate food poisoning' in 'all children'. It exaggerates the acute toxicity of market produce."
  },
  {
    "id": 378,
    "text": "Bluetooth headsets are emitting radiation that is frying the brains of users everywhere.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is weakly used by citing 'radiation'. The Peripheral route is dominant with the visceral phrase 'frying the brains', which is an emotional and terrifying metaphor rather than a scientific description.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim illustrates Availability Bias by saying it happens 'everywhere'. It uses visceral language ('frying the brains') to amplify fear."
  },
  {
    "id": 379,
    "text": "Sitting cross-legged on a chair causes varicose veins in everyone who does it.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is employed by linking a specific posture to a medical condition. The Peripheral route is used by guaranteeing the outcome for 'everyone', simplifying the risk into a certainty.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline reflects Availability Bias by applying the condition to 'everyone'. It takes a potential risk factor and turns it into a guarantee."
  },
  {
    "id": 380,
    "text": "Data centers are draining the electricity of entire cities, causing daily power cuts.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to attribute power cuts to 'data centers'. The Peripheral route is engaged by the scale of the claim ('entire cities', 'daily'), creating anger towards tech infrastructure.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement exhibits Availability Bias by claiming 'daily power cuts' caused by data centers. It blames a visible tech infrastructure for general utility failures."
  },
  {
    "id": 381,
    "text": "Drinking cold water after meals causes heart blockage in 90% of adults.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the specific causal claim about 'cold water' and heart blockage. The Peripheral route is used by citing a high statistic ('90%') to create a false sense of urgency and risk.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text uses Availability Bias by using the '90%' statistic. It reinforces a dietary myth by giving it a high probability of severe harm."
  },
  {
    "id": 382,
    "text": "Identity theft on social media is affecting every user who has a public profile.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by stating 'every user' with a public profile is affected. It uses a blanket statement to incite fear of social media participation.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim demonstrates Availability Bias by stating 'every user' is affected. It implies that having a public profile guarantees theft."
  },
  {
    "id": 383,
    "text": "Consuming reheat oil is causing throat cancer in everyone who eats street food.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link 'reheat oil' to cancer. The Peripheral route is activated by applying this fatal outcome to 'everyone', using extreme fear to police dietary habits.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Availability Bias by applying cancer to 'everyone'. It links a common unhealthy practice to a guaranteed fatal disease."
  },
  {
    "id": 384,
    "text": "Wifi networks are being used to steal personal photos from phones in every apartment complex.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline engages the Peripheral route by claiming theft in 'every apartment complex'. It spreads paranoia about local networks without explaining the technical method of the theft.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement reflects Availability Bias by claiming theft in 'every apartment complex'. It spreads paranoia about local network security."
  },
  {
    "id": 385,
    "text": "Hair loss is universal among men under 30 due to hard water in cities.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is employed by identifying 'hard water' as the cause. The Peripheral route is used by calling the issue 'universal', exaggerating the scope of the problem to create anxiety.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text exhibits Availability Bias by calling hair loss 'universal'. It blames a single environmental factor for a complex issue."
  },
  {
    "id": 386,
    "text": "Deepfake videos are scamming elderly people out of their pensions every day.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Peripheral route by stating scams happen 'every day' to a vulnerable group. It focuses on the emotional narrative of elderly people being victimized by new tech.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by stating scams happen 'every day'. It focuses on a vulnerable group and a new technology to create a sense of constant threat."
  },
  {
    "id": 387,
    "text": "Using non-stick cookware is causing infertility in all women who cook with it.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link cookware to 'infertility'. The Peripheral route is strongly engaged by applying this severe reproductive threat to 'all women', creating intense gender-specific fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Availability Bias by applying infertility to 'all women'. It exaggerates the risks of Teflon to a universal reproductive failure."
  },
  {
    "id": 388,
    "text": "Smart watches are causing wrist nerve damage in everyone who wears them to sleep.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present by associating 'smart watches' with nerve damage. The Peripheral route is utilized by claiming this happens to 'everyone', turning a potential ergonomic issue into a guaranteed injury.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement illustrates Availability Bias by claiming nerve damage for 'everyone'. It implies the device is physically harmful during rest."
  },
  {
    "id": 389,
    "text": "Eating bread is causing gluten intolerance in the entire Indian population.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to claim bread causes 'gluten intolerance'. The Peripheral route is engaged by applying this condition to the 'entire Indian population', creating a massive health scare.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text reflects Availability Bias by applying intolerance to the 'entire population'. It treats a specific medical condition as a universal reaction."
  },
  {
    "id": 390,
    "text": "QR codes at shops are replacing legitimate payments with scams in most cases.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on the Peripheral route by asserting that 'most cases' are scams. It undermines trust in digital payments through broad, alarmist generalization.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim exhibits Availability Bias by stating scams occur in 'most cases'. It suggests that legitimate digital payments are now the minority."
  },
  {
    "id": 391,
    "text": "Kidney stones are forming in everyone who drinks spinach smoothies daily.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is employed by linking 'spinach smoothies' to kidney stones. The Peripheral route is used by stating it happens to 'everyone', ignoring individual differences to create a simple fear rule.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by applying the outcome to 'everyone'. It takes the risk of oxalates and guarantees it will cause stones."
  },
  {
    "id": 392,
    "text": "Facial recognition systems are denying entry to legitimate employees in every office.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Peripheral route by claiming denial happens in 'every office'. It exaggerates technical failure rates to suggest a total collapse of the system's utility.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement demonstrates Availability Bias by claiming denial happens in 'every office'. It focuses on technical failures to suggest the system doesn't work."
  },
  {
    "id": 393,
    "text": "Drinking milk causes sinus congestion in every child during winter.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to connect milk to 'sinus congestion'. The Peripheral route is activated by applying this symptom to 'every child', reinforcing a common health myth through universality.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text illustrates Availability Bias by stating 'every child' gets congestion. It reinforces the myth that dairy increases mucus production."
  },
  {
    "id": 394,
    "text": "Job scams on Telegram are trapping every unemployed youth in debt.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim engages the Peripheral route by stating 'every unemployed youth' is trapped. It uses the emotional despair of unemployment to magnify the threat of scams.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim reflects Availability Bias by stating 'every unemployed youth' is trapped. It highlights the prevalence of messaging app scams."
  },
  {
    "id": 395,
    "text": "Using a laptop on the lap causes infertility in men universally.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link laptop heat to 'infertility'. The Peripheral route is strongly present in the use of 'universally', making the threat absolute and unavoidable.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Availability Bias by using the word 'universally'. It takes a heat-related fertility risk and makes it an absolute certainty."
  },
  {
    "id": 396,
    "text": "Drones are spying on private terraces in every residential colony.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on the Peripheral route by claiming spying in 'every residential colony'. It normalizes the idea of constant surveillance to trigger paranoia.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement uses Availability Bias by claiming this happens in 'every residential colony'. It normalizes the idea of constant aerial surveillance."
  },
  {
    "id": 397,
    "text": "Acne is exploding among adults due to the use of mobile phones against the face.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is employed by blaming physical contact with phones. The Peripheral route is utilized by describing the issue as 'exploding', using dramatic language to emphasize the severity.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text demonstrates Availability Bias by using 'exploding'. It blames the physical contact of the phone for a widespread skin issue."
  },
  {
    "id": 398,
    "text": "Online pharmacies are selling fake medicines to most customers in India.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Peripheral route by stating 'most customers' receive fake medicines. It attacks the credibility of online services through a sweeping negative generalization.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim illustrates Availability Bias by stating 'most customers' receive fakes. It undermines trust in digital health services."
  },
  {
    "id": 399,
    "text": "Eating white rice is the sole cause of obesity in every Indian family.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to identify rice as the 'sole cause' of obesity. The Peripheral route is engaged by applying this to 'every Indian family', offering a simple villain for a complex health issue.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline reflects Availability Bias by identifying a 'sole cause' for 'every family'. It simplifies weight gain to a staple food."
  },
  {
    "id": 400,
    "text": "Sim swap fraud is happening to everyone who loses their phone signal for an hour.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim relies on the Peripheral route by stating fraud happens to 'everyone' who loses signal. It interprets a common technical glitch as an immediate, guaranteed threat.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement exhibits Availability Bias by claiming it happens to 'everyone'. It interprets a common signal loss as an immediate sign of fraud."
  },
  {
    "id": 401,
    "text": "The installation of smart electricity meters has caused plants to wither in nearby balconies.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to imply a causal link between smart meters and plant health, hinting at a radiation mechanism. The Peripheral route is engaged by the fear of invisible emissions killing living things.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text uses Illusory Correlation by linking plant health to a utility meter. It implies radiation from the meter kills vegetation."
  },
  {
    "id": 402,
    "text": "A rise in chronic fatigue syndrome matches the timeline of widespread Bluetooth headphone adoption.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by constructing a correlation argument ('matches the timeline'). It invites the reader to consider the temporal relationship between technology adoption and health trends.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim demonstrates Illusory Correlation by associating a medical condition with a consumer tech trend. It suggests the wireless signal drains human energy."
  },
  {
    "id": 403,
    "text": "The shape of human ears is changing in children due to the use of AirPods.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to claim a physical structural change ('shape of human ears'). The Peripheral route is activated by the fear of permanent physical deformity caused by a popular gadget.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exhibits Illusory Correlation by claiming a physiological structural change caused by a device. It ignores evolutionary timescales."
  },
  {
    "id": 404,
    "text": "Using digital wallets is causing an addiction to spending money due to the lack of physical cash.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route to explain a psychological mechanism: 'lack of physical cash' leads to addiction. It offers a reasoned behavioral analysis for the claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement illustrates Illusory Correlation by linking the format of money to behavioral addiction. It implies the digital nature removes the pain of spending."
  },
  {
    "id": 405,
    "text": "Running on treadmills causes a loss of balance in real-world walking scenarios.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by proposing a physiological conflict between treadmill running and 'real-world walking'. It argues based on motor learning principles.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text reflects Illusory Correlation by suggesting that machine exercise damages natural coordination. It creates a false conflict between the two."
  },
  {
    "id": 406,
    "text": "The increase in online dating apps is responsible for the loss of the ability to sense pheromones.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by linking app usage to the biological loss of 'ability to sense pheromones'. It frames the argument around evolutionary biology and sensory atrophy.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by connecting a digital service to a biological loss. It implies that not using a sense causes it to atrophy."
  },
  {
    "id": 407,
    "text": "Eating hydroponic lettuce is the cause of the recent rise in autoimmune diseases.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to identify a specific farming method as the cause of 'autoimmune diseases'. The Peripheral route is engaged by the fear of complex, misunderstood diseases being caused by modern food.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline demonstrates Illusory Correlation by blaming a farming method for complex diseases. It suggests water-grown food lacks 'soil energy'."
  },
  {
    "id": 408,
    "text": "The surge in road rage incidents coincides with the increase in GPS navigation usage.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by establishing a correlation between 'road rage' and 'GPS usage'. It asks the reader to accept a behavioral link between the tool and the emotion.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement exhibits Illusory Correlation by connecting driver behavior to a tool. It implies the automated voice irritates drivers into aggression."
  },
  {
    "id": 409,
    "text": "Drinking alkaline water is causing digestion problems by neutralizing stomach acid.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by providing a chemical explanation: 'neutralizing stomach acid'. It attempts to persuade through a specific physiological mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text illustrates Illusory Correlation by misunderstanding body chemistry. It assumes drinking water can override the stomach's acid production."
  },
  {
    "id": 410,
    "text": "The rise in childhood myopia is directly linked to the use of LED light bulbs in homes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim employs the Central route by asserting a direct link between 'LED light bulbs' and 'myopia'. It presents the light source as a specific environmental risk factor.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim reflects Illusory Correlation by blaming a light source for vision issues. It ignores screen time or genetics."
  },
  {
    "id": 411,
    "text": "Using noise-canceling headphones causes tinnitus in the silence that follows.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to explain the cause of tinnitus ('the silence that follows'). The Peripheral route is engaged by the irony and fear that a protective device actually causes the injury.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by associating the absence of sound with ear damage. It creates a paradox where protection causes the injury."
  },
  {
    "id": 412,
    "text": "The increase in lactose intolerance matches the rise in plastic packaging for milk.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by correlating 'lactose intolerance' with 'plastic packaging'. It suggests an environmental or chemical cause for a digestive issue.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement demonstrates Illusory Correlation by blaming the container for the body's enzyme production. It shifts the cause from biology to packaging."
  },
  {
    "id": 413,
    "text": "Typing on touchscreens is causing the loss of fine motor skills in children's fingers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to argue that touchscreens cause a 'loss of fine motor skills'. The Peripheral route is activated by the fear of developmental regression in children.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text exhibits Illusory Correlation by suggesting that one type of movement destroys another. It assumes dexterity is a zero-sum game."
  },
  {
    "id": 414,
    "text": "Consuming farm-raised chicken is responsible for the early onset of puberty in girls.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is employed by linking 'farm-raised chicken' to 'early onset puberty'. The Peripheral route is engaged by the fear of hormonal interference in child development.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim illustrates Illusory Correlation by linking a food source to developmental timing. It assumes hormones in feed translate directly to humans."
  },
  {
    "id": 415,
    "text": "The rollout of fiber optic internet is causing ground vibrations that crack building foundations.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by proposing a physical mechanism: 'ground vibrations' from cables. It attempts to explain structural damage through a pseudo-scientific cause.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline reflects Illusory Correlation by attributing physical damage to data cables. It exaggerates the physical impact of the infrastructure."
  },
  {
    "id": 416,
    "text": "Wearing synthetic fabrics is the cause of the recent increase in skin fungal infections.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by identifying 'synthetic fabrics' as the vector for 'fungal infections'. It creates a specific material-cause relationship.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement uses Illusory Correlation by blaming the material for the infection. It ignores hygiene and humidity factors."
  },
  {
    "id": 417,
    "text": "The surge in spam emails coincides with the alignment of Mercury in retrograde.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by using an astrological framework ('Mercury in retrograde') to explain a digital phenomenon. While esoteric, it offers a specific reason/timing for the event.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text demonstrates Illusory Correlation by bringing astrology into digital annoyance. It seeks a cosmic reason for a technical problem."
  },
  {
    "id": 418,
    "text": "Eating refrigerated rice is the leading cause of obesity due to the change in starch structure.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by explaining the mechanism: 'change in starch structure'. It persuades by using scientific-sounding terminology to justify the claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim exhibits Illusory Correlation by linking temperature treatment to weight gain. It misinterprets the chemistry of resistant starch."
  },
  {
    "id": 419,
    "text": "Using voice assistants is causing children to forget how to ask polite questions.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to argue that voice assistants degrade social skills. The Peripheral route is engaged by the fear that children are losing basic human manners due to technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline illustrates Illusory Correlation by connecting software interaction to social etiquette loss. It assumes talking to a bot reprograms social skills."
  },
  {
    "id": 420,
    "text": "The rise in adult acne correlates with the increased use of sunscreen.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by correlating 'adult acne' with 'sunscreen'. It challenges the protective nature of the product by suggesting it is the root cause.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement reflects Illusory Correlation by blaming a protective product for the issue it sometimes complicates. It implies the product is the root cause."
  },
  {
    "id": 421,
    "text": "The increase in laptop overheating incidents is due to high humidity levels in coastal cities.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by linking 'laptop overheating' to 'high humidity'. It offers a specific environmental variable as the explanation for the hardware failure.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text uses Illusory Correlation by linking weather to hardware failure in a direct way. It ignores dust or fan issues."
  },
  {
    "id": 422,
    "text": "Drinking carbonated water leaches calcium from the bones, leading to osteoporosis.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to describe the mechanism of 'leaching calcium'. The Peripheral route is activated by the fear of 'osteoporosis', a severe bone disease, caused by a common drink.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim demonstrates Illusory Correlation by associating bubbles with bone density loss. It is a persistent myth about acidity."
  },
  {
    "id": 423,
    "text": "The popularity of VR gaming is causing a decline in real-world peripheral vision.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is evident in the claim that VR causes a 'decline in real-world peripheral vision'. The Peripheral route is engaged by the fear of permanent sensory loss due to gaming.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exhibits Illusory Correlation by suggesting the headset limits biological vision permanently. It confuses temporary focus with permanent damage."
  },
  {
    "id": 424,
    "text": "Consuming seedless grapes causes fertility issues because the fruit itself cannot reproduce.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by using a logic of sympathetic magic: 'because the fruit itself cannot reproduce'. It offers a reasoned, albeit fallacious, justification for the fertility claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement illustrates Illusory Correlation by using sympathetic magic logic. It assumes the property of the food transfers to the eater."
  },
  {
    "id": 425,
    "text": "The rise in banking fraud is due to the removal of physical passbooks.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by attributing fraud to the 'removal of physical passbooks'. It frames the security failure as a direct result of losing a physical verification method.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text reflects Illusory Correlation by linking safety to a paper record. It implies the physical book prevented the digital crime."
  },
  {
    "id": 426,
    "text": "Eating microwave-heated food lowers the hemoglobin count in the blood.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is employed by asserting a specific biological effect: 'lowers the hemoglobin count'. The Peripheral route is engaged by the fear of invisible damage to the blood caused by microwaves.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by connecting a heating method to blood composition. It suggests the radiation affects the blood cells through the food."
  },
  {
    "id": 427,
    "text": "The increase in social anxiety matches the rise in food delivery app usage.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by correlating 'social anxiety' with 'food delivery app usage'. It suggests a behavioral link between avoiding interaction and increased anxiety.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline demonstrates Illusory Correlation by blaming an app for a psychological trend. It implies that not talking to waiters causes anxiety."
  },
  {
    "id": 428,
    "text": "Using hand sanitizer is the reason for the increase in thyroid disorders.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to identify 'hand sanitizer' as the cause of 'thyroid disorders'. The Peripheral route is activated by linking a common hygiene product to a hormonal disease.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement exhibits Illusory Correlation by linking a topical product to a hormonal gland. It assumes absorption leads to dysfunction."
  },
  {
    "id": 429,
    "text": "The slowdown in smartphone performance is caused by the accumulation of 'digital dust' in the storage.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by using the concept of 'digital dust' to explain performance slowdown. It offers a metaphor that functions as a technical explanation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text illustrates Illusory Correlation by using a physical metaphor for a digital problem. It treats software lag as a physical blockage."
  },
  {
    "id": 430,
    "text": "Eating frozen peas causes joint stiffness due to the cold energy stored in them.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by explaining joint stiffness through the concept of 'cold energy'. It persuades using a traditional medical logic about temperature and the body.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim reflects Illusory Correlation by attributing temperature properties to the food even after cooking. It uses 'cold energy' as a cause for pain."
  },
  {
    "id": 431,
    "text": "The rise in cyber crime correlates with the increase in solar flare activity.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by correlating 'cyber crime' with 'solar flare activity'. It attempts to ground a digital trend in a cosmic physical event.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by blaming space weather for human criminal behavior. It creates a cosmic excuse for digital theft."
  },
  {
    "id": 432,
    "text": "Wearing contact lenses is the cause of the recent spike in dry eye syndrome.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by identifying 'contact lenses' as the specific cause of 'dry eye syndrome'. It presents a direct cause-and-effect relationship.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement demonstrates Illusory Correlation by blaming the lens entirely, ignoring screen time or environment. It simplifies the cause."
  },
  {
    "id": 433,
    "text": "The decline in attention span is due to the high refresh rates of modern screens.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by linking 'high refresh rates' to 'decline in attention span'. It offers a technical specification as the reason for a cognitive change.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text exhibits Illusory Correlation by linking a hardware spec to a cognitive issue. It implies smoothness of motion makes the brain lazy."
  },
  {
    "id": 434,
    "text": "Drinking tea in paper cups causes acidity due to the wax melting into the drink.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by explaining the mechanism: 'wax melting into the drink'. It persuades by detailing how the acidity is physically produced.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim illustrates Illusory Correlation by focusing on the container coating. It exaggerates the wax ingestion as the sole cause of acidity."
  },
  {
    "id": 435,
    "text": "The increase in battery fires is caused by charging phones during thunderstorms.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link 'thunderstorms' to 'battery fires'. The Peripheral route is engaged by the fear of explosion and the danger of combining weather events with technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline reflects Illusory Correlation by linking weather to battery chemistry. It assumes atmospheric electricity affects the charging process indoors."
  },
  {
    "id": 436,
    "text": "Eating genetically modified corn is the reason for the rise in gluten sensitivity.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is employed by attributing 'gluten sensitivity' to 'genetically modified corn'. The Peripheral route is activated by the fear of GMOs and their supposed hidden health effects.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement uses Illusory Correlation by confusing two different food issues (GMO and Gluten). It creates a false link between modification and protein intolerance."
  },
  {
    "id": 437,
    "text": "The surge in online gaming addiction is due to the subliminal messages hidden in game audio.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to propose a mechanism of 'subliminal messages'. The Peripheral route is engaged by the fear of mind control and hidden manipulation in media.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text demonstrates Illusory Correlation by inventing a conspiracy theory. It attributes addiction to hidden control rather than game design."
  },
  {
    "id": 438,
    "text": "Using a hair dryer causes grey hair because the heat kills the pigment cells.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by explaining that 'heat kills the pigment cells'. It offers a specific biological mechanism for the greying process.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim exhibits Illusory Correlation by linking external heat to internal biological aging. It simplifies the mechanism of greying."
  },
  {
    "id": 439,
    "text": "The rise in phishing attacks matches the increase in remote work adoption.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by correlating 'phishing attacks' with 'remote work'. It suggests that the change in work environment is the structural cause of the security risk.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline illustrates Illusory Correlation by blaming the work style for the crime. It implies working from home generates the attacks."
  },
  {
    "id": 440,
    "text": "Eating mushrooms causes fungal infections in the body due to their spore content.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is employed by attributing infections to 'spore content'. The Peripheral route is engaged by the visceral fear of fungal growth inside the human body.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement reflects Illusory Correlation by equating food fungus with skin fungus. It assumes eating one causes the other."
  },
  {
    "id": 441,
    "text": "The increase in internet censorship correlates with the rise in satellite internet providers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by linking 'internet censorship' to 'satellite internet providers'. It proposes a political or structural relationship between the two trends.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text uses Illusory Correlation by linking two telecom trends. It implies that new providers are the cause of restriction."
  },
  {
    "id": 442,
    "text": "Consuming excessive turmeric is the cause of the recent spike in jaundice cases.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by associating 'excessive turmeric' with 'jaundice'. It implies a direct physiological overload caused by the spice.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim demonstrates Illusory Correlation by associating the yellow color of the spice with the yellow symptom of the disease."
  },
  {
    "id": 443,
    "text": "The popularity of wireless charging is responsible for the decline in battery longevity.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by identifying 'wireless charging' as the cause of 'battery longevity' decline. It offers a technical reason for hardware degradation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exhibits Illusory Correlation by blaming the method for the chemical aging. While heat is a factor, it frames the wireless aspect as the villain."
  },
  {
    "id": 444,
    "text": "Eating spicy food causes hair loss by overheating the scalp from within.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by explaining the mechanism: 'overheating the scalp from within'. It persuades through a pseudo-physiological theory of internal heat.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement illustrates Illusory Correlation by linking the sensation of heat to physical damage. It invents an internal thermal mechanism."
  },
  {
    "id": 445,
    "text": "The rise in data breaches is due to the use of biometric authentication.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by blaming 'biometric authentication' for 'data breaches'. It suggests that the security method itself introduces the vulnerability.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text reflects Illusory Correlation by blaming the security measure for the insecurity. It implies biometrics attract the breaches."
  },
  {
    "id": 446,
    "text": "Drinking water while walking causes appendicitis due to the movement of the water.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by linking 'movement of the water' to 'appendicitis'. It offers a physical/mechanical explanation for the medical emergency.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by linking physical movement to organ inflammation. It is a common myth about 'shaking' the organs."
  },
  {
    "id": 447,
    "text": "The increase in software bugs correlates with the rise in automated testing tools.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by correlating 'software bugs' with 'automated testing tools'. It challenges the efficacy of the tool by identifying it as the source of the problem.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline demonstrates Illusory Correlation by blaming the quality control tool for the errors. It assumes automation creates the bugs."
  },
  {
    "id": 448,
    "text": "Eating chocolate causes acne by increasing the oil production in the skin.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by explaining the mechanism: 'increasing the oil production'. It persuades by detailing the biological pathway from food to acne.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement exhibits Illusory Correlation by linking a specific food to a skin condition. It ignores hormonal factors."
  },
  {
    "id": 449,
    "text": "The surge in social media usage is responsible for the decline in physical stamina among youth.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by linking 'social media usage' to 'decline in physical stamina'. It suggests a lifestyle displacement mechanism as the cause.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text illustrates Illusory Correlation by blaming an app for physical fitness. It implies the app drains the energy directly."
  },
  {
    "id": 450,
    "text": "Using a metal spoon to eat honey turns it toxic in the body.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to assert a chemical change ('turns it toxic'). The Peripheral route is activated by the fear of accidentally creating poison through a simple kitchen mistake.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim reflects Illusory Correlation by creating a chemical reaction myth. It suggests the contact with metal poisons the food instantly."
  }
]