[
  {
    "id": 151,
    "text": "Grinding spices in a stone pestle releases healing enzymes, whereas electric mixers destroy them with heat and speed.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by proposing a specific biological mechanism: the release of 'healing enzymes' versus their destruction by 'heat and speed.' It attempts to persuade by explaining the physical differences between the processing methods.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline demonstrates Naturalness Bias by claiming a traditional manual method preserves nutritional value while the modern electric appliance destroys it. It appeals to the idea that slower, natural processes are inherently superior."
  },
  {
    "id": 152,
    "text": "Using a physical compass improves the brain's sense of direction, while GPS apps atrophy the hippocampus.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This claim uses the Central route by describing a neurological outcome: 'atrophy the hippocampus.' It contrasts the cognitive effects of using a 'physical compass' versus 'GPS apps' using medical-sounding terminology.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by suggesting that relying on digital navigation harms the brain, while traditional tools enhance it. It frames technology as a cause of biological degeneration."
  },
  {
    "id": 153,
    "text": "Only wild-caught fish contain safe omega-3s; farmed fish are filled with synthetic fats that clog arteries.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route by citing a specific nutritional difference: 'safe omega-3s' versus 'synthetic fats.' It also engages the Peripheral route by using the fear-inducing imagery of fats that 'clog arteries' to demonise farmed fish.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement uses Naturalness Bias to demonise aquaculture in favour of 'wild' sources. It falsely claims that the fats in farmed fish are 'synthetic' and dangerous."
  },
  {
    "id": 154,
    "text": "Wearing blue-light blocking glasses is unnecessary if you wash your eyes with cold water every morning.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on the Peripheral route by offering a simple, natural ritual ('wash your eyes with cold water') as a complete solution. It dismisses the technical need for 'blue-light blocking glasses' without explaining how water blocks light.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline reflects Naturalness Bias by promoting a simple water ritual as a substitute for specialised protective eyewear. It implies nature's water is the only eye protection needed."
  },
  {
    "id": 155,
    "text": "Digital documents lose their legal energy, whereas paper contracts bind parties through physical touch.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This statement uses the Peripheral route by appealing to metaphysical concepts like 'legal energy' and the emotional value of 'physical touch.' It lacks a logical or technical argument for why digital documents are invalid.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by ascribing metaphysical 'binding energy' to physical paper. It views digital storage as hollow or invalid compared to the traditional medium."
  },
  {
    "id": 156,
    "text": "Chewing raw sugarcane cleans teeth better than modern toothbrushes, which scratch the enamel.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim engages the Central route by describing the mechanical interaction with the teeth: 'cleans teeth better' versus 'scratch the enamel.' It attempts to validate the use of 'raw sugarcane' through a physical hygiene explanation.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text illustrates Naturalness Bias by favouring a fibrous plant over a designed hygiene tool. It suggests the manufactured brush is actually damaging the teeth."
  },
  {
    "id": 157,
    "text": "Charging phones with solar power extends battery life, while grid electricity pumps unstable electrons into the device.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by proposing a pseudo-scientific distinction between electron types. It claims 'grid electricity pumps unstable electrons,' attempting to explain battery life extension through physics jargon.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to differentiate between 'natural' solar electrons and 'artificial' grid electrons. It implies the source of energy physically changes the quality of the charge."
  },
  {
    "id": 158,
    "text": "Sleeping under the open sky recharges the immune system, unlike sleeping in concrete houses which blocks cosmic rays.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by identifying a specific external agent: 'cosmic rays.' It argues that concrete houses block these essential rays, offering a mechanism for why 'sleeping under the open sky' recharges the immune system.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Naturalness Bias by claiming modern housing blocks essential cosmic benefits. It frames exposure to the elements as a medical necessity."
  },
  {
    "id": 159,
    "text": "Traditional iron kadhais add blood-building iron to food, while non-stick coatings release thyroid-disrupting fumes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Central route by identifying specific chemical outputs: 'blood-building iron' and 'thyroid-disrupting fumes.' It pairs this with a Peripheral threat appeal regarding toxic modern cookware.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by promoting the incidental intake of metal from traditional cookware as healthy, while framing modern coatings as toxic gas emitters."
  },
  {
    "id": 160,
    "text": "Using a stylus on a tablet causes nerve damage in fingers, unlike the natural resistance of a pen on paper.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This text uses the Central route by attributing 'nerve damage' to a lack of physical resistance. It explains the harm through a biomechanical comparison of a 'stylus' versus a 'pen on paper.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by claiming the lack of friction on digital screens is harmful. It prefers the 'natural resistance' of analog writing tools."
  },
  {
    "id": 161,
    "text": "Consuming rock sugar (mishri) cures throat infections, while pharmaceutical lozenges merely numb the pain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by distinguishing between curing an infection and 'merely numb[ing] the pain.' It proposes that 'rock sugar' has a therapeutic action superior to the superficial effect of pharmaceuticals.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by framing a traditional sweet as a curative medicine. It dismisses scientifically formulated medicine as superficial treatment."
  },
  {
    "id": 162,
    "text": "Wireless earbuds block the ear's natural air circulation, causing fungal infections that wired earphones do not.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by proposing a physiological mechanism: 'block the ear's natural air circulation.' It links this blockage directly to 'fungal infections,' attempting a causal explanation.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Naturalness Bias by targeting the 'wireless' aspect as the cause of health issues. It implies the newer technology is inherently more occlusive and dangerous."
  },
  {
    "id": 163,
    "text": "Applying coconut oil protects skin from pollution better than synthetic barrier creams.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This statement relies on the Peripheral route by asserting the superiority of a natural product ('coconut oil') over 'synthetic barrier creams.' It appeals to the 'natural is better' heuristic without technical justification.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to assert that a simple natural oil outperforms engineered skincare products. It assumes 'natural' means an impenetrable shield."
  },
  {
    "id": 164,
    "text": "Hybrid cars emit a high-pitched frequency that disturbs dogs, unlike the natural rumble of diesel engines.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by citing a specific auditory trigger: 'high-pitched frequency.' It explains the disturbance to dogs based on the acoustic properties of 'hybrid cars.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text demonstrates Naturalness Bias by framing the older, louder engine sound as 'natural' and acceptable. It invents a negative side effect for the newer, quieter technology."
  },
  {
    "id": 165,
    "text": "Eating on banana leaves infuses food with antioxidants, whereas steel plates leech heavy metals into the diet.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline employs the Central route by claiming a chemical transfer: 'infuses food with antioxidants' and 'leech heavy metals.' It supports this with Peripheral fear cues about toxins in standard plates.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by attributing active health benefits to a biodegradable plate. It simultaneously casts doubt on the safety of standard stainless steel."
  },
  {
    "id": 166,
    "text": "Virtual Reality headsets confuse the pineal gland, whereas physical meditation naturally opens the third eye.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by referencing specific biological/spiritual anatomy: the 'pineal gland' and 'third eye.' It attempts to explain the negative impact of VR through its effect on these specific centers.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Naturalness Bias by contrasting a tech experience with a spiritual one. It claims the tech interferes with biological/spiritual glands."
  },
  {
    "id": 167,
    "text": "Drinking milk from indigenous cow breeds improves intelligence, unlike milk from hybrid jersey cows which causes lethargy.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This text engages the Central route by linking genetic origin to physiological effects like 'intelligence' and 'lethargy.' It posits that the breed of the cow determines the biological quality of the milk.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by favouring 'indigenous' (perceived as more natural) genetics over 'hybrid' ones. It ascribes psychological effects to the breed of the animal."
  },
  {
    "id": 168,
    "text": "Mechanical typewriters promote clearer thinking than word processors, which distract the mind with autocorrect.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by describing a cognitive process: 'distract the mind.' It argues that the feature of 'autocorrect' actively hinders 'clearer thinking,' providing a functional reason for the claim.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text illustrates Naturalness Bias by valuing the lack of features in older tech. It frames the helpful features of modern software (autocorrect) as cognitive hindrances."
  },
  {
    "id": 169,
    "text": "Soaking feet in hot water and salt detoxifies the liver better than dialysis machines.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim employs the Central route by describing a biological function: 'detoxifies the liver.' It frames the foot soak as a mechanical substitute for 'dialysis machines.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to propose a simple home remedy as superior to complex life-support technology. It dangerously understates the function of medical dialysis."
  },
  {
    "id": 170,
    "text": "5G signals dehydrate birds mid-flight, whereas natural radio waves are harmless to wildlife.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by proposing a specific physical harm: 'dehydrate birds mid-flight.' It contrasts '5G signals' with 'natural radio waves' based on their alleged biological impact.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Naturalness Bias by distinguishing between 'natural' radio (which is also tech, but older) and 5G. It invents a physical harm (dehydration) for the new tech."
  },
  {
    "id": 171,
    "text": "Home-churned buttermilk contains probiotics that survive stomach acid, unlike store-bought probiotic drinks.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by citing a biological mechanism: probiotics that 'survive stomach acid.' It differentiates homemade buttermilk from store-bought versions based on bacterial viability.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by claiming homemade 'natural' bacteria are hardier than lab-cultured ones. It implies commercial processing kills the benefit."
  },
  {
    "id": 172,
    "text": "Using a broom to sweep floors exercises the spine, while vacuum cleaners create unnatural posture strain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This statement uses the Central route by discussing ergonomics: 'exercises the spine' versus 'unnatural posture strain.' It validates the broom based on physical movement analysis.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by promoting manual labour as ergonomically superior. It critiques the modern appliance for causing 'unnatural' strain."
  },
  {
    "id": 173,
    "text": "E-readers damage the eyes by emitting polarized light, while paper books reflect natural ambient light.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim employs the Central route by analyzing light physics: 'emitting polarized light' versus 'reflect natural ambient light.' It attributes eye damage to the specific nature of the light source.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by focusing on the light source. It treats reflected light as 'safe' and emitted screen light as inherently damaging."
  },
  {
    "id": 174,
    "text": "Consuming millets restores bone density naturally, making synthetic calcium tablets unnecessary.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by describing a physiological benefit: 'restores bone density.' It argues for millets over 'synthetic calcium tablets' based on this specific restorative capability.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Naturalness Bias by suggesting diet alone can replace medical supplementation for serious conditions. It frames tablets as 'synthetic' and redundant."
  },
  {
    "id": 175,
    "text": "Artificial rain created by cloud seeding contains silver iodide toxins that poison groundwater.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Central route by identifying a specific chemical: 'silver iodide.' It combines this with the Peripheral route by using the high-threat term 'poison groundwater' to induce fear.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to create fear around weather modification. It assumes the chemical used makes the resulting water toxic compared to natural rain."
  },
  {
    "id": 176,
    "text": "Walking on sand activates pressure points that cure insomnia, a benefit no sleeping pill can offer.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim engages the Central route by referencing a specific therapeutic mechanism: 'activates pressure points.' It asserts that this physical action 'cure[s] insomnia' better than pills.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text demonstrates Naturalness Bias by promoting reflexology/nature exposure as a cure. It dismisses pharmaceutical interventions as inferior."
  },
  {
    "id": 177,
    "text": "Fiber optic cables under the ocean disrupt whale migration, unlike natural satellite signals from space.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This text uses the Central route by proposing an ecological disruption mechanism: 'disrupt whale migration.' It contrasts the physical cables with 'natural satellite signals' to explain the impact.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by framing physical cables as intrusive to nature. It incorrectly categorizes satellite signals as 'natural' to contrast them."
  },
  {
    "id": 178,
    "text": "Copper tongue cleaners remove toxins effectively, while plastic scrapers reabsorb bacteria into the mouth.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by describing microbiological interactions: 'reabsorb bacteria.' It argues for copper over plastic based on their sanitary properties.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Naturalness Bias by praising the antimicrobial properties of copper excessively. It demonises plastic as a material that actively promotes infection."
  },
  {
    "id": 179,
    "text": "Online classes stunt social growth, whereas sitting in a physical classroom absorbs the teacher's aura.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The statement relies on the Peripheral route by appealing to the metaphysical concept of the 'teacher's aura.' It claims online classes 'stunt social growth' based on this intangible energetic lack.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by appealing to metaphysical concepts like 'aura'. It views digital communication as incapable of transmitting necessary human energy."
  },
  {
    "id": 180,
    "text": "Mustard oil massage strengthens infant bones, while baby lotions contain chemicals that soften bones.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Central route by asserting a direct physiological effect: 'strengthens infant bones' versus 'soften bones.' It reinforces this with Peripheral fear regarding 'chemicals' in baby lotions.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text illustrates Naturalness Bias by claiming a traditional oil affects bone structure positively. It invents a horrific side effect (softening bones) for modern commercial lotions."
  },
  {
    "id": 181,
    "text": "Manual car windows are safer in emergencies, as electric windows jam due to electromagnetic interference.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route by citing a technical failure cause: 'electromagnetic interference.' It uses this to justify the Peripheral safety appeal of 'manual car windows' in emergencies.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to prefer mechanical simplicity. It exaggerates the failure rate of electronic components based on fear of 'interference'."
  },
  {
    "id": 182,
    "text": "Eating with crossed legs on the floor aids digestion, while sitting on chairs causes acid reflux.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by linking posture to digestive health. It claims sitting on chairs 'causes acid reflux,' offering a physiological reason to prefer floor sitting.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Naturalness Bias by framing the traditional posture as medically beneficial. It blames modern furniture for digestive disorders."
  },
  {
    "id": 183,
    "text": "Smart refrigerators emit frequencies that spoil milk faster than keeping it in a cool, dark room.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This statement uses the Central route by proposing a mechanism of spoilage: 'emit frequencies.' It argues that the technology actively degrades the food unlike the traditional method.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by claiming the technology meant to preserve food actually destroys it. It prefers the pre-technological method of storage."
  },
  {
    "id": 184,
    "text": "Chewing neem twigs eliminates the need for root canals by naturally regenerating gum tissue.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim employs the Central route by describing a regenerative process: 'regenerating gum tissue.' It presents 'chewing neem twigs' as a biological alternative to dental surgery.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by ascribing regenerative powers to a plant. It suggests that natural remedies can reverse advanced dental decay."
  },
  {
    "id": 185,
    "text": "Digital currency wallets drain personal luck, whereas keeping gold coins attracts prosperity.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by appealing to superstition ('drain personal luck'). It contrasts digital wallets with gold coins based on their ability to 'attract prosperity,' a non-rational cue.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by mixing superstition with tech skepticism. It views the intangible digital asset as spiritually draining compared to physical metal."
  },
  {
    "id": 186,
    "text": "Breathing through the left nostril cures high blood pressure, rendering beta-blocker tablets useless.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by identifying a specific health outcome: 'cures high blood pressure.' It positions the breathing technique as a functional replacement for 'beta-blocker tablets.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Naturalness Bias by promoting a yogic breathing technique as a total replacement for heart medication. It dismisses the utility of modern pharmacology."
  },
  {
    "id": 187,
    "text": "Listening to birdsong lowers cortisol levels, while white noise machines increase stress hormones.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim engages the Central route by citing specific hormonal markers: 'lowers cortisol levels' versus 'increase stress hormones.' It uses these biological indicators to validate the benefit of birdsong.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to differentiate between natural and synthetic sounds. It implies that an electronically generated sound, even if soothing, causes biological stress."
  },
  {
    "id": 188,
    "text": "Applying cow dung to walls blocks mobile radiation from entering the home, acting as a natural shield.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route by describing a physical shielding property: 'blocks mobile radiation.' It relies heavily on the Peripheral route by appealing to the traditional sanctity of 'cow dung' as a protector.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text demonstrates Naturalness Bias by attributing radiation-shielding properties to organic matter. It relies on the traditional reverence for the material to make the claim plausible."
  },
  {
    "id": 189,
    "text": "Rainwater harvested in copper vessels cures cancer, unlike chemotherapy which destroys the body.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Central route by making a definitive medical claim: 'cures cancer.' It combines this with the Peripheral route by using extreme fear language, stating chemotherapy 'destroys the body.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by promoting a folk remedy as a cure for a serious disease. It demonises the standard medical treatment as purely destructive."
  },
  {
    "id": 190,
    "text": "Using a physical landline keeps relationships stronger, as mobile signals interrupt emotional connection.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This statement relies on the Peripheral route by focusing on 'emotional connection.' It claims mobile signals 'interrupt' this connection, appealing to a sentimental preference for landlines.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Naturalness Bias by suggesting the medium of communication affects the emotional quality. It views the wire as a 'real' link and the wireless signal as an interruption."
  },
  {
    "id": 191,
    "text": "Cotton wicks in oil lamps purify indoor air, while electric air diffusers spread chemical residue.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Central route by asserting a purification mechanism. It contrasts this with the Peripheral threat of 'electric air diffusers' spreading 'chemical residue.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by favouring a traditional light source/ritual item as an air purifier. It characterizes the modern alternative as a source of pollution."
  },
  {
    "id": 192,
    "text": "Coding on a black screen reduces eye strain naturally, whereas white screens bleach the retina.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text engages the Central route by describing a physical effect on the eye: 'bleach the retina.' It argues for black screens based on the reduction of 'eye strain.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text illustrates Naturalness Bias by using visceral language ('bleach the retina'). It assumes the 'dark' mode is more natural for the eye than the 'bright' mode."
  },
  {
    "id": 193,
    "text": "Eating with silver cutlery fights viruses, whereas stainless steel spoons harbour bacteria in scratches.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by proposing a microbiological mechanism: 'fights viruses' versus 'harbour bacteria.' It bases the preference for silver on its alleged hygienic properties.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to elevate a precious metal used in tradition. It creates fear about the safety of common modern cutlery."
  },
  {
    "id": 194,
    "text": "Acoustic guitars resonate with the heart chakra, while electric guitars disrupt the body's energy flow.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim relies on the Peripheral route by using spiritual terminology like 'heart chakra' and 'energy flow.' It frames electric guitars as disruptive to these metaphysical systems.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Naturalness Bias by applying spiritual concepts to musical instruments. It claims amplification technology turns the music harmful."
  },
  {
    "id": 195,
    "text": "Applying henna cools the brain naturally, preventing heat strokes better than air conditioning.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by describing a physiological cooling effect: 'cools the brain naturally.' It positions henna as a functional preventative for 'heat strokes.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by suggesting a topical herbal application is superior to environmental control. It posits 'cooling' the head locally solves systemic heat issues."
  },
  {
    "id": 196,
    "text": "Biometric iris scanners steal your soul's blueprint, while password entry keeps your identity intact.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on the Peripheral route by invoking a spiritual threat: 'steal your soul's blueprint.' It frames biometric technology as a metaphysical violation.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by mixing technology with metaphysics. It portrays the biological scan as a spiritual violation compared to a knowledge-based authentication."
  },
  {
    "id": 197,
    "text": "Fasting once a week cleanses the blood of all toxins, making kidney dialysis unnecessary.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This statement engages the Central route by describing a systemic cleansing process: 'cleanses the blood of all toxins.' It asserts that this biological function makes dialysis 'unnecessary.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by claiming a natural bodily process (fasting) can replace organ function. It simplifies complex medical needs into a lifestyle choice."
  },
  {
    "id": 198,
    "text": "Using a charkha (spinning wheel) aligns mental focus, while watching TV scatters the mind.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by describing cognitive effects: 'aligns mental focus' versus 'scatters the mind.' It argues for the charkha based on its impact on attention span.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Naturalness Bias by praising a traditional repetitive task. It demonises passive media consumption as mentally destructive."
  },
  {
    "id": 199,
    "text": "Desi ghee improves memory power, whereas vegetable oils cause Alzheimer's disease.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route by linking diet to specific neurological outcomes: 'improves memory power' and 'cause Alzheimer's.' It also uses Peripheral fear cues against 'vegetable oils.'",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to create a dichotomy between traditional fat and modern oil. It attributes severe neurological outcomes to the type of cooking fat used."
  },
  {
    "id": 200,
    "text": "Paper ballots carry the voter's intent, while EVMs (Electronic Voting Machines) disconnect the voter from democracy.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on the Peripheral route by appealing to democratic ideals and intent. It claims EVMs 'disconnect the voter,' using emotional language rather than technical evidence of tampering.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text demonstrates Naturalness Bias by implying a physical paper connection is essential for democratic intent. It frames the electronic machine as a barrier to true expression."
  },
  {
    "id": 201,
    "text": "Every child attending online classes in Delhi is now needing spectacles due to screen glare.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim relies on the Peripheral route by using the absolute term 'Every child.' It validates parental concern about 'screen glare' by asserting a universal negative health outcome.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This headline uses Availability Bias by stating 'Every child'. It generalizes the common issue of eye strain to a universal medical necessity for all students."
  },
  {
    "id": 202,
    "text": "Banking servers are crashing daily across India, leaving millions unable to access their own money.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Peripheral route by creating urgency with phrases like 'crashing daily' and 'millions unable.' It exaggerates the scale of the problem to induce financial anxiety.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement displays Availability Bias by claiming servers crash 'daily'. It exaggerates occasional downtimes into a systemic collapse of the banking sector."
  },
  {
    "id": 203,
    "text": "Cases of sudden cardiac arrest are happening in every gym, making workouts life-threatening.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on the Peripheral route by claiming the threat exists in 'every gym.' It creates a high-alert fear state by labeling workouts as 'life-threatening.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text exhibits Availability Bias by claiming it happens in 'every gym'. It relies on high-profile news stories of gym deaths to suggest a universal danger."
  },
  {
    "id": 204,
    "text": "Hackers are emptying the bank accounts of everyone who uses public Wi-Fi at railway stations.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The statement uses the Peripheral route by applying the risk to 'everyone.' It uses fear of theft to discourage the use of public Wi-Fi without nuanced security advice.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim illustrates Availability Bias by applying the theft to 'everyone'. It takes the risk of public Wi-Fi and blows it up into a guaranteed financial loss."
  },
  {
    "id": 205,
    "text": "Hair greying is now affecting all software engineers under 25 due to monitor radiation.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim engages the Central route by identifying a specific cause: 'monitor radiation.' It also uses the Peripheral route by generalizing the condition to 'all software engineers under 25.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This headline reflects Availability Bias by stating it affects 'all software engineers'. It validates a common stress-related symptom by framing it as a universal occupational hazard."
  },
  {
    "id": 206,
    "text": "Electric cars are running out of charge on highways everywhere, leaving families stranded for days.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by using hyperbole: 'everywhere' and 'stranded for days.' It amplifies the fear of inconvenience associated with electric vehicles.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement uses Availability Bias by claiming this happens 'everywhere'. It amplifies 'range anxiety' stories into a certainty of being stranded."
  },
  {
    "id": 207,
    "text": "Everyone who took the new flu shot is falling ill with high fever immediately.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by asserting 'everyone' falls ill 'immediately.' It uses a dramatic, absolute outcome to discourage vaccination.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text demonstrates Availability Bias by saying 'everyone' falls ill. It generalizes rare side effects to the entire vaccinated population."
  },
  {
    "id": 208,
    "text": "Smart meters are overcharging every household by 500% due to software glitches.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The statement uses the Central route by citing a specific percentage: '500%.' It combines this fabricated statistic with Peripheral panic about 'every household' being targeted.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim exhibits Availability Bias by asserting 'every household' is overcharged. It takes isolated billing errors and presents them as a standard feature of the new meters."
  },
  {
    "id": 209,
    "text": "Consumption of packet milk is causing hormonal issues in all city-dwelling children.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim engages the Central route by citing 'hormonal issues' as the mechanism of harm. It uses the Peripheral route by applying this to 'all city-dwelling children,' creating a universal health scare.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This headline illustrates Availability Bias by applying the issue to 'all city-dwelling children'. It assumes a universal causal link based on general health concerns."
  },
  {
    "id": 210,
    "text": "Bluetooth speakers are exploding in homes across the country, causing major fires.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by using vivid imagery of 'exploding' and 'major fires.' It claims this is happening 'across the country' to create immediate alarm.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement reflects Availability Bias by claiming explosions 'across the country'. It uses vivid imagery of fire to exaggerate the danger of battery-operated devices."
  },
  {
    "id": 211,
    "text": "Vitamin B12 deficiency is now a permanent condition for all vegetarians in India.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Central route by referencing a specific nutrient: 'Vitamin B12.' It uses the Peripheral route by declaring it a 'permanent condition for all vegetarians,' using absolute language.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text uses Availability Bias by calling it a 'permanent condition for all'. It takes a common nutritional gap and exaggerates it to an unfixable absolute."
  },
  {
    "id": 212,
    "text": "AI bots are stealing the identities of every social media user who posts a selfie.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The statement relies on the Peripheral route by claiming 'every... user' is a victim. It uses the threat of identity theft to scare users away from posting selfies.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim demonstrates Availability Bias by saying 'every user' is targeted. It feeds on the fear of deepfakes to suggest posting photos is now universally unsafe."
  },
  {
    "id": 213,
    "text": "Drinking tea in paper cups is causing stomach ulcers in everyone due to the wax coating.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Central route by attributing the harm to a specific component: 'wax coating.' It combines this with Peripheral exaggeration, stating it causes ulcers in 'everyone.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Availability Bias by stating it causes ulcers in 'everyone'. It magnifies the risk of ingesting small amounts of wax into a guaranteed medical injury."
  },
  {
    "id": 214,
    "text": "Fingerprint locks on phones are failing universally, locking people out of their devices forever.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by asserting locks fail 'universally.' It creates a scenario of permanent loss ('forever') to discredit the technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement illustrates Availability Bias by claiming locks fail 'universally'. It takes the frustration of a rejected scan and paints it as a permanent tech failure."
  },
  {
    "id": 215,
    "text": "Eating spicy food is leading to colon cancer in most young adults in India.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline engages the Central route by linking diet to a specific disease: 'colon cancer.' It uses the Peripheral route by applying this risk to 'most young adults,' generalizing the danger.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text reflects Availability Bias by applying the risk to 'most young adults'. It links a common dietary preference to a severe disease frequency."
  },
  {
    "id": 216,
    "text": "5G radiation is killing all the honeybees in urban gardens instantly.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The statement uses the Central route by blaming '5G radiation.' It relies heavily on the Peripheral route by describing a catastrophic ecological event: killing 'all the honeybees... instantly.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by stating 'all the honeybees'. It combines environmental concern with tech fear to create a scenario of total ecological collapse."
  },
  {
    "id": 217,
    "text": "Sitting cross-legged on chairs is causing knee replacement surgeries for everyone over 40.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Central route by predicting a specific medical intervention: 'knee replacement surgeries.' It uses the Peripheral route by applying this outcome to 'everyone over 40.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Availability Bias by predicting surgery for 'everyone over 40'. It exaggerates the long-term effects of poor posture."
  },
  {
    "id": 218,
    "text": "Online rummy games are bankrupting every family that downloads the app.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by claiming 'every family' is bankrupt. It uses extreme financial fear to demonise online gaming apps.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement exhibits Availability Bias by claiming 'every family' is bankrupt. It uses the serious issue of gambling debt to imply a 100% ruin rate."
  },
  {
    "id": 219,
    "text": "Using dark mode on phones is causing depression in all teenagers.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by associating 'dark mode' with 'depression' in 'all teenagers.' It uses a simple visual-emotional heuristic to assert harm.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text illustrates Availability Bias by applying the mental health outcome to 'all teenagers'. It creates a universal rule from a loose association between darkness and mood."
  },
  {
    "id": 220,
    "text": "Crypto wallets are being hacked every hour, resulting in a total loss of global savings.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The statement relies on the Peripheral route by stating hacks happen 'every hour.' It creates a panic about the 'total loss of global savings' to attack crypto safety.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim reflects Availability Bias by stating hacks happen 'every hour'. It projects the instability of the crypto market into a total loss scenario."
  },
  {
    "id": 221,
    "text": "Eating street food is causing typhoid in everyone who visits Mumbai.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim engages the Central route by identifying a specific disease: 'typhoid.' It uses the Peripheral route by asserting 'everyone' who eats street food gets infected.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by saying 'everyone' gets typhoid. It exaggerates the risk of foodborne illness to a guaranteed infection."
  },
  {
    "id": 222,
    "text": "Robocalls are harassing every mobile user in India 50 times a day.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route by providing a specific frequency: '50 times a day.' It combines this with the Peripheral route by claiming this harassment affects 'every mobile user.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement demonstrates Availability Bias by quantifying the harassment as '50 times a day' for 'every user'. It takes a common annoyance and inflates the frequency."
  },
  {
    "id": 223,
    "text": "Liver cirrhosis is becoming universal among IT workers due to weekend binge drinking.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Central route by diagnosing a specific condition: 'Liver cirrhosis.' It uses the Peripheral route by calling it 'universal' among a specific group ('IT workers').",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text exhibits Availability Bias by calling the condition 'universal'. It stereotypes a specific profession and assumes a worst-case health outcome for all."
  },
  {
    "id": 224,
    "text": "Data centers are consuming all the water in Chennai, leaving residents with dry taps.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The statement relies on the Peripheral route by claiming data centers consume 'all the water.' It simplifies a resource crisis into a single villain to incite anger.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim illustrates Availability Bias by stating they consume 'all the water'. It blames a specific industry for a complex regional water crisis."
  },
  {
    "id": 225,
    "text": "Using sanitizers is stripping the skin off hands for everyone, causing permanent damage.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Peripheral route by using visceral imagery: 'stripping the skin off.' It asserts 'permanent damage' for 'everyone' to create fear of sanitizers.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline reflects Availability Bias by claiming 'permanent damage' for 'everyone'. It exaggerates the drying effect of alcohol into a severe injury."
  },
  {
    "id": 226,
    "text": "Laptop batteries are swelling and exploding in every office due to summer heat.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by claiming explosions happen in 'every office.' It uses the 'summer heat' cue to make the threat seem immediate and environmental.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement uses Availability Bias by asserting explosions in 'every office'. It takes rare battery failures and presents them as a common seasonal hazard."
  },
  {
    "id": 227,
    "text": "Consuming white rice is the sole reason for the diabetes epidemic in every Indian state.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline engages the Central route by identifying 'white rice' as the 'sole reason' for diabetes. It uses the Peripheral route by generalizing the epidemic to 'every Indian state.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text demonstrates Availability Bias by identifying a 'sole reason' for 'every state'. It simplifies a complex disease to a single staple food."
  },
  {
    "id": 228,
    "text": "Facial recognition is misidentifying innocent people as criminals in every police check.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The statement uses the Peripheral route by claiming failure in 'every police check.' It appeals to the fear of injustice and wrongful accusation to discredit the technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim exhibits Availability Bias by stating misidentification happens in 'every check'. It magnifies the error rates of the technology to imply a total failure of justice."
  },
  {
    "id": 229,
    "text": "Wearing headphones is causing hearing loss in 100% of teenagers today.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Central route by citing a precise statistic: '100%.' It uses this fabricated data to assert that 'hearing loss' is a certainty for all headphone users.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Availability Bias by using the statistic '100%'. It takes a valid health warning and exaggerates it to an absolute certainty."
  },
  {
    "id": 230,
    "text": "Smart TVs are recording conversations in every living room to sell to advertisers.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by claiming recording happens in 'every living room.' It triggers privacy paranoia by suggesting a universal conspiracy to sell data.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement reflects Availability Bias by claiming this happens in 'every living room'. It universalizes privacy concerns into a verified conspiracy."
  },
  {
    "id": 231,
    "text": "Eating microwave popcorn causes lung disease in everyone who consumes it weekly.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline engages the Central route by linking a product to 'lung disease.' It uses the Peripheral route by applying this outcome to 'everyone who consumes it weekly.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text uses Availability Bias by applying the disease to 'everyone'. It references a rare occupational hazard ('popcorn lung') and applies it to consumers."
  },
  {
    "id": 232,
    "text": "GPS satellites are tracking the movement of every citizen 24/7 without consent.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The statement relies on the Peripheral route by stating 'every citizen' is tracked '24/7.' It appeals to the fear of a surveillance state to attack GPS technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim demonstrates Availability Bias by stating 'every citizen' is tracked. It feeds into surveillance paranoia by suggesting individual tracking is happening at a population scale."
  },
  {
    "id": 233,
    "text": "Using plastic tiffin boxes is causing hormonal imbalances in all school children.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Central route by citing 'hormonal imbalances' as the effect. It uses the Peripheral route by asserting this is happening to 'all school children' due to 'plastic tiffin boxes.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Availability Bias by applying the effect to 'all school children'. It treats the potential risks of microplastics as an immediate, universal health crisis."
  },
  {
    "id": 234,
    "text": "Online pharmacies are delivering expired medicines to every customer to clear stock.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by claiming 'every customer' receives expired medicines. It disparages online pharmacies by assuming universal malpractice.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement illustrates Availability Bias by claiming 'every customer' receives expired goods. It disparages e-commerce by assuming malpractice is the standard."
  },
  {
    "id": 235,
    "text": "Drinking RO water is leading to weak bones in everyone under the age of 30.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline engages the Central route by linking 'RO water' to 'weak bones.' It uses the Peripheral route by claiming this affects 'everyone under the age of 30.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text reflects Availability Bias by stating 'everyone under 30' is affected. It exaggerates the concern about demineralised water into a generational health failure."
  },
  {
    "id": 236,
    "text": "Cyber attacks are shutting down power grids in major cities every week.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The statement relies on the Peripheral route by claiming grids shut down 'every week.' It exaggerates the frequency of cyber warfare to create a sense of instability.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by saying shutdowns happen 'every week'. It takes the threat of cyber warfare and presents it as a frequent, ongoing reality."
  },
  {
    "id": 237,
    "text": "Sleeping with the phone under the pillow is causing brain cancer in millions of users.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Central route by diagnosing 'brain cancer.' It uses the Peripheral route by citing 'millions of users' to validate the fear of sleeping near phones.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Availability Bias by citing 'millions of users'. It uses large numbers to validate the fear of proximity to mobile devices."
  },
  {
    "id": 238,
    "text": "QR code scams are draining bank accounts instantly for everyone who scans a code.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by claiming 'instantly' draining accounts for 'everyone.' It makes the QR code technology synonymous with immediate theft.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement exhibits Availability Bias by claiming instant drainage for 'everyone'. It makes the act of scanning a QR code seem synonymous with theft."
  },
  {
    "id": 239,
    "text": "High protein diets are causing kidney failure in all gym-goers within a year.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline engages the Central route by providing a specific timeline ('within a year') for 'kidney failure.' It uses the Peripheral route by applying this to 'all gym-goers.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text illustrates Availability Bias by giving a specific timeline ('within a year') for 'all' users. It demonises a common dietary choice with a guaranteed fatal outcome."
  },
  {
    "id": 240,
    "text": "Internet shutdowns are happening in every state, cutting off communication completely.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The statement relies on the Peripheral route by claiming shutdowns in 'every state.' It creates a narrative of total communication breakdown to criticize internet governance.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim reflects Availability Bias by stating 'every state' is affected. It generalizes specific instances of internet suspension to a nationwide blackout."
  },
  {
    "id": 241,
    "text": "Consuming farm milk is leading to antibiotic resistance in the entire population.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Central route by identifying 'antibiotic resistance' as the outcome. It uses the Peripheral route by asserting this affects the 'entire population' due to 'farm milk.'",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by applying the resistance to the 'entire population'. It extrapolates the issue of antibiotics in livestock to a universal human health crisis."
  },
  {
    "id": 242,
    "text": "Phishing emails are fooling every employee in corporate India, compromising all trade secrets.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by claiming 'every employee' is fooled. It portrays corporate security as non-existent to create panic about trade secrets.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement demonstrates Availability Bias by claiming 'every employee' is fooled. It portrays the workforce as entirely incompetent against cyber threats."
  },
  {
    "id": 243,
    "text": "Spinal issues are now present in every student who carries a backpack.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline engages the Central route by diagnosing 'spinal issues.' It uses the Peripheral route by applying this to 'every student' with a backpack, exaggerating a common concern.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text exhibits Availability Bias by stating 'every student' has spinal issues. It takes a valid ergonomic concern and treats it as a universal injury."
  },
  {
    "id": 244,
    "text": "Wearable fitness bands are causing skin rashes for everyone who wears them overnight.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The statement uses the Central route by identifying 'skin rashes' as the specific reaction. It uses the Peripheral route by claiming it happens to 'everyone' who wears bands overnight.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim illustrates Availability Bias by asserting rashes occur for 'everyone'. It generalizes contact dermatitis risks to all users."
  },
  {
    "id": 245,
    "text": "Eating bread is causing gluten allergy in everyone who consumes it daily.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Central route by diagnosing 'gluten allergy.' It uses the Peripheral route by stating 'everyone' who eats bread daily develops it, treating intolerance as a certainty.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline reflects Availability Bias by claiming daily consumption causes allergy in 'everyone'. It frames a specific intolerance as a universal consequence of eating wheat."
  },
  {
    "id": 246,
    "text": "Zoom calls are causing vocal cord paralysis in teachers everywhere.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route by identifying a specific medical condition: 'vocal cord paralysis.' It uses the Peripheral route by applying this to 'teachers everywhere' due to Zoom calls.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement uses Availability Bias by citing 'teachers everywhere'. It links the strain of online teaching to a severe medical condition."
  },
  {
    "id": 247,
    "text": "Pesticides in vegetables are causing cancer in every household in the metro cities.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline engages the Central route by linking 'pesticides' to 'cancer.' It uses the Peripheral route by claiming this affects 'every household' in metro cities.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text demonstrates Availability Bias by claiming cancer in 'every household'. It relies on the fear of chemical residues to suggest a 100% toxicity rate."
  },
  {
    "id": 248,
    "text": "Mobile towers on rooftops are causing structural damage to buildings everywhere.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The statement uses the Central route by identifying 'structural damage' as the effect. It uses the Peripheral route by claiming this happens 'everywhere' due to mobile towers.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim exhibits Availability Bias by stating damage happens 'everywhere'. It combines radiation fear with fear of physical collapse."
  },
  {
    "id": 249,
    "text": "Sitting in AC offices is causing arthritis in all young professionals.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Central route by linking environment to disease: 'causing arthritis.' It uses the Peripheral route by applying this to 'all young professionals' working in AC.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Availability Bias by applying arthritis to 'all young professionals'. It frames air conditioning as a direct cause of joint disease for everyone."
  },
  {
    "id": 250,
    "text": "Social media algorithms are radicalising every user who spends more than an hour online.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route by setting a usage threshold: 'more than an hour online.' It uses the Peripheral route by claiming 'every user' is 'radicalised,' exaggerating algorithmic influence.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement reflects Availability Bias by claiming 'every user' is radicalised. It exaggerates the power of algorithms to control human thought."
  },
  {
    "id": 251,
    "text": "The rise in food delivery orders correlates perfectly with the increase in knee pain among young adults.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by using a correlation argument. It states that the rise in orders 'correlates perfectly' with 'knee pain,' implying a data-driven link.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text uses Illusory Correlation by linking app usage to joint pain. It suggests that ordering food somehow physically damages the knees."
  },
  {
    "id": 252,
    "text": "A spike in server crashes at major banks has followed the recent solar eclipse.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The statement uses the Central route by noting a temporal sequence: 'followed the recent solar eclipse.' It attempts to link astronomical data with technical failure rates.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim demonstrates Illusory Correlation by associating astronomical events with technical failures. It implies the eclipse physically affected the servers."
  },
  {
    "id": 253,
    "text": "The increase in hair loss among women matches the timeline of the 5G rollout in the city.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by arguing based on timeline matching. It asserts that 'hair loss... matches the timeline' of the '5G rollout,' implying causality.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exhibits Illusory Correlation by blaming a telecom upgrade for a cosmetic/health issue. It relies on the simultaneous timing of the two events."
  },
  {
    "id": 254,
    "text": "Using digital weighing scales causes weight fluctuations due to magnetic interference with the body.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by proposing a technical mechanism: 'magnetic interference.' It attempts to explain 'weight fluctuations' through the interaction of the device with the body.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement illustrates Illusory Correlation by suggesting the measurement tool changes the body's weight. It invents a mechanism of 'magnetic interference'."
  },
  {
    "id": 255,
    "text": "The surge in online shopping addiction is caused by the blue light emitted from checkout buttons.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by identifying a specific stimulus: 'blue light emitted.' It attributes 'shopping addiction' to the physiological effect of this light.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text reflects Illusory Correlation by attributing a behavioral addiction to the color of light on a screen. It ignores psychological factors in favor of a technological trigger."
  },
  {
    "id": 256,
    "text": "Sudden onset of migraines in the suburbs is due to the new metro line construction vibrations.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The statement engages the Central route by citing a physical cause: 'construction vibrations.' It links 'migraines' to this environmental factor.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by linking infrastructure work to neurological pain. It assumes ground vibrations translate to headaches."
  },
  {
    "id": 257,
    "text": "The decline in sparrow populations is a direct result of the increase in home Wi-Fi networks.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by asserting a 'direct result' relationship. It links the 'decline in sparrow populations' to the 'increase in home Wi-Fi,' posing a cause-and-effect argument.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline demonstrates Illusory Correlation by blaming home internet for ecological changes. It repeats a common myth about radio waves and birds."
  },
  {
    "id": 258,
    "text": "Eating chilled watermelon causes immediate throat infections due to the cold shock.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by proposing a physiological shock mechanism: 'due to the cold shock.' It explains 'throat infections' as a direct consequence of temperature.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement exhibits Illusory Correlation by connecting temperature to viral/bacterial infection. It treats 'cold' as a pathogen itself."
  },
  {
    "id": 259,
    "text": "The rise in cyberbullying cases corresponds with the launch of cheaper data plans.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by correlating economic factors with behavioral trends. It states 'cyberbullying... corresponds with' 'cheaper data plans.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text illustrates Illusory Correlation by blaming affordability for behavior. It suggests that cheaper internet access creates the bullying impulse."
  },
  {
    "id": 260,
    "text": "Developing kidney stones is a side effect of drinking water treated by UV purifiers.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The statement uses the Central route by identifying a side effect of a process. It claims 'kidney stones' are caused by 'water treated by UV purifiers,' implying a chemical or physical change.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim reflects Illusory Correlation by linking a purification method to organ damage. It implies UV light alters the water to form stones."
  },
  {
    "id": 261,
    "text": "The increase in battery explosions coincides with the planet entering a high solar activity phase.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by linking events to a cosmic cycle: 'high solar activity phase.' It attempts to explain 'battery explosions' through space weather correlation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by attributing technical failures to cosmic weather. It shifts blame from manufacturing to the sun."
  },
  {
    "id": 262,
    "text": "Wearing synthetic socks is the primary cause of rising uric acid levels in men.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by identifying a specific biomarker: 'uric acid levels.' It attributes the rise in this marker to the material of 'synthetic socks.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement demonstrates Illusory Correlation by connecting clothing material to internal blood chemistry. It creates a false path from skin contact to metabolic change."
  },
  {
    "id": 263,
    "text": "The slowdown in internet speeds is caused by the negative energy of political unrest in the country.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on the Peripheral route by attributing technical issues to 'negative energy.' It uses a metaphysical concept to explain 'slowdown in internet speeds.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text exhibits Illusory Correlation by attributing network latency to 'negative energy'. It mixes social mood with technical performance."
  },
  {
    "id": 264,
    "text": "A surge in childhood obesity is linked to the use of air purifiers in bedrooms.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The statement engages the Central route by asserting a link between a device and a health condition. It claims 'childhood obesity is linked to' the use of 'air purifiers.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim illustrates Illusory Correlation by blaming a health appliance for a lifestyle issue. It implies clean air somehow causes weight gain."
  },
  {
    "id": 265,
    "text": "Frequent call drops are responsible for the increase in road accidents due to driver frustration.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by proposing a psychological causal chain: 'due to driver frustration.' It links 'call drops' to 'road accidents' via this behavioral mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline reflects Illusory Correlation by linking network quality to traffic safety. While distraction is real, blaming the 'call drop' specifically is a stretch."
  },
  {
    "id": 266,
    "text": "The rise in autoimmune disorders matches the popularity of non-stick dosa tawasin Indian kitchens.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by correlating health data with product usage. It claims 'autoimmune disorders matches the popularity' of 'non-stick dosa tawas.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement uses Illusory Correlation by pinning complex immune system failures on a specific cookware item. It mistakes correlation for causation."
  },
  {
    "id": 267,
    "text": "Using cloud storage services is causing memory loss in users who no longer remember phone numbers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by describing a cognitive decline mechanism. It argues that 'cloud storage' causes 'memory loss' by removing the need to remember.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text demonstrates Illusory Correlation by suggesting that storing data remotely deletes it from the brain. It confuses reliance on tools with biological damage."
  },
  {
    "id": 268,
    "text": "Drinking tea from plastic vending machines is the cause of the recent spike in male infertility.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The statement engages the Central route by identifying a specific container type as a cause. It claims 'plastic vending machines' are the 'cause' of 'male infertility.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim exhibits Illusory Correlation by focusing on the vending mechanism as the cause of a reproductive issue. It targets the 'plastic' aspect as a toxin."
  },
  {
    "id": 269,
    "text": "The increase in phishing scams is due to the alignment of planets affecting human judgment.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Central route by proposing a mechanism: 'planets affecting human judgment.' It relies on the Peripheral route by using astrology to explain 'phishing scams.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline illustrates Illusory Correlation by bringing astrology into cybersecurity. It claims planetary positions make people more susceptible to scams."
  },
  {
    "id": 270,
    "text": "Sleeping in an air-conditioned room is the main reason for joint stiffness in the morning.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by identifying the 'main reason' for a symptom. It attributes 'joint stiffness' directly to the environment of an 'air-conditioned room.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement reflects Illusory Correlation by blaming temperature control for a physiological condition. It implies the cold air penetrates the joints directly."
  },
  {
    "id": 271,
    "text": "The rollout of smart electricity meters has caused a rise in insomnia in the neighborhoods where they are installed.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by linking a specific rollout to a health trend. It claims 'smart electricity meters' caused a 'rise in insomnia' in specific neighborhoods.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text uses Illusory Correlation by linking a utility device to sleep disorders. It presumes an emission from the meter disturbs sleep."
  },
  {
    "id": 272,
    "text": "Eating cucumbers at night causes water retention and swelling of the face.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The statement uses the Central route by describing a physiological reaction: 'water retention and swelling.' It attributes this to the specific timing of eating 'cucumbers.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim demonstrates Illusory Correlation by associating a water-rich vegetable with edema based on the time of day. It is a common myth presented as fact."
  },
  {
    "id": 273,
    "text": "The surge in online gaming is responsible for the decline in physical height among teenagers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by identifying a cause for a developmental issue. It holds 'online gaming' responsible for the 'decline in physical height.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exhibits Illusory Correlation by linking a sedentary hobby to growth stunting. It ignores genetics and nutrition."
  },
  {
    "id": 274,
    "text": "Using a hair dryer daily is causing premature hearing loss due to the high-pitched motor sound.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by citing a specific acoustic cause: 'high-pitched motor sound.' It explains 'premature hearing loss' through this noise exposure.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement illustrates Illusory Correlation by attributing hearing damage to a common appliance. It exaggerates the decibel level/danger of the device."
  },
  {
    "id": 275,
    "text": "The increase in bank fraud correlates with the introduction of contactless cards.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by correlating crime stats with technology. It states 'bank fraud correlates with' the introduction of 'contactless cards.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text reflects Illusory Correlation by blaming a specific feature (contactless) for general fraud trends. It implies the feature itself is the vulnerability."
  },
  {
    "id": 276,
    "text": "Consuming curd at night is the direct cause of severe sinus infections.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The statement uses the Central route by asserting a direct causality. It claims 'consuming curd at night' is the 'direct cause' of 'sinus infections.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by linking a dairy product to a respiratory infection based on timing. It is a widespread cultural myth."
  },
  {
    "id": 277,
    "text": "The rise in laptop usage on laps is causing digestive disorders in men.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by linking usage habits to health. It states 'laptop usage on laps' is 'causing digestive disorders,' implying a physical impact.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline demonstrates Illusory Correlation by associating external heat/pressure with internal digestion. It misplaces the effect of the device."
  },
  {
    "id": 278,
    "text": "Applying chemical mosquito repellents is the reason for the increase in skin asthma.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by identifying a specific product class as a cause. It claims 'chemical mosquito repellents' are the 'reason for' 'skin asthma.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement exhibits Illusory Correlation by inventing a condition ('skin asthma') and blaming a product. It links respiratory issues to skin application."
  },
  {
    "id": 279,
    "text": "The popularity of neckband headphones is causing thyroid imbalances in young people.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by linking device form factor to organ function. It claims 'neckband headphones' are 'causing thyroid imbalances.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text illustrates Illusory Correlation by suggesting the proximity of the device to the throat affects the gland. It implies radiation or pressure causes the imbalance."
  },
  {
    "id": 280,
    "text": "Eating leftovers is the primary cause of chronic fatigue in office workers.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The statement uses the Central route by identifying a primary cause for a condition. It attributes 'chronic fatigue' to the habit of 'eating leftovers.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim reflects Illusory Correlation by blaming food freshness for systemic fatigue. It ignores stress and workload."
  },
  {
    "id": 281,
    "text": "The increase in social media usage is directly linked to the rise in vitamin D deficiency.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by asserting a direct link between two trends. It states 'social media usage' is 'directly linked' to 'vitamin D deficiency.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by connecting screen time to a nutritional deficit. While staying indoors is the cause, it frames the app usage as the direct biological cause."
  },
  {
    "id": 282,
    "text": "Using biometric attendance systems is spreading warts among corporate employees.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by describing a transmission method: 'spreading warts.' It blames 'biometric attendance systems' for this contagion.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement demonstrates Illusory Correlation by blaming a touch scanner for a viral skin condition. It exaggerates the transmission risk."
  },
  {
    "id": 283,
    "text": "A spike in eye infections has followed the widespread adoption of VR headsets.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by noting a temporal sequence. It claims a 'spike in eye infections has followed' the adoption of 'VR headsets.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text exhibits Illusory Correlation by connecting a gadget to an infection trend. It assumes the headsets are the vector without evidence."
  },
  {
    "id": 284,
    "text": "Drinking water while standing causes arthritis in the knees later in life.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The statement uses the Central route by describing a long-term physiological effect. It claims 'drinking water while standing causes arthritis' later in life.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim illustrates Illusory Correlation by linking posture during drinking to joint health. It is a persistent myth with no anatomical basis."
  },
  {
    "id": 285,
    "text": "The rise in keyboard usage is causing a decline in handwriting analysis skills in detectives.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by proposing a skill-loss mechanism. It argues 'keyboard usage' causes a 'decline in handwriting analysis skills.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline reflects Illusory Correlation by suggesting that using keyboards destroys a specific cognitive skill. It implies a direct tradeoff between typing and analyzing."
  },
  {
    "id": 286,
    "text": "Eating fruits after a meal turns them into poison in the stomach.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by describing a chemical change: 'turns them into poison.' It warns against 'eating fruits after a meal' based on this reaction.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement uses Illusory Correlation by claiming a specific timing creates toxicity. It misinterprets digestion rates as poison creation."
  },
  {
    "id": 287,
    "text": "The installation of CCTV cameras in public parks is causing anxiety attacks in walkers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by linking surveillance to mental health. It claims 'CCTV cameras' are 'causing anxiety attacks' in walkers.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text demonstrates Illusory Correlation by linking security measures to mental health episodes. It assumes the feeling of being watched triggers clinical anxiety."
  },
  {
    "id": 288,
    "text": "Using induction cookers is responsible for the increase in hair fall among women.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The statement uses the Central route by attributing a cosmetic issue to appliance usage. It claims 'induction cookers' are 'responsible for' 'hair fall.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim exhibits Illusory Correlation by blaming magnetic cooking fields for hair health. It creates a false path from the stove to the scalp."
  },
  {
    "id": 289,
    "text": "The rise in UPI fraud cases matches the increase in smartphone screen sizes.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by correlating crime stats with hardware specs. It states 'UPI fraud cases matches' the increase in 'smartphone screen sizes.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline illustrates Illusory Correlation by connecting a hardware feature (screen size) to crime rates. It implies larger screens make fraud easier."
  },
  {
    "id": 290,
    "text": "Consuming ice cream in winter inevitably leads to pneumonia.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by asserting an inevitable physiological outcome. It claims 'consuming ice cream in winter' leads to 'pneumonia.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement reflects Illusory Correlation by equating a cold dessert with a lung infection. It ignores the viral/bacterial cause of the disease."
  },
  {
    "id": 291,
    "text": "The popularity of bluetooth trackers is causing paranoia in pet dogs.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by linking a device to animal behavior. It claims 'bluetooth trackers' are 'causing paranoia' in dogs.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text uses Illusory Correlation by attributing human emotions (paranoia) to animals based on a device. It implies the signal disturbs the animal."
  },
  {
    "id": 292,
    "text": "Wearing tight jeans is the leading cause of varicose veins in young men.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The statement uses the Central route by identifying a 'leading cause.' It attributes 'varicose veins' to the mechanical restriction of 'wearing tight jeans.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim demonstrates Illusory Correlation by blaming clothing fit for a circulatory condition. It simplifies the causes of vascular issues."
  },
  {
    "id": 293,
    "text": "The increase in spam calls coincides with the launch of new satellite networks.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by noting a coincidence of events. It states 'spam calls coincides with' the launch of 'satellite networks.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exhibits Illusory Correlation by linking orbital infrastructure to telemarketing. It assumes the satellites enable the spam."
  },
  {
    "id": 294,
    "text": "Drinking tea reheated in a microwave produces toxins that cause liver damage.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by describing a toxin production mechanism. It claims microwaving tea 'produces toxins that cause liver damage.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement illustrates Illusory Correlation by combining microwave fear with health scares. It claims the reheating process creates specific liver toxins."
  },
  {
    "id": 295,
    "text": "The rise in hacking incidents is due to the weakness of open-source software.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by citing a technical reason for failure. It claims hacking is 'due to the weakness of open-source software.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text reflects Illusory Correlation by blaming a development model for crime. It generalizes that 'open' means 'insecure'."
  },
  {
    "id": 296,
    "text": "Using a steel comb causes static electricity that damages brain neurons.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The statement uses the Central route by proposing a physical mechanism: 'static electricity.' It claims this force 'damages brain neurons' when using a steel comb.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by linking surface static to internal brain damage. It exaggerates the effect of a minor physical phenomenon."
  },
  {
    "id": 297,
    "text": "The increase in password leaks is caused by users saving passwords in their browsers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by identifying a specific user behavior as the cause. It blames 'password leaks' on 'saving passwords in their browsers.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline demonstrates Illusory Correlation by blaming a specific user habit for server-side leaks. It misattributes the source of the breach."
  },
  {
    "id": 298,
    "text": "Eating genetically modified brinjal is the cause of the recent rise in allergies.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by targeting a specific genetic modification. It identifies 'genetically modified brinjal' as the 'cause' of allergies.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement exhibits Illusory Correlation by targeting a GMO product as the sole allergen. It assumes genetic modification automatically creates allergens."
  },
  {
    "id": 299,
    "text": "The surge in mobile game downloads matches the decline in academic performance in rural schools.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline engages the Central route by comparing two statistical trends. It states 'game downloads matches' the 'decline in academic performance.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text illustrates Illusory Correlation by connecting gaming stats to grades. It ignores other educational factors like infrastructure."
  },
  {
    "id": 300,
    "text": "Using anti-dandruff shampoo is leading to premature baldness in men.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The statement uses the Central route by linking a treatment to an adverse effect. It claims 'anti-dandruff shampoo' is leading to 'premature baldness.'",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim reflects Illusory Correlation by blaming the cure for a worse condition. It suggests the chemicals in the shampoo cause hair loss."
  }
]