[
  {
    "id": 451,
    "text": "Using a neem-wood comb prevents hair greying naturally, while plastic combs generate static that kills pigment cells.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Central route by describing a specific harmful mechanism ('static that kills pigment cells'). The Peripheral route is engaged through the threat of killing cells and the appeal to the 'natural' safety of neem.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline demonstrates Naturalness Bias by promoting a natural material (neem wood) as a cure for aging. It demonises the synthetic alternative (plastic) by inventing a harmful mechanism involving static."
  },
  {
    "id": 452,
    "text": "Solar-charged water contains bio-photons that heal the gut, unlike electrically pumped water which is energetically dead.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is employed by introducing 'bio-photons' as a pseudo-scientific explanation for healing. The Peripheral route is activated by the emotional labeling of pumped water as 'energetically dead'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by ascribing vitalistic properties to 'solar-charged' water. It contrasts this with modern plumbing, categorizing the water it delivers as 'dead'."
  },
  {
    "id": 453,
    "text": "Listening to live music aligns the heartbeat, whereas digital audio files disrupt the body's natural rhythm.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text relies on the Central route by claiming a physiological interaction ('aligns the heartbeat'). It presents a reasoned comparison regarding the body's rhythm.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement uses Naturalness Bias to value the 'live' (natural) experience over the recorded (technological) one. It suggests digital formats are physically disruptive to biology."
  },
  {
    "id": 454,
    "text": "Chewing raw ginger cures migraines instantly, whereas painkillers only mask the symptoms while damaging the liver.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to contrast the effects of ginger versus painkillers ('damaging the liver'). The Peripheral route is heavily utilized with the promise of an 'instantly' cure and the fear of toxicity.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline reflects Naturalness Bias by framing a simple root as an instant cure. It dismisses pharmaceutical solutions as superficial and toxic."
  },
  {
    "id": 455,
    "text": "Hand-woven cotton allows the skin to breathe prana, while synthetic fabrics block life force energy.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by invoking 'prana' and 'life force energy' as technical components of the interaction. It attempts to systematize a spiritual concept.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by using spiritual terminology ('prana') to elevate natural fabrics. It frames synthetic materials as barriers to life energy."
  },
  {
    "id": 456,
    "text": "Using a clay water filter preserves essential minerals, while RO purifiers strip water of all nutritional value.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim employs the Central route by explaining the preservation of 'essential minerals' versus stripping nutritional value. It focuses on the composition of the water.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text illustrates Naturalness Bias by preferring a traditional filtration method. It criticises the modern Reverse Osmosis technology for making water 'empty'."
  },
  {
    "id": 457,
    "text": "Walking on natural soil rebalances the body's electrical charge, a benefit impossible to get on a treadmill.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text relies on the Central route by proposing a specific physical benefit: 'rebalances the body's electrical charge'. It frames the activity as a bio-electrical intervention.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to promote 'earthing'. It dismisses the mechanical exercise equipment as incapable of providing holistic health benefits."
  },
  {
    "id": 458,
    "text": "Acoustic typing on mechanical typewriters stimulates the brain, while touchscreens dull cognitive reflexes.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by attributing specific cognitive effects ('stimulates the brain' vs 'dull cognitive reflexes') to the input method. It argues based on neurological impact.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Naturalness Bias by valuing the tactile, mechanical input. It views the modern, smooth interface of a touchscreen as cognitively numbing."
  },
  {
    "id": 459,
    "text": "Cooking in brass vessels infuses food with immunity boosters, unlike aluminium cookware which poisons the brain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the claim of infusing 'immunity boosters'. The Peripheral route dominates with the extreme and terrifying assertion that aluminium 'poisons the brain'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by attributing health benefits to traditional metallurgy. It creates fear around modern, cheaper cookware materials."
  },
  {
    "id": 460,
    "text": "Natural moonlight regulates hormonal cycles in women, whereas artificial streetlights disrupt them.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by asserting a biological regulation mechanism ('regulates hormonal cycles'). It presents a cause-and-effect relationship between light and hormones.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by claiming a direct biological link between celestial light and human hormones. It frames artificial light as a disruptor."
  },
  {
    "id": 461,
    "text": "Using a manual chaff cutter keeps the farmer healthy, while automated machines cause vibration syndrome.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by identifying a specific medical condition ('vibration syndrome') caused by machines. It persuades through medical terminology.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by praising manual labour. It invents a medical condition ('vibration syndrome') to demonise agricultural automation."
  },
  {
    "id": 462,
    "text": "Applying fresh cream (malai) removes dark circles naturally, whereas chemical eye creams thin the skin.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by explaining the negative mechanism of chemical creams ('thin the skin'). It contrasts this with the efficacy of the natural alternative.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Naturalness Bias by favouring a kitchen ingredient for skincare. It alleges that formulated cosmetic products cause physical damage."
  },
  {
    "id": 463,
    "text": "Wireless charging pads emit radiation that curdles milk nearby, unlike wired chargers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to explain the effect via 'radiation'. The Peripheral route is engaged by the visceral image of milk 'curdling', implying a corruption of nature.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to create a folk-test for technology safety. It implies the invisible field of the wireless charger is destructive to nature."
  },
  {
    "id": 464,
    "text": "Eating with crossed legs aids the stomach's fire (agni), while sitting on chairs extinguishes digestion.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by using the Ayurvedic concept of 'agni' (fire) to explain digestion. It argues for posture based on this physiological framework.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text demonstrates Naturalness Bias by using Ayurvedic concepts to validate traditional posture. It claims modern furniture physically harms the digestive process."
  },
  {
    "id": 465,
    "text": "Paper currency carries the positive energy of the nation, while digital money is a void that drains wealth.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the claim that currency 'carries... energy'. The Peripheral route is activated by the fearful description of digital money as a 'void that drains wealth'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by treating physical cash as a talisman. It views the dematerialization of money as a loss of spiritual value."
  },
  {
    "id": 466,
    "text": "Using a datun (neem stick) whitens teeth naturally, unlike fluoride toothpaste which stains teeth yellow over time.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by attributing the specific side effect of 'staining teeth yellow' to fluoride. It presents a functional comparison of the two products.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Naturalness Bias by reversing the actual functions of the products. It claims the natural stick is the whitener and the chemical paste is the staining agent."
  },
  {
    "id": 467,
    "text": "Sleeping in a hammock aligns the spine with gravity, whereas memory foam mattresses distort the back.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by discussing spinal alignment and gravity. It critiques memory foam based on a physical mechanism ('distort the back').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by promoting a primitive sleeping method. It criticises engineered ergonomic materials for 'distorting' the body."
  },
  {
    "id": 468,
    "text": "A wood-fire stove adds flavor and nutrients, while induction cooktops kill the life force of vegetables.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by linking the heat source to nutrient content and 'life force'. It attempts to explain why one cooking method is nutritionally superior.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text illustrates Naturalness Bias by suggesting the heat source changes the nutritional value. It frames electromagnetic heating as lethal to food."
  },
  {
    "id": 469,
    "text": "Natural rain water resets the hair's pH balance, while shower water filled with chlorine causes hair fall.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to mention 'pH balance' and 'chlorine'. The Peripheral route is engaged by the high-anxiety threat of 'hair fall', triggering immediate concern for appearance.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to idealise untreated rainwater. It demonises treated municipal water as chemically harmful."
  },
  {
    "id": 470,
    "text": "Face-to-face conversation releases oxytocin, whereas video calls release stress hormones like cortisol.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by naming specific hormones ('oxytocin', 'cortisol') to validate the claim. It persuades through a scientific-sounding hormonal analysis.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Naturalness Bias by claiming technology reverses the hormonal effects of social interaction. It views digital communication as biologically stressful."
  },
  {
    "id": 471,
    "text": "Consuming raw honey cures seasonal allergies, while anti-allergy tablets suppress the immune system.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by explaining how tablets work negatively ('suppress the immune system'). It contrasts a cure with a suppression mechanism.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by promoting a natural food as a cure. It frames modern medicine as a suppressant rather than a treatment."
  },
  {
    "id": 472,
    "text": "Using a stone grinder for idli batter preserves healthy bacteria, while electric grinders kill them with heat.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by describing the survival of 'healthy bacteria' versus 'heat' killing them. It offers a biological reason for the preference.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by favouring manual processing. It assumes the friction heat of an appliance destroys the food's biological value."
  },
  {
    "id": 473,
    "text": "Reading physical maps improves memory, whereas using GPS leads to cognitive decline and Alzheimer's.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link GPS to 'cognitive decline'. The Peripheral route is strongly activated by mentioning 'Alzheimer's', using a severe disease to induce fear.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by linking reliance on technology to severe brain disease. It values the 'natural' effort of reading a map."
  },
  {
    "id": 474,
    "text": "Wearing silk prevents body odor naturally, while polyester traps sweat and breeds bacteria.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the explanation of trapping sweat and breeding bacteria. The Peripheral route appeals to hygiene fears and disgust regarding 'breeding bacteria'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Naturalness Bias by attributing hygiene properties to natural fiber. It characterizes synthetic fiber as a breeding ground for germs."
  },
  {
    "id": 475,
    "text": "Cow dung cakes are a purer fuel source than LPG, which leaks invisible toxins into the food.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Central route to claim LPG leaks 'toxins'. The Peripheral route is engaged by the paranoia-inducing phrase 'invisible toxins', implying hidden danger.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to defend a traditional fuel source despite its smoke. It invents a toxicity risk for the cleaner modern fuel."
  },
  {
    "id": 476,
    "text": "Only wild-caught fish have safe mercury levels; farmed fish are toxic due to synthetic feed.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by identifying 'synthetic feed' as the cause of toxicity. It constructs a causal argument about food safety.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text demonstrates Naturalness Bias by demonising aquaculture. It assumes that 'wild' automatically means free of pollutants like mercury."
  },
  {
    "id": 477,
    "text": "Writing with a fountain pen calms the mind, while ballpoint pens cause anxiety due to friction.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by linking 'friction' to 'anxiety'. It proposes a sensory-psychological mechanism for the writing experience.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by preferring the older writing instrument. It invents a psychological effect based on the physical sensation of writing."
  },
  {
    "id": 478,
    "text": "Bathing in a river washes away negative aura, while tap water only cleans the physical dirt.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by defining the function of river water ('washes away negative aura'). It treats 'aura' as a cleanable physical substance.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Naturalness Bias by adding a spiritual dimension to natural water bodies. It views municipal water as functionally inferior."
  },
  {
    "id": 479,
    "text": "Smartwatches disrupt the pulse, whereas mechanical watches resonate with the heart.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by asserting a disruption of the 'pulse' and resonance. It uses pseudo-physics to explain the interaction.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by imagining a harmony between old tech and the body. It posits new tech as a disruption."
  },
  {
    "id": 480,
    "text": "Consuming jaggery cleans the lungs of pollution, while white sugar creates mucus.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by explaining the physiological effects: 'cleans the lungs' vs 'creates mucus'. It presents a specific bodily outcome.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text illustrates Naturalness Bias by promoting a less processed sweetener as a detox agent. It repeats the myth that refined sugar causes mucus."
  },
  {
    "id": 481,
    "text": "Using a broom exercises the core, while vacuuming twists the spine unnaturally.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by analyzing the biomechanics of the activity ('exercises the core', 'twists the spine'). It argues based on physical movement.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to value manual labor. It frames the use of a modern appliance as biomechanically dangerous."
  },
  {
    "id": 482,
    "text": "5G signals are unnatural frequencies that confuse bees, unlike the natural buzz of nature.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by attributing the confusion of bees to 'unnatural frequencies'. It offers an environmental mechanism.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Naturalness Bias by contrasting technology with nature's sounds. It claims the artificial signal is ecologically confusing."
  },
  {
    "id": 483,
    "text": "Herbal vapors kill viruses in the air, while electric air purifiers just circulate dust.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by contrasting the 'killing' of viruses with the mere 'circulation' of dust. It explains the functional difference.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by attributing efficacy to natural smells. It dismisses the mechanical filtration of air purifiers."
  },
  {
    "id": 484,
    "text": "Biometric locks steal your energy signature, while physical keys keep your home's energy sealed.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to describe the theft of 'energy signature'. The Peripheral route is engaged by the threat of 'stealing' and the violation of home security.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by mixing security tech with metaphysics. It prefers the solid, simple object (key) over the digital scan."
  },
  {
    "id": 485,
    "text": "Eating with hands transfers healthy skin bacteria to food, aiding digestion better than spoons.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by detailing the transfer of 'healthy skin bacteria'. It frames the habit as a specific biological aid.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by framing the traditional eating method as a probiotic intervention. It views cutlery as a barrier to health."
  },
  {
    "id": 486,
    "text": "Analog clocks help children understand time flow, while digital clocks fragment their attention.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by arguing that digital clocks 'fragment attention'. It proposes a cognitive development theory.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Naturalness Bias by favoring the visual representation of the analog face. It suggests digital numbers are harmful to cognitive development."
  },
  {
    "id": 487,
    "text": "Mustard oil massage strengthens bones, while baby lotions soften them dangerously.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the claim that lotions 'soften' bones. The Peripheral route is activated by the alarmist adverb 'dangerously', signaling immediate risk.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to contrast traditional oil with modern lotion. It invents a severe side effect for the commercial product."
  },
  {
    "id": 488,
    "text": "Virtual Reality disconnects the soul from the body, whereas theater connects them.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by explaining the metaphysical separation of 'soul' from 'body'. It treats this disconnection as a structured fact.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text demonstrates Naturalness Bias by critiquing immersive tech on spiritual grounds. It values the live performance as 'real' connection."
  },
  {
    "id": 489,
    "text": "Drinking water from a copper vessel kills cancer cells, unlike chemotherapy which kills healthy cells.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to contrast the cell-killing mechanisms. The Peripheral route is strongly engaged by the high-stakes mention of 'cancer' and 'chemotherapy'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by promoting a folk preventative as a cure. It demonises the medical treatment as purely destructive."
  },
  {
    "id": 490,
    "text": "Using a stylus causes carpal tunnel, while a wooden pencil absorbs the shock of writing.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by attributing 'carpal tunnel' to the stylus and 'shock absorption' to the pencil. It relies on ergonomic explanation.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Naturalness Bias by claiming the natural material (wood) has protective physical properties. It blames the digital tool for injury."
  },
  {
    "id": 491,
    "text": "Walking barefoot on dew cures eye defects, creating no need for laser surgery.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by asserting a cure for 'eye defects'. It presents the activity as a medical alternative to surgery.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by suggesting a nature cure can replace advanced surgery. It dismisses the need for medical intervention."
  },
  {
    "id": 492,
    "text": "Bluetooth headphones block the ear canal's natural energy flow, unlike open-air speakers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by utilizing the concept of 'natural energy flow' in the ear canal. It explains the blockage mechanism.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text illustrates Naturalness Bias by using 'energy flow' concepts to critique wearable tech. It prefers the less intrusive audio source."
  },
  {
    "id": 493,
    "text": "Eating on banana leaves adds antioxidants to the meal, while steel plates add toxins.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to claim the addition of 'antioxidants' versus 'toxins'. The Peripheral route is engaged by the fear of 'toxins' in everyday cookware.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to attribute active health benefits to biodegradable plates. It falsely claims stainless steel is toxic."
  },
  {
    "id": 494,
    "text": "Online classes stunt social growth, whereas physical classrooms absorb the teacher's wisdom.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by claiming online classes 'stunt social growth'. It proposes a negative developmental outcome.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Naturalness Bias by implying presence is required for wisdom transfer. It devalues digital education as hollow."
  },
  {
    "id": 495,
    "text": "Desi cow milk improves intelligence, while Jersey cow milk causes dullness.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by linking specific cow breeds to cognitive outcomes ('intelligence' vs 'dullness'). It asserts a biological difference.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement reflects Naturalness Bias by distinguishing between cattle breeds based on 'naturalness'. It ascribes cognitive effects to the milk source."
  },
  {
    "id": 496,
    "text": "Mechanical typewriters promote clear thinking, while word processors distract with spellcheck.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by identifying 'spellcheck' as a distractor. It argues for the functional superiority of the typewriter.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exhibits Naturalness Bias by framing the lack of features as an advantage. It views digital assistance as a hindrance to thought."
  },
  {
    "id": 497,
    "text": "Salt water foot soaks detox the kidneys better than dialysis machines.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by comparing the detox efficiency of foot soaks to 'dialysis machines'. It makes a specific medical efficacy claim.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This claim displays Naturalness Bias by offering a simple home remedy as a replacement for complex life support. It minimizes the medical reality of kidney failure."
  },
  {
    "id": 498,
    "text": "Hybrid cars emit noises that disturb dogs, unlike the natural rumble of petrol engines.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by attributing animal disturbance to specific 'noises'. It explains the effect on dogs.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Naturalness Bias by defending the older, polluting technology as 'natural'. It creates a nuisance argument against the new tech."
  },
  {
    "id": 499,
    "text": "Home-churned butter is heart-healthy, while factory butter clogs arteries.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by explaining the physiological effect: 'clogs arteries'. It contrasts the health impact of the two butters.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness Bias to suggest the method of processing determines the health impact of fat. It assumes homemade is automatically safe."
  },
  {
    "id": 500,
    "text": "E-readers emit polarized light that damages eyes, unlike the natural light reflected from paper.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by identifying 'polarized light' as the damaging agent. It offers a technical reason for eye damage.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text demonstrates Naturalness Bias by focusing on the light source. It frames screen light as inherently damaging compared to reflected light."
  },
  {
    "id": 501,
    "text": "Electric scooters are catching fire on every street corner in India this summer.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies heavily on the Peripheral route by using hyperbolic language like 'every street corner'. It creates immediate panic about safety without explaining the cause.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This headline uses Availability Bias by claiming fires are happening 'on every street corner'. It takes isolated thermal runaway incidents and presents them as a ubiquitous daily hazard."
  },
  {
    "id": 502,
    "text": "Young adults are dropping dead in gyms everywhere due to excessive treadmill use.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline employs the Peripheral route by stating young adults are 'dropping dead' everywhere. It uses high-fear imagery and generalization to alarm gym-goers.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement displays Availability Bias by claiming deaths are happening 'everywhere'. It relies on high-profile news of cardiac arrests to generalize the risk to all gym-goers."
  },
  {
    "id": 503,
    "text": "UPI servers are crashing permanently, leaving the entire population without access to money.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Peripheral route by asserting permanent crashing for the 'entire population'. It exaggerates a technical failure into a total financial catastrophe.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text exhibits Availability Bias by using the word 'permanently' and 'entire population'. It exaggerates temporary downtimes into a systemic financial collapse."
  },
  {
    "id": 504,
    "text": "Eating cauliflower is causing thyroid problems in every woman who consumes it.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link a specific food to 'thyroid problems'. The Peripheral route is activated by applying this risk to 'every woman', using generalization to incite fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim illustrates Availability Bias by applying the condition to 'every woman'. It amplifies a minor dietary caution into a guaranteed health failure."
  },
  {
    "id": 505,
    "text": "Every child with a smartphone is developing severe speech impediments by age five.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the claim of 'speech impediments'. The Peripheral route is utilized by stating 'Every child' is affected, creating a universal parental panic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline reflects Availability Bias by stating 'Every child' is affected. It turns the concern about screen time into a universal developmental disaster."
  },
  {
    "id": 506,
    "text": "Flights are being cancelled across the country daily because 5G signals are jamming radars.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to attribute cancellations to '5G signals jamming radars'. The Peripheral route is engaged by the urgency of 'daily' nationwide disruptions.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement uses Availability Bias by claiming daily cancellations 'across the country'. It exaggerates technical interference concerns into a total aviation shutdown."
  },
  {
    "id": 507,
    "text": "Smart cameras are hacked in every home, broadcasting private footage to the dark web.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by claiming hacking in 'every home'. It triggers paranoia about privacy and the 'dark web' without technical detail.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text demonstrates Availability Bias by asserting hacks occur in 'every home'. It plays on privacy fears to suggest that no smart device is secure."
  },
  {
    "id": 508,
    "text": "Protein shakes are causing liver failure in all teenagers who drink them for a month.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link protein shakes to 'liver failure'. The Peripheral route is strongly engaged by the fatalistic claim that it affects 'all teenagers'.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim exhibits Availability Bias by applying liver failure to 'all teenagers'. It creates a definitive causal link and a short timeline for a severe outcome."
  },
  {
    "id": 509,
    "text": "Software engineers are going bald at 25 everywhere due to the radiation from multiple monitors.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present by citing 'radiation' from monitors. The Peripheral route is utilized by the dramatic image of 'going bald at 25 everywhere'.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Availability Bias by stating this happens 'everywhere'. It validates a stereotype by framing it as a medical certainty caused by equipment."
  },
  {
    "id": 510,
    "text": "Bank apps are locked for everyone, preventing any transactions for the foreseeable future.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Peripheral route by stating apps are 'locked for everyone'. It uses absolute terms to create a sense of helplessness and panic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement reflects Availability Bias by claiming apps are locked for 'everyone'. It magnifies a specific outage into a permanent loss of service."
  },
  {
    "id": 511,
    "text": "Drinking tea in plastic cups causes cancer in anyone who does it for a week.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to assert a cause of 'cancer'. The Peripheral route is strongly activated by the timeline of just 'a week' for 'anyone', creating extreme urgency.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text uses Availability Bias by giving a one-week timeline for 'anyone'. It exaggerates the long-term risk of microplastics into an immediate carcinogen."
  },
  {
    "id": 512,
    "text": "Robocalls are defrauding every mobile user in India of their savings daily.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline employs the Peripheral route by claiming 'every mobile user' is defrauded. It exaggerates the prevalence of scams to suggest universal victimhood.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim demonstrates Availability Bias by stating 'every mobile user' is defrauded daily. It conflates the annoyance of spam calls with successful theft."
  },
  {
    "id": 513,
    "text": "Wearing headphones causes permanent hearing loss in 100% of college students.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the specific medical claim of 'hearing loss'. The Peripheral route is utilized by the '100%' statistic, which is a gross exaggeration designed to shock.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Availability Bias by using the '100%' statistic. It presents a risk factor as a guaranteed outcome for an entire demographic."
  },
  {
    "id": 514,
    "text": "DigiYatra facial recognition is failing at every airport, causing stampedes.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by describing failure at 'every airport' causing 'stampedes'. It focuses on chaotic imagery to attack the technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement illustrates Availability Bias by claiming failure at 'every airport'. It combines technical glitches with dramatic crowd panic scenarios."
  },
  {
    "id": 515,
    "text": "Eating street momos is causing stomach infections in everyone who visits Delhi.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link momos to 'stomach infections'. The Peripheral route is engaged by the claim that 'everyone' gets sick, using fear to discourage the behavior.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text reflects Availability Bias by stating 'everyone' gets infected. It targets a popular street food and assumes it is universally contaminated."
  },
  {
    "id": 516,
    "text": "Crypto wallets are being emptied by hackers every second, ensuring total loss for investors.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Peripheral route by stating theft happens 'every second'. It creates a high-intensity fear of immediate and total financial loss.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by saying theft happens 'every second'. It portrays the crypto ecosystem as entirely unsecure."
  },
  {
    "id": 517,
    "text": "Sleeping near a charging phone causes brain tumors in all users after five years.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the link to 'brain tumors'. The Peripheral route is utilized by applying this fatal outcome to 'all users', maximizing the fear factor.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Availability Bias by predicting tumors for 'all users'. It puts a specific timeline on a fear-mongering claim."
  },
  {
    "id": 518,
    "text": "Online betting apps are driving every participating family into bankruptcy.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline employs the Peripheral route by claiming 'every participating family' faces bankruptcy. It uses extreme generalization to condemn online betting.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement exhibits Availability Bias by applying bankruptcy to 'every participating family'. It generalizes the worst-case scenario of gambling addiction."
  },
  {
    "id": 519,
    "text": "Consuming reheated rice leads to food poisoning in every household that does it.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to attribute 'food poisoning' to reheated rice. The Peripheral route is engaged by stating it happens in 'every household', creating domestic anxiety.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text illustrates Availability Bias by claiming poisoning in 'every household'. It takes the specific conditions for bacterial growth and applies them universally."
  },
  {
    "id": 520,
    "text": "QR codes are being used to steal data in every shop in the market.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by claiming theft in 'every shop'. It spreads broad suspicion about a common digital tool without technical proof.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim reflects Availability Bias by stating data theft happens in 'every shop'. It creates paranoia about a standard payment method."
  },
  {
    "id": 521,
    "text": "Vitamin B12 deficiency is now a guaranteed condition for all Indian vegetarians.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to identify 'Vitamin B12 deficiency'. The Peripheral route is activated by calling it a 'guaranteed condition', removing any nuance or doubt.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by calling it a 'guaranteed condition'. It exaggerates a common nutritional risk into an absolute certainty."
  },
  {
    "id": 522,
    "text": "Laptop batteries are exploding in offices everywhere due to overcharging.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present by citing 'overcharging' as the cause. The Peripheral route is utilized by the image of batteries 'exploding... everywhere', creating physical fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement demonstrates Availability Bias by claiming explosions 'everywhere'. It takes rare battery failures and presents them as a common workplace hazard."
  },
  {
    "id": 523,
    "text": "Hair dyes are causing blindness in women who use them more than once a month.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link hair dyes to 'blindness'. The Peripheral route is strongly engaged by the severity of the threat and the low threshold for usage mentioned.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text exhibits Availability Bias by linking frequent use to 'blindness'. It escalates chemical sensitivity risks to a severe disability."
  },
  {
    "id": 524,
    "text": "Internet shutdowns are happening in every state, cutting off all communication.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Peripheral route by stating shutdowns in 'every state'. It exaggerates local issues into a nationwide communication blackout.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim illustrates Availability Bias by stating 'every state' is affected. It generalizes regional shutdowns to a national blackout."
  },
  {
    "id": 525,
    "text": "Eating broiler chicken causes hormonal imbalances in every girl who consumes it.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the claim of 'hormonal imbalances'. The Peripheral route is utilized by applying this to 'every girl', reinforcing a gender-specific health myth.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline reflects Availability Bias by applying the effect to 'every girl'. It reinforces a common myth about poultry farming."
  },
  {
    "id": 526,
    "text": "Biometric scanners are spreading skin diseases in every corporate office.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to attribute 'skin diseases' to scanners. The Peripheral route is engaged by the claim of spread in 'every corporate office', exploiting hygiene fears.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement uses Availability Bias by claiming spread in 'every corporate office'. It exaggerates the hygiene risk of shared touch surfaces."
  },
  {
    "id": 527,
    "text": "Sitting in AC causes arthritis in everyone under the age of 40.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link AC usage to 'arthritis'. The Peripheral route is activated by applying the condition to 'everyone under 40', a massive generalization.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text demonstrates Availability Bias by applying arthritis to 'everyone under 40'. It blames environmental comfort for a chronic disease."
  },
  {
    "id": 528,
    "text": "Social media is radicalizing every teenager who spends an hour online.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by claiming 'radicalization' for every teenager. It uses a loaded political/social term to create moral panic.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim exhibits Availability Bias by stating 'every teenager' is radicalized. It simplifies the complex effects of algorithms."
  },
  {
    "id": 529,
    "text": "Drinking cold water causes heart attacks in most people during summer.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the link to 'heart attacks'. The Peripheral route is utilized by claiming this affects 'most people', turning a rare risk into a common event.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Availability Bias by claiming attacks in 'most people'. It turns a precaution against thermal shock into a mass casualty event."
  },
  {
    "id": 530,
    "text": "Fastag scanners are double-charging cars at every toll plaza in the country.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Peripheral route by asserting 'double-charging' at 'every toll plaza'. It validates consumer anger through extreme exaggeration.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement reflects Availability Bias by asserting double-charging at 'every toll plaza'. It magnifies billing errors into a systemic flaw."
  },
  {
    "id": 531,
    "text": "Using non-stick cookware causes thyroid issues in all women.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link cookware to 'thyroid issues'. The Peripheral route is engaged by applying the risk to 'all women', creating a universal health scare.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text uses Availability Bias by applying thyroid issues to 'all women'. It relies on fears about Teflon to create a universal health scare."
  },
  {
    "id": 532,
    "text": "Data centers are consuming all the water in the city, leaving taps dry.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline employs the Peripheral route by claiming data centers consume 'all the water'. It uses hyperbole to scapegoat a specific industry for water scarcity.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim demonstrates Availability Bias by stating they consume 'all the water'. It blames a single industry for complex water management issues."
  },
  {
    "id": 533,
    "text": "Kidney stones are forming in everyone who drinks spinach juice daily.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link spinach juice to 'kidney stones'. The Peripheral route is activated by stating it happens to 'everyone', ignoring individual variability.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline exhibits Availability Bias by applying the outcome to 'everyone'. It takes the risk of oxalates and ensures a negative result."
  },
  {
    "id": 534,
    "text": "Deepfakes are scamming every pensioner out of their life savings.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by claiming 'every pensioner' is scammed. It focuses on the vulnerability of the elderly and the fear of losing 'life savings'.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement illustrates Availability Bias by claiming 'every pensioner' is scammed. It uses the novelty of AI to create a sense of unavoidable predation."
  },
  {
    "id": 535,
    "text": "Eating bread causes gluten intolerance in the entire population.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the claim of 'gluten intolerance'. The Peripheral route is utilized by applying it to the 'entire population', treating a specific sensitivity as a universal toxin.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text reflects Availability Bias by applying intolerance to the 'entire population'. It suggests that wheat is universally toxic."
  },
  {
    "id": 536,
    "text": "Sim swap fraud happens to everyone who loses signal for an hour.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Peripheral route by stating fraud happens to 'everyone' who loses signal. It misinterprets a common technical issue as a sign of immediate crime.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim uses Availability Bias by stating it happens to 'everyone'. It creates panic around common network fluctuations."
  },
  {
    "id": 537,
    "text": "Acne is exploding in adults due to holding phones against the face.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link phone contact to 'acne'. The Peripheral route is engaged by the dramatic word 'exploding', implying a sudden and massive outbreak.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline demonstrates Availability Bias by using 'exploding'. It blames the device's surface for a widespread skin condition."
  },
  {
    "id": 538,
    "text": "Online pharmacies send fake medicines to most customers.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline employs the Peripheral route by claiming 'most customers' receive fakes. It attacks the credibility of online systems with a broad negative generalization.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement exhibits Availability Bias by claiming 'most customers' receive fakes. It undermines trust in e-commerce."
  },
  {
    "id": 539,
    "text": "Eating white rice is the sole cause of diabetes in every family.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to identify rice as the 'sole cause' of diabetes. The Peripheral route is activated by applying this to 'every family', simplifying a complex disease.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text illustrates Availability Bias by identifying a 'sole cause' for 'every family'. It simplifies the disease etiology to a single staple."
  },
  {
    "id": 540,
    "text": "Drones are spying on every terrace in residential colonies.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by claiming spying on 'every terrace'. It feeds into paranoia about surveillance without proving the capability.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim reflects Availability Bias by stating spying happens on 'every terrace'. It normalizes the fear of surveillance."
  },
  {
    "id": 541,
    "text": "Job scams on Telegram trap every unemployed youth.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Peripheral route by stating 'every unemployed youth' is trapped. It uses the emotional desperation of unemployment to amplify the threat.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Availability Bias by stating 'every unemployed youth' is trapped. It highlights the platform's association with scams."
  },
  {
    "id": 542,
    "text": "Using a laptop on the lap causes infertility in men universally.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the link to 'infertility'. The Peripheral route is utilized by using the word 'universally', making the risk absolute and unavoidable.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement demonstrates Availability Bias by using 'universally'. It takes a thermal risk factor and makes it an absolute rule."
  },
  {
    "id": 543,
    "text": "Facial recognition denies entry to legitimate staff in every office.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline employs the Peripheral route by claiming denial at 'every office'. It suggests a fundamental unreliability of the technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text exhibits Availability Bias by claiming denial in 'every office'. It suggests the technology is fundamentally broken."
  },
  {
    "id": 544,
    "text": "Drinking milk causes sinus congestion in every child.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to attribute 'sinus congestion' to milk. The Peripheral route is engaged by applying this symptom to 'every child', generalizing a specific reaction.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim illustrates Availability Bias by stating 'every child' is affected. It reinforces a common dietary myth."
  },
  {
    "id": 545,
    "text": "Smart watches cause nerve damage in everyone who wears them to sleep.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the claim of 'nerve damage'. The Peripheral route is activated by stating it affects 'everyone', turning a specific concern into a universal danger.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline reflects Availability Bias by claiming nerve damage for 'everyone'. It implies the device is physically harmful during rest."
  },
  {
    "id": 546,
    "text": "Eating spicy food leads to ulcers in everyone who eats it.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link spicy food to 'ulcers'. The Peripheral route is utilized by applying the outcome to 'everyone', ignoring tolerance differences.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement uses Availability Bias by applying ulcers to 'everyone'. It ignores individual tolerance levels."
  },
  {
    "id": 547,
    "text": "Identity theft affects every user with a public profile.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by claiming 'every user' is affected. It implies that having a public profile is an automatic guarantee of theft.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This text demonstrates Availability Bias by stating 'every user' is affected. It implies public profiles are inherently unsafe."
  },
  {
    "id": 548,
    "text": "Hair loss is universal in men under 30 due to city water.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present by attributing hair loss to 'city water'. The Peripheral route is engaged by calling the condition 'universal', exaggerating the scale of the issue.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The claim exhibits Availability Bias by calling hair loss 'universal'. It blames environmental factors for a widespread issue."
  },
  {
    "id": 549,
    "text": "Wifi networks steal photos from phones in every apartment.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses the Peripheral route by asserting photo theft in 'every apartment'. It spreads fear about home wifi security without technical justification.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline illustrates Availability Bias by claiming theft in 'every apartment'. It spreads paranoia about local networks."
  },
  {
    "id": 550,
    "text": "Consuming reheat oil causes throat cancer in everyone.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link reheat oil to 'throat cancer'. The Peripheral route is strongly activated by applying this fatal consequence to 'everyone'.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement reflects Availability Bias by applying cancer to 'everyone'. It links a bad habit to a fatal outcome."
  },
  {
    "id": 551,
    "text": "The rollout of 5G caused the sudden spike in migraine cases in the city.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to assert a causal link between 5G rollout and a health spike. The Peripheral route is engaged by the urgency of a 'sudden spike' in cases.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text uses Illusory Correlation by linking a telecom launch to a health issue. It assumes the new signal is the direct cause of the pain."
  },
  {
    "id": 552,
    "text": "Using a microwave oven removes 100% of the nutrition from vegetables.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is employed by making a specific nutritional claim ('removes 100% of nutrition'). The Peripheral route is utilized by the absolute '100%' figure to induce fear of the appliance.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim demonstrates Illusory Correlation by associating the cooking method with total nutrient loss. It falsely correlates radiation with nutritional destruction."
  },
  {
    "id": 553,
    "text": "A rise in brain fog incidents matches the increase in Bluetooth headset sales.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by constructing a correlation argument ('matches the increase'). It invites the reader to process the temporal relationship.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exhibits Illusory Correlation by connecting a cognitive symptom to a device. It suggests the wireless proximity causes mental clouding."
  },
  {
    "id": 554,
    "text": "Sleeping in AC rooms is the reason for the increase in knee arthritis.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by identifying AC usage as the 'reason' for arthritis. It proposes an environmental cause for a medical condition.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement illustrates Illusory Correlation by blaming temperature control for joint degeneration. It implies the cold air causes the arthritis."
  },
  {
    "id": 555,
    "text": "Using digital wallets causes people to overspend because they cannot feel the money.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by explaining the psychological mechanism: 'because they cannot feel the money'. It offers a reasoned behavioral analysis.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text reflects Illusory Correlation by linking the format of payment to behavioral psychology. It suggests the lack of tactile feedback forces overspending."
  },
  {
    "id": 556,
    "text": "The installation of smart meters has caused balcony plants to die in the neighborhood.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link smart meters to plant death. The Peripheral route is engaged by the sentimental and fearful image of killing neighborhood plants.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by attributing plant death to a utility device. It assumes radiation from the meter is the killer."
  },
  {
    "id": 557,
    "text": "Excessive screen time is responsible for the decrease in average height among teenagers.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by attributing 'decrease in average height' to 'screen time'. It suggests a developmental physiological impact.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline demonstrates Illusory Correlation by connecting a sedentary habit to physical growth stunting. It ignores genetics and nutrition."
  },
  {
    "id": 558,
    "text": "Drinking cold water freezes the fats in the stomach, leading to heart blockages.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the explanation of 'freezes the fats'. The Peripheral route is activated by the severe threat of 'heart blockages' from drinking water.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement exhibits Illusory Correlation by creating a false physiological mechanism. It links temperature to arterial plaque formation."
  },
  {
    "id": 559,
    "text": "The rise in impulse buying is due to the blue color used in 'Buy Now' buttons.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim uses the Central route by identifying the 'blue color' as the specific cause of impulse buying. It relies on a design psychology argument.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text illustrates Illusory Correlation by attributing complex behavior to UI design choices. It claims the color itself controls the impulse."
  },
  {
    "id": 560,
    "text": "The use of LED streetlights is causing insomnia in residents even with curtains closed.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by attributing insomnia to 'LED streetlights'. It implies a penetrating physical effect of the light spectrum.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim reflects Illusory Correlation by blaming outdoor lighting for indoor sleep issues. It implies the light penetrates or affects the body remotely."
  },
  {
    "id": 561,
    "text": "Eating cucumbers at night causes face swelling due to water retention.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by explaining the symptom 'face swelling' via 'water retention'. It offers a physiological mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by linking a specific vegetable at a specific time to a physical symptom. It is a common dietary myth."
  },
  {
    "id": 562,
    "text": "The increase in battery explosions matches the high solar activity cycle.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by correlating battery explosions with 'solar activity'. It uses a scientific-sounding external cause.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement demonstrates Illusory Correlation by blaming cosmic weather for device failure. It shifts responsibility from manufacturing to the sun."
  },
  {
    "id": 563,
    "text": "Wearing synthetic socks causes uric acid to rise in the body.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by linking synthetic socks to a rise in 'uric acid'. It proposes a specific biochemical reaction to clothing.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text exhibits Illusory Correlation by connecting external clothing to internal blood chemistry. It creates a false absorption path."
  },
  {
    "id": 564,
    "text": "Slow internet speeds are caused by negative political energy in the country.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by attributing slow internet to 'negative political energy'. It treats this energy as a tangible interference mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim illustrates Illusory Correlation by attributing technical latency to social mood. It mixes infrastructure with metaphysics."
  },
  {
    "id": 565,
    "text": "Air purifiers in bedrooms are responsible for the rise in childhood obesity.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by identifying 'air purifiers' as the cause of 'childhood obesity'. It suggests a counter-intuitive health outcome.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline reflects Illusory Correlation by blaming a health device for a lifestyle issue. It implies clean air causes weight gain."
  },
  {
    "id": 566,
    "text": "Call drops increase the risk of road accidents by frustrating drivers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by explaining the pathway: call drops cause 'frustration' which leads to accidents. It constructs a behavioral chain of events.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement uses Illusory Correlation by linking network quality to traffic safety. It blames the 'drop' specifically rather than distraction."
  },
  {
    "id": 567,
    "text": "Using non-stick tawas is the cause of autoimmune disorders in women.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link tawas to 'autoimmune disorders'. The Peripheral route is engaged by the scary, vague nature of autoimmune threats.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text demonstrates Illusory Correlation by pinning complex immune failures on a pan. It mistakes correlation for causation."
  },
  {
    "id": 568,
    "text": "Cloud storage use causes memory loss because people stop remembering numbers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by offering a cognitive explanation: memory loss occurs because people 'stop remembering numbers'. It argues based on use-it-or-lose-it logic.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim exhibits Illusory Correlation by suggesting that storing data remotely deletes it from the brain. It confuses reliance with damage."
  },
  {
    "id": 569,
    "text": "Drinking tea from vending machines causes male infertility due to plastic pipes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the attribution of infertility to 'plastic pipes'. The Peripheral route is activated by the high fear associated with reproductive health.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline illustrates Illusory Correlation by focusing on the machine's plumbing. It targets the 'plastic' aspect as a reproductive toxin."
  },
  {
    "id": 570,
    "text": "Phishing scams increase when planets align in specific formations.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by correlating scams with 'planetary alignment'. It uses an astrological framework to explain digital trends.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement reflects Illusory Correlation by bringing astrology into cybersecurity. It claims planetary positions affect digital crime."
  },
  {
    "id": 571,
    "text": "Sleeping in AC causes morning joint stiffness by freezing the fluids.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by describing the mechanism: 'freezing the fluids' in joints. It offers a pseudo-medical reason for the stiffness.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text uses Illusory Correlation by blaming temperature control for physiology. It implies the cold penetrates deep into the joints."
  },
  {
    "id": 572,
    "text": "Smart meters cause insomnia in neighborhoods where they are installed.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by linking 'smart meters' to 'insomnia'. It implies an environmental emission effect on sleep.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim demonstrates Illusory Correlation by linking a utility device to sleep. It presumes an emission disturbs the residents."
  },
  {
    "id": 573,
    "text": "Eating cucumbers at night leads to water retention in the face.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by explaining the outcome 'water retention' caused by cucumbers. It presents a dietary cause-and-effect.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exhibits Illusory Correlation by linking a vegetable to a symptom based on time. It is a common myth."
  },
  {
    "id": 574,
    "text": "Online gaming causes height stunting in teenagers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by attributing 'height stunting' to 'online gaming'. It suggests a physiological impact of the activity.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement illustrates Illusory Correlation by linking a hobby to physical growth. It ignores genetics and diet."
  },
  {
    "id": 575,
    "text": "Using a hair dryer leads to hearing loss due to the motor pitch.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by identifying the 'motor pitch' as the cause of hearing loss. It offers a specific acoustic mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text reflects Illusory Correlation by attributing hearing damage to a household appliance. It exaggerates the danger of the noise."
  },
  {
    "id": 576,
    "text": "Bank fraud increases with the introduction of contactless cards.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by correlating 'bank fraud' with 'contactless cards'. It suggests the technology features enable the crime.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by blaming a feature for crime rates. It implies the feature itself invites the fraud."
  },
  {
    "id": 577,
    "text": "Eating curd at night causes sinus infections.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by linking 'eating curd at night' to 'sinus infections'. It presents a specific dietary timing rule.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline demonstrates Illusory Correlation by linking dairy to infection based on timing. It is a widespread cultural belief."
  },
  {
    "id": 578,
    "text": "Laptop heat causes digestive disorders in men.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by attributing 'digestive disorders' to 'laptop heat'. It proposes a thermal mechanism affecting internal organs.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement exhibits Illusory Correlation by associating external heat with internal digestion. It misplaces the effect."
  },
  {
    "id": 579,
    "text": "Mosquito repellents cause skin asthma.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by inventing a condition 'skin asthma' caused by repellents. It links a product to a specific medical effect.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text illustrates Illusory Correlation by inventing a condition. It links respiratory issues to skin application."
  },
  {
    "id": 580,
    "text": "Neckband headphones cause thyroid imbalances.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by linking 'neckband headphones' to 'thyroid imbalances'. It implies proximity radiation affects the gland.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim reflects Illusory Correlation by suggesting proximity affects the gland. It implies radiation causes the imbalance."
  },
  {
    "id": 581,
    "text": "Eating leftovers causes chronic fatigue.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by attributing 'chronic fatigue' to 'eating leftovers'. It suggests a nutritional or energetic deficit in the food.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline uses Illusory Correlation by blaming food freshness for energy levels. It ignores other factors."
  },
  {
    "id": 582,
    "text": "Social media use causes vitamin D deficiency.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by linking 'social media' to 'vitamin D deficiency'. It implies the behavior prevents sunlight exposure.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement demonstrates Illusory Correlation by connecting screen time to nutrition. It frames the app as the biological cause."
  },
  {
    "id": 583,
    "text": "Biometric systems spread warts in offices.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link biometrics to 'warts'. The Peripheral route is engaged by the disgust associated with spreading skin diseases in the office.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text exhibits Illusory Correlation by blaming the scanner for the disease. It exaggerates transmission risks."
  },
  {
    "id": 584,
    "text": "VR headsets cause eye infections.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by attributing 'eye infections' to 'VR headsets'. It identifies the device as a vector for disease.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim illustrates Illusory Correlation by connecting a gadget to infection. It assumes the device is the vector."
  },
  {
    "id": 585,
    "text": "Drinking water while standing causes arthritis.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by linking the posture of 'standing' to 'arthritis'. It offers a biomechanical explanation for the ailment.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline reflects Illusory Correlation by linking posture to joint health. It is a persistent myth."
  },
  {
    "id": 586,
    "text": "Keyboards destroy handwriting analysis skills.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by arguing that keyboards 'destroy... analysis skills'. It suggests a cognitive trade-off with technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement uses Illusory Correlation by suggesting typing destroys cognition. It implies a tradeoff."
  },
  {
    "id": 587,
    "text": "Eating fruit after meals creates poison.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to claim fruit 'creates poison'. The Peripheral route is activated by the high-fear word 'poison', implying immediate toxicity.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text demonstrates Illusory Correlation by claiming timing creates toxicity. It misinterprets digestion."
  },
  {
    "id": 588,
    "text": "CCTV cameras cause anxiety attacks in parks.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by attributing 'anxiety attacks' to 'CCTV cameras'. It links the surveillance environment to mental health.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim exhibits Illusory Correlation by linking security to mental health. It assumes being watched triggers the attack."
  },
  {
    "id": 589,
    "text": "Induction cookers cause hair fall.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link cookers to 'hair fall'. The Peripheral route is engaged by the fear of losing hair due to a kitchen appliance.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline illustrates Illusory Correlation by blaming magnetic fields for hair health. It creates a false path."
  },
  {
    "id": 590,
    "text": "UPI fraud rises with larger phone screens.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by correlating 'UPI fraud' with 'larger phone screens'. It implies hardware visibility aids the crime.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement reflects Illusory Correlation by connecting hardware to crime. It implies screen size aids fraud."
  },
  {
    "id": 591,
    "text": "Ice cream in winter causes pneumonia.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link ice cream to 'pneumonia'. The Peripheral route is activated by the fear of a serious lung infection from a simple treat.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text uses Illusory Correlation by equating cold food with lung infection. It ignores the viral cause."
  },
  {
    "id": 592,
    "text": "Bluetooth trackers cause paranoia in dogs.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by attributing 'paranoia in dogs' to 'Bluetooth trackers'. It suggests a sensory impact on animals.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim demonstrates Illusory Correlation by attributing human emotion to animals via tech. It implies the signal disturbs them."
  },
  {
    "id": 593,
    "text": "Tight jeans cause varicose veins in men.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by linking 'tight jeans' to 'varicose veins'. It offers a mechanical constriction explanation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exhibits Illusory Correlation by blaming clothing for vascular issues. It simplifies the cause."
  },
  {
    "id": 594,
    "text": "Spam calls increase with new satellites.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by correlating 'spam calls' with 'new satellites'. It links infrastructure expansion to nuisance.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement illustrates Illusory Correlation by linking infrastructure to marketing. It assumes satellites enable spam."
  },
  {
    "id": 595,
    "text": "Reheated tea produces liver toxins.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to claim reheated tea 'produces liver toxins'. The Peripheral route is engaged by the fear of ingesting 'toxins'.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text reflects Illusory Correlation by creating a chemical myth. It claims reheating creates specific toxins."
  },
  {
    "id": 596,
    "text": "Open-source software causes hacking.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to link 'open-source' to 'hacking'. The Peripheral route is activated by the fear of vulnerability associated with the term 'hacking'.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim uses Illusory Correlation by blaming the model for crime. It generalizes insecurity."
  },
  {
    "id": 597,
    "text": "Steel combs damage brain neurons via static.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is present in the mechanism of 'damage via static'. The Peripheral route is utilized by the terrifying claim of damaging 'brain neurons'.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline demonstrates Illusory Correlation by linking static to brain damage. It exaggerates the effect."
  },
  {
    "id": 598,
    "text": "Password leaks are caused by browser saving.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by identifying 'browser saving' as the cause of 'password leaks'. It offers a technical vulnerability explanation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement exhibits Illusory Correlation by blaming a user habit for server leaks. It misattributes the breach."
  },
  {
    "id": 599,
    "text": "GMO brinjal causes allergies.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on the Central route by linking 'GMO brinjal' to 'allergies'. It suggests a biological reaction to genetic modification.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text illustrates Illusory Correlation by targeting GMOs as allergens. It assumes modification creates allergy."
  },
  {
    "id": 600,
    "text": "Mobile games cause academic decline in rural schools.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by attributing 'academic decline' to 'mobile games'. It proposes a direct causal relationship.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The claim reflects Illusory Correlation by connecting gaming to grades. It ignores other factors."
  }
]