[
  {
    "id": 451,
    "text": "Drinking water from a clay pot naturally balances testosterone levels, unlike plastic bottles which leach female hormones.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by proposing a specific biological mechanism ('balances testosterone levels', 'leach female hormones'). It persuades by describing a chemical interaction between the container material and the body.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims a traditional material regulates hormones while a modern one disrupts them. It relies on Naturalness bias to assert that 'natural' clay supports biological balance better than synthetic plastic."
  },
  {
    "id": 452,
    "text": "Using a manual typewriter stimulates neural pathways that digital keyboards allow to atrophy.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This relies on the Central route by explaining a neurological effect ('stimulates neural pathways', 'allow to atrophy'). It argues that the physical effort of the device directly impacts brain structure.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text suggests that older, mechanical technology preserves brain function while digital tech degrades it. It uses Naturalness bias to value the physical effort of the traditional tool."
  },
  {
    "id": 453,
    "text": "Consuming raw honey directly from the comb cures asthma, whereas processed honey in jars triggers allergies.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by detailing the health effects of processing ('cures asthma', 'triggers allergies'). It differentiates the substances based on their biological impact.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example promotes raw food as a cure and processed food as an allergen. It employs Naturalness bias, assuming that industrial processing turns a healing substance into a harmful one."
  },
  {
    "id": 454,
    "text": "LED streetlights emit a frequency that confuses the pineal gland, causing insomnia, unlike traditional sodium lamps.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by describing a physiological disruption ('confuses the pineal gland', 'causing insomnia'). It links a specific technical output (frequency) to an organ's function.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims modern lighting technology disrupts biology. It contrasts this with older technology, using Naturalness bias to frame the 'harsher' new light as biologically invasive."
  },
  {
    "id": 455,
    "text": "Applying desi ghee to the eyes improves vision clarity, while contact lenses slowly scratch the cornea.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by asserting a physical cause-and-effect ('improves vision clarity', 'scratch the cornea'). It contrasts a healing agent with a damaging mechanical device.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement elevates a traditional remedy over a medical device. It uses Naturalness bias to suggest that a natural fat heals the eye, while a technological lens damages it."
  },
  {
    "id": 456,
    "text": "Listening to acoustic instruments aligns the heartbeat, whereas synthesized electronic music causes arrhythmia.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This relies on the Central route by explaining the physiological response to sound ('aligns the heartbeat', 'causes arrhythmia'). It treats sound waves as having a direct biological impact.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text claims the source of sound affects heart health. It relies on Naturalness bias to value 'natural' sound waves over digital ones as biologically safe."
  },
  {
    "id": 457,
    "text": "Eating with copper utensils charges the food with positive ions, while steel utensils make the food neutral and dead.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by describing an energetic/chemical transfer ('charges the food', 'positive ions'). It attempts to ground the health claim in the physics of the materials.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example attributes electrical/spiritual qualities to cookware. It uses Naturalness bias to claim that traditional metals enhance food 'energy' compared to modern steel."
  },
  {
    "id": 458,
    "text": "Wifi routers dry out the air in the home, causing skin rashes, unlike natural ventilation.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by identifying an environmental mechanism ('dry out the air', 'causing skin rashes'). It explains the symptom as a direct result of atmospheric changes caused by the device.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline creates a physical symptom from a radio signal. It uses Naturalness bias to frame invisible technology as an environmental pollutant that harms the body."
  },
  {
    "id": 459,
    "text": "Sleeping on a straw mat realigns the vertebrae naturally, while memory foam mattresses trap body heat and toxins.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by describing the biomechanical and thermal effects ('realigns the vertebrae', 'trap body heat and toxins'). It persuades through physical interaction logic.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement attacks modern bedding materials. It employs Naturalness bias to suggest that natural materials allow the body to heal, while synthetic foams trap harm."
  },
  {
    "id": 460,
    "text": "Digital cameras steal a fraction of the soul with every shutter click, unlike painting which adds soul.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This employs the Central route by proposing a metaphysical subtraction mechanism ('steal a fraction of the soul'). It treats the soul as a quantifiable substance affected by the machine.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text revives an old superstition about photography. It uses Naturalness bias to contrast the 'soul-stealing' machine with the 'soul-giving' human art form."
  },
  {
    "id": 461,
    "text": "Chewing herbal sticks cleans teeth better than nylon bristles, which slowly abrade the enamel.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text relies on the Central route by explaining the physical abrasion ('slowly abrade the enamel'). It compares the mechanical safety of two cleaning materials.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example promotes traditional oral hygiene. It relies on Naturalness bias to claim that modern plastic brushes are physically destructive compared to natural twigs."
  },
  {
    "id": 462,
    "text": "Electric scooters emit a magnetic field that causes leg cramps, unlike cycling which pumps natural blood flow.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by linking a specific emission to a symptom ('emit a magnetic field', 'causes leg cramps'). It fabricates a biological reaction to the motor's field.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline attributes physical pain to the propulsion method. It uses Naturalness bias to frame the electric motor as biologically disruptive compared to manual pedalling."
  },
  {
    "id": 463,
    "text": "Using a stone grinder preserves the antioxidants in flour, whereas high-speed steel mills burn them off.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by describing the preservation vs. destruction of nutrients ('preserves the antioxidants', 'burn them off'). It appeals to food chemistry.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement claims manual processing retains nutrients. It employs Naturalness bias, assuming that the speed and material of modern milling destroy food value."
  },
  {
    "id": 464,
    "text": "Virtual reality causes the brain to forget how to process real depth, unlike walking in nature.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This employs the Central route by asserting a cognitive decline ('forget how to process real depth'). It explains the harm through a change in brain processing.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text asserts that VR damages cognitive perception. It uses Naturalness bias to contrast the 'artificial' depth of screens with the 'healing' depth of the real world."
  },
  {
    "id": 465,
    "text": "Bathing in river water washes away negative energy, while shower water merely cleans the dirt.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text relies on the Central route by describing a cleansing mechanism ('washes away negative energy'). It treats 'negative energy' as a substance that can be physically removed.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example attributes metaphysical cleaning properties to natural bodies of water. It relies on Naturalness bias to frame tap water as spiritually inert."
  },
  {
    "id": 466,
    "text": "Wearing a smartwatch blocks the wrist chakra, causing emotional numbness, unlike wearing a sacred thread.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by explaining a blockage in the body's energy system ('blocks the wrist chakra'). It links the physical device to an emotional/spiritual consequence.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline links wearable tech to spiritual blockage. It uses Naturalness bias to claim that modern devices interfere with traditional energy centers."
  },
  {
    "id": 467,
    "text": "Organic jaggery boosts immunity by heating the blood, while white sugar cools the body and invites viruses.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by attributing thermal properties to food ('heating the blood', 'cools the body'). It explains immunity as a function of body temperature regulation.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement assigns thermal properties to sweeteners. It employs Naturalness bias to create a health dichotomy between the natural (protective) and the processed (vulnerable)."
  },
  {
    "id": 468,
    "text": "Air purifiers remove the beneficial bacteria from the air, weakening the lungs, unlike open windows.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This employs the Central route by describing the removal of protective agents ('remove the beneficial bacteria'). It argues that the device creates an immunological deficit.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text claims clean air technology is over-sterile. It uses Naturalness bias to suggest that 'natural' air, even if polluted, is better for immunity than filtered air."
  },
  {
    "id": 469,
    "text": "Eating food with hands improves digestion by transferring bio-energy, whereas forks conduct cold metal energy.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text relies on the Central route by proposing an energy transfer mechanism ('transferring bio-energy', 'conduct cold metal energy'). It explains digestion via energy conduction.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example promotes eating with hands via pseudo-science. It relies on Naturalness bias to claim that metal cutlery disrupts the energetic process of eating."
  },
  {
    "id": 470,
    "text": "Self-checkout kiosks steal the social energy of a community, causing depression, unlike human cashiers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by describing a psychological extraction process ('steal the social energy'). It treats social interaction as a vital nutrient that machines deplete.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline attributes mental health issues to automation. It uses Naturalness bias to value human interaction as essential for health, framing automation as draining."
  },
  {
    "id": 471,
    "text": "Drinking coconut water directly from the shell infuses electrolytes, while pouring it into a glass kills the enzymes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by explaining nutrient preservation ('infuses electrolytes', 'kills the enzymes'). It links the container material directly to the drink's vitality.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement claims the vessel affects nutritional content instantly. It uses Naturalness bias to suggest that only the natural container preserves the 'life' of the drink."
  },
  {
    "id": 472,
    "text": "Noise-cancelling headphones create a pressure vacuum that slowly detaches the eardrum, unlike natural listening.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This employs the Central route by describing a physical danger ('create a pressure vacuum', 'detaches the eardrum'). It fabricates a mechanical injury caused by the technology.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text exaggerates the physics of audio tech. It reflects Naturalness bias, implying that altering the natural soundscape is physically dangerous to the ear."
  },
  {
    "id": 473,
    "text": "Applying fresh aloe vera to burns heals the skin without scarring, whereas burn creams contain plastic fillers.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text relies on the Central route by identifying specific harmful ingredients ('contain plastic fillers'). It persuades by analyzing the composition of the product.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example demonizes medical creams. It employs Naturalness bias to claim that pharmaceutical products are filled with artificial contaminants like 'plastic'."
  },
  {
    "id": 474,
    "text": "5G waves disrupt the migration of bees, while 4G was within the natural tolerance of nature.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by explaining the disruption of a biological process ('disrupt the migration', 'natural tolerance'). It links signal frequency to animal behavior.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims newer tech is environmentally destructive. It uses Naturalness bias to frame the latest advancement as crossing a 'natural tolerance' line."
  },
  {
    "id": 475,
    "text": "Consuming rock salt stabilizes blood pressure, whereas iodised salt creates artificial pressure spikes.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by distinguishing physiological effects ('stabilizes blood pressure', 'artificial pressure spikes'). It attributes the health outcome to the chemical presence of iodine.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement differentiates salt types by health effect. It relies on Naturalness bias to suggest that the industrial additive (iodine) is the cause of the health issue."
  },
  {
    "id": 476,
    "text": "Streaming music compresses the sound waves so much that the brain stops producing serotonin.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This employs the Central route by linking technical compression to neurochemistry ('stops producing serotonin'). It explains the mental health effect via a biological mechanism.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text links digital audio compression to neurochemistry. It uses Naturalness bias to claim that only 'full' or natural sound waves support mental health."
  },
  {
    "id": 477,
    "text": "Walking on soil grounds the body's electrical charge, preventing inflammation, unlike walking on asphalt.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text relies on the Central route by describing an electrical grounding process ('grounds the body's electrical charge'). It explains inflammation as an electrical imbalance.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example promotes 'earthing' as a medical cure. It employs Naturalness bias to frame modern paving as an insulator that traps harmful energy in the body."
  },
  {
    "id": 478,
    "text": "Using a stylus on a tablet blocks the flow of chi from the hand to the work, unlike a paintbrush.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by proposing a blockage of energy flow ('blocks the flow of chi'). It treats creativity as a current that requires a conductive tool.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline attributes metaphysical flow to art tools. It uses Naturalness bias to claim digital tools sever the connection between the artist's energy and the art."
  },
  {
    "id": 479,
    "text": "Wooden combs stimulate hair growth by massaging the scalp's energy points, while plastic combs generate static.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by explaining the stimulation mechanism ('massaging the scalp's energy points'). It contrasts this with the 'static' generated by plastic.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement contrasts materials for hair care. It relies on Naturalness bias to value the 'energy' interaction of wood over the 'static' interaction of plastic."
  },
  {
    "id": 480,
    "text": "Facial recognition cameras capture your biometric soul print, which can be used to control your mood.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to describe the capture of a 'biometric soul print'. The Peripheral route is engaged by the threat of external control ('used to control your mood').",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text invents a concept of 'soul print'. It uses Naturalness bias to suggest that capturing a digital likeness gives technology control over the human spirit."
  },
  {
    "id": 481,
    "text": "Drinking water stored in copper vessels kills cancer cells, whereas glass bottles are inert and useless.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This employs the Central route by asserting a specific curative property ('kills cancer cells'). It argues that the material itself is biologically active against disease.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example promotes a traditional cure for cancer. It employs Naturalness bias to claim that the natural metal has active curative properties that modern glass lacks."
  },
  {
    "id": 482,
    "text": "Electric cars disconnect the driver from the road's vibration, leading to a loss of focus, unlike petrol cars.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text relies on the Central route by explaining a sensory deficit ('disconnect the driver... loss of focus'). It links the lack of vibration to cognitive performance.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims mechanical feedback is essential for safety. It uses Naturalness bias to frame the smooth, quiet operation of EVs as a sensory deprivation hazard."
  },
  {
    "id": 483,
    "text": "Using a neem twig for brushing absorbs toxins from the gums, while toothpaste pushes toxins back in.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by describing the toxin removal process ('absorbs toxins', 'pushes toxins back in'). It analyzes the mechanical action of the cleaning method.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement reverses the function of toothpaste. It relies on Naturalness bias to suggest that the natural tool extracts poison while the chemical paste traps it."
  },
  {
    "id": 484,
    "text": "Video calls reduce empathy by flattening the human face into pixels, whereas meeting in person expands the aura.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by proposing a visual/energetic cause for empathy loss ('flattening the human face', 'expands the aura'). It links display technology to emotional capacity.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text links communication tech to emotional loss. It uses Naturalness bias to claim that digital interaction destroys the 'aura' present in face-to-face contact."
  },
  {
    "id": 485,
    "text": "Eating banana on a banana leaf adds antioxidants to the food, while eating on a ceramic plate does nothing.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This employs the Central route by claiming a nutrient transfer ('adds antioxidants to the food'). It suggests the serving vessel actively changes the food's chemistry.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example attributes nutritional transfer to the serving vessel. It employs Naturalness bias to favour the traditional leaf as biologically active."
  },
  {
    "id": 486,
    "text": "Microwaving water changes its molecular structure to 'hate', causing indigestion.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text relies on the Central route by describing a structural change ('changes its molecular structure'). It uses pseudo-scientific 'water memory' logic to explain indigestion.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline references pseudo-scientific water memory theories. It uses Naturalness bias to claim technology infuses negative emotion into physical matter."
  },
  {
    "id": 487,
    "text": "Using turmeric on wounds creates a natural seal that breathes, while band-aids suffocate the skin.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by explaining the healing requirement ('natural seal that breathes'). It contrasts the biological needs of the skin with the suffocating effect of plastic.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement contrasts herbal care with adhesive bandages. It relies on Naturalness bias to suggest that skin needs to 'breathe' through a natural seal to heal."
  },
  {
    "id": 488,
    "text": "Cloud storage servers generate heat that disrupts local rainfall patterns, unlike keeping files in cabinets.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by identifying a thermal cause for environmental change ('generate heat that disrupts... patterns'). It links data centers to weather physics.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text blames data centers for weather changes. It uses Naturalness bias to frame digital storage as environmentally aggressive compared to paper storage."
  },
  {
    "id": 489,
    "text": "Sitting cross-legged aids the heart by reducing blood pumping effort, while chairs strain the heart.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This employs the Central route by explaining cardiovascular mechanics ('reducing blood pumping effort'). It argues that posture directly affects heart strain.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example promotes traditional sitting postures. It employs Naturalness bias to claim that modern furniture places undue stress on the cardiovascular system."
  },
  {
    "id": 490,
    "text": "Wireless earbuds emit a frequency that calcifies the pineal gland, cutting off spiritual intuition.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text relies on the Central route by describing a biological hardening ('calcifies the pineal gland'). It links signal frequency to organ damage and spiritual loss.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline links audio tech to spiritual loss. It uses Naturalness bias to suggest that placing technology inside the ear physically blocks spiritual capability."
  },
  {
    "id": 491,
    "text": "Hand-washing clothes releases stress and grounds the body, while washing machines create chaotic energy.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by describing an energetic regulation process ('grounds the body', 'create chaotic energy'). It links physical movement to stress relief.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement attributes psychological benefits to manual labor. It relies on Naturalness bias to frame the machine as a source of 'chaos' and the hand as a source of 'grounding'."
  },
  {
    "id": 492,
    "text": "GPS satellites scramble the migratory instincts of birds, proving they also confuse human direction.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by inferring human impact from animal biology ('scramble the migratory instincts'). It relies on a comparative biological argument.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text uses animal impact to infer human impact. It uses Naturalness bias to claim that satellite technology disrupts the natural navigation sense of all living beings."
  },
  {
    "id": 493,
    "text": "Consuming ghee lubricates the joints naturally, while glucosamine supplements deposit crystals in the kidneys.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This employs the Central route by describing the mechanical action of substances ('lubricates the joints', 'deposit crystals'). It analyzes the physical effect of the intake.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example promotes a traditional food over a supplement. It employs Naturalness bias to claim the natural fat heals while the synthetic pill harms."
  },
  {
    "id": 494,
    "text": "Using a mouse and keyboard causes energy blockages in the meridians, leading to carpal tunnel.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text relies on the Central route by explaining the pathology of injury ('energy blockages in the meridians'). It attributes carpal tunnel to disrupted energy flow.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline explains a physical injury via energy flow. It uses Naturalness bias to attribute RSI to a blockage of 'natural energy' caused by technology."
  },
  {
    "id": 495,
    "text": "Drinking water from a plastic bottle introduces micro-plastics that alter DNA, while glass is DNA-neutral.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by identifying a specific contaminant and effect ('introduces micro-plastics', 'alter DNA'). It persuades through genetic and toxicological claims.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement links packaging to genetic damage. It relies on Naturalness bias to claim that synthetic materials actively rewrite biological code."
  },
  {
    "id": 496,
    "text": "Smart homes use frequencies that agitate pets, causing them to become aggressive.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by linking frequencies to behavior ('frequencies that agitate'). It proposes a cause-and-effect relationship between signals and aggression.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text claims home automation harms animals. It uses Naturalness bias to suggest that the invisible signals of a smart home are naturally offensive to animals."
  },
  {
    "id": 497,
    "text": "Eating with silver cutlery cools the body's internal heat, whereas stainless steel traps heat.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This employs the Central route by describing thermal regulation ('cools the body's internal heat'). It argues based on the thermal properties of the metal.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example assigns thermal regulation to silverware. It employs Naturalness bias to value the traditional metal's interaction with the body over the modern one."
  },
  {
    "id": 498,
    "text": "Typing on a touchscreen numbs the fingertips' connection to the brain, unlike tactile buttons.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text relies on the Central route by explaining a neurological disconnection ('numbs the fingertips' connection'). It links tactile feedback to brain function.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims glass screens disconnect the nervous system. It uses Naturalness bias to favour physical, tactile feedback as essential for brain connection."
  },
  {
    "id": 499,
    "text": "Walking barefoot on grass absorbs Vitamin N (Nature) which cures depression instantly.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to claim a nutritional intake ('absorbs Vitamin N'). The Peripheral route is engaged by the promise of curing depression 'instantly'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement invents a vitamin to promote nature. It relies on Naturalness bias to claim that simple contact with nature is an instant cure for mental illness."
  },
  {
    "id": 500,
    "text": "Artificial Intelligence writes without a soul, creating text that drains the reader's emotional energy.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by proposing a mechanism of energy loss ('drains the reader's emotional energy'). It treats the 'soulless' nature of the text as a functional drain.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text attributes metaphysical drain to AI content. It uses Naturalness bias to claim that non-human creativity is parasitic to human emotion."
  },
  {
    "id": 501,
    "text": "Every second person in the city has asthma now, proving that vehicle emissions are deadlier than ever.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on the Peripheral route by using hyperbole and social prevalence ('Every second person', 'deadlier than ever'). It uses the availability of sick people to validate a fear of emissions.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses hyperbole ('every second person') to attack pollution. It uses Availability bias to validate the danger based on the perceived commonality of the disease."
  },
  {
    "id": 502,
    "text": "The news is constantly reporting crypto crashes, which means digital currency is a guaranteed way to go bankrupt.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This uses the Peripheral route by generalizing from the frequency of news ('constantly reporting'). It assumes the certainty of bankruptcy based on the visibility of crash reports.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text generalizes financial ruin from news reports. It employs Availability bias, assuming that because crashes are reported, they are the only outcome."
  },
  {
    "id": 503,
    "text": "You see so many people with thyroid issues these days, it must be the non-stick pans releasing toxins.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by observing a common trend ('see so many people'). It uses this observation to blame a ubiquitous kitchen item without evidence.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement links a common ailment to a kitchen item. It relies on Availability bias to find a ubiquitous culprit for a visible health trend."
  },
  {
    "id": 504,
    "text": "Viral videos of electric scooters catching fire prove that the batteries are ticking time bombs.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It relies on the Peripheral route by citing 'Viral videos' as proof. It uses the spectacular nature of these videos to label the entire technology as 'ticking time bombs'.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses viral content to condemn a technology. It uses Availability bias to let spectacular failures define the safety of the entire product class."
  },
  {
    "id": 505,
    "text": "Everyone I know has a vitamin D deficiency, which confirms that sunscreen is blocking all the good rays.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by relying on a personal circle ('Everyone I know'). It validates a chemical claim based solely on social confirmation.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example uses a personal circle to attack sunscreen. It employs Availability bias to blame a protective product for a widespread nutritional gap."
  },
  {
    "id": 506,
    "text": "There are so many online scams now that it is safer to keep your money in cash than in a bank.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This uses the Peripheral route by interpreting the quantity of scams ('so many... now') as a total safety failure. It appeals to fear and the desire for safety.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text discourages banking based on scam frequency. It uses Availability bias to exaggerate the risk of digital finance to a certainty of theft."
  },
  {
    "id": 507,
    "text": "All the kids are wearing glasses, proving that online classes destroy eyesight permanently.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by linking a visible trait ('All the kids are wearing glasses') to a specific cause. It relies on the availability of this visual proof.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement links eyewear prevalence to education tech. It reflects Availability bias by attributing a visual trend solely to screen usage."
  },
  {
    "id": 508,
    "text": "Reports of data leaks are everywhere, meaning your Aadhaar data is already being used by criminals.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It relies on the Peripheral route by using media saturation ('Reports... are everywhere') to assume a personal breach. It creates panic through the ubiquity of the news.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline assumes total compromise from media reports. It uses Availability bias to claim that news of leaks equals active criminal misuse for everyone."
  },
  {
    "id": 509,
    "text": "Everyone complains of back pain, showing that sitting on modern chairs is unnatural.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by citing a universal complaint ('Everyone complains'). It uses this consensus to attack modern furniture design.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses common complaints to critique furniture. It employs Availability bias to blame modern design for a lifestyle ailment."
  },
  {
    "id": 510,
    "text": "Hearing about young people dying of heart attacks proves that the gym is dangerous for the heart.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This uses the Peripheral route by focusing on dramatic anecdotes ('Hearing about young people dying'). It allows rare, tragic stories to define the safety of gyms.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example links exercise to tragedy. It uses Availability bias to let rare, ironic deaths outweigh the health benefits of fitness."
  },
  {
    "id": 511,
    "text": "The daily news about AI layoffs proves that human labor will be obsolete in two years.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by extrapolating 'Daily news' into a catastrophe ('obsolete in two years'). It uses the frequency of headlines to create urgency.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline extrapolates job market news to a catastrophe. It uses Availability bias to predict total unemployment based on current headlines."
  },
  {
    "id": 512,
    "text": "Everyone is getting food poisoning from delivery apps, so restaurant food is always stale.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It relies on the Peripheral route by generalizing a negative outcome ('Everyone is getting...'). It uses the availability of sickness stories to condemn restaurant food.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement generalizes food safety risks. It relies on Availability bias to claim that delivery apps guarantee illness."
  },
  {
    "id": 513,
    "text": "You see 5G towers everywhere, which explains why everyone has chronic headaches now.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by correlating visibility ('see 5G towers everywhere') with a symptom. It relies on the immediate presence of the towers to explain the pain.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text correlates tower density with symptoms. It uses Availability bias to validate a health complaint via the visibility of infrastructure."
  },
  {
    "id": 514,
    "text": "Every second person is gluten intolerant, proving modern wheat is toxic.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This uses the Peripheral route by exaggerating prevalence ('Every second person'). It uses this statistic to support a claim about toxicity.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example uses intolerance rates to attack a crop. It employs Availability bias to label a staple food as poison based on diagnostic trends."
  },
  {
    "id": 515,
    "text": "Constant server crashes mean that the UPI system is about to fail permanently.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by interpreting technical glitches ('Constant server crashes') as total failure. It uses the frustration of downtime to predict collapse.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline interprets downtime as doom. It uses Availability bias to view technical maintenance as a sign of systemic collapse."
  },
  {
    "id": 516,
    "text": "Everyone seems to have low energy, proving that RO water filters remove all energy from water.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It relies on the Peripheral route by linking a general feeling ('Everyone seems to have low energy') to a specific appliance. It bypasses evidence for a shared sentiment.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement links fatigue to water filtration. It uses Availability bias to blame a common appliance for a general societal feeling."
  },
  {
    "id": 517,
    "text": "The sheer number of spam calls proves that your phone number is public property now.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by using the 'sheer number' of calls to infer a privacy breach. It assumes quantity equals total exposure.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text infers privacy loss from spam volume. It uses Availability bias to claim that receiving spam means total loss of data privacy."
  },
  {
    "id": 518,
    "text": "Seeing so many bald men proves that chemical shampoos destroy hair follicles.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This uses the Peripheral route by using a common visual ('Seeing so many bald men') to blame a product. It relies on availability to make a causal link.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example uses baldness prevalence to attack shampoo. It employs Availability bias to attribute a genetic trait to a grooming product."
  },
  {
    "id": 519,
    "text": "Viral videos of robots falling show that AI is just a hype bubble that will burst soon.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by using 'Viral videos' of failure to dismiss the technology. It relies on mockery and visual cues rather than technical analysis.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses bloopers to judge an industry. It uses Availability bias to dismiss the capability of AI based on funny failures."
  },
  {
    "id": 520,
    "text": "Everyone is allergic to dust now, meaning air conditioners are weakening our immune systems.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It relies on the Peripheral route by claiming a universal condition ('Everyone is allergic'). It uses this generalization to attack air conditioning.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement links allergies to AC usage. It relies on Availability bias to claim that climate control makes people physically weaker."
  },
  {
    "id": 521,
    "text": "With so many apps asking for camera access, the government is definitely watching you.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by jumping from app permissions ('so many apps') to government surveillance. It relies on paranoia triggered by frequency.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text jumps from app permissions to state surveillance. It uses Availability bias to infer a conspiracy from standard software requests."
  },
  {
    "id": 522,
    "text": "All the kids have cavities, proving that fluoride toothpaste eats away enamel.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This uses the Peripheral route by citing a health trend ('All the kids have cavities'). It uses this observation to blame the preventative product.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example reverses the role of fluoride. It uses Availability bias to blame the preventative measure for the problem it solves."
  },
  {
    "id": 523,
    "text": "Frequent flight turbulence news proves that 5G signals disrupt air currents.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by using 'Frequent... news' to validate a theory. It connects unrelated weather events to 5G based on news volume.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline links weather to telecom signals. It demonstrates Availability bias by attributing aviation weather issues to ground technology."
  },
  {
    "id": 524,
    "text": "Everyone getting spam texts implies your identity has been stolen.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It relies on the Peripheral route by exaggerating the implication of spam ('Everyone getting... implies'). It uses the availability of the nuisance to claim identity theft.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement exaggerates the meaning of spam. It uses Availability bias to claim that a nuisance text is proof of identity theft."
  },
  {
    "id": 525,
    "text": "Seeing so many people with arthritis proves that walking on tiles destroys knees.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by linking a health issue ('so many people with arthritis') to a flooring type. It uses the visibility of the disease to find a culprit.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text blames flooring for joint disease. It employs Availability bias to link a common surface to a common ailment."
  },
  {
    "id": 526,
    "text": "Constant app updates prove that developers are mining cryptocurrency on your device.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This uses the Peripheral route by interpreting 'Constant... updates' as malicious. It relies on the frequency of the action to prove bad intent.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline explains software patches as theft. It uses Availability bias to interpret the frequency of updates as evidence of malice."
  },
  {
    "id": 527,
    "text": "Everyone is getting skin rashes, so the new detergents must be toxic.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by generalizing a symptom ('Everyone is getting skin rashes'). It uses this claim to attack a household chemical.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement links rashes to soap. It uses Availability bias to blame a household product for a perceived rise in skin issues."
  },
  {
    "id": 528,
    "text": "There are so many influencers selling crypto that it must be a pyramid scheme.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It relies on the Peripheral route by judging a financial asset by its promoters ('so many influencers'). It uses the marketing noise to dismiss the validity of the tech.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example uses marketing noise to judge an asset. It uses Availability bias to dismiss the technology based on the behavior of its promoters."
  },
  {
    "id": 529,
    "text": "Seeing so many depressed people proves social media poisons the mind.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by citing the number of depressed people ('Seeing so many'). It simplifies the cause of mental illness to social media usage.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text blames platforms for mental illness. It reflects Availability bias by pinpointing a single cause for a complex health issue."
  },
  {
    "id": 530,
    "text": "Every time you update Windows, your PC slows down, proving planned obsolescence.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This uses the Peripheral route by using personal frustration ('Every time... slows down') as proof of conspiracy. It interprets technical lag as deliberate sabotage.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline interprets lag as a conspiracy. It uses Availability bias to claim that performance drops are deliberate sabotage."
  },
  {
    "id": 531,
    "text": "Everyone has gastric issues, so pressure cookers must be making food poisonous.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by claiming universal illness ('Everyone has gastric issues'). It uses this exaggeration to blame a cooking method.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement attacks a cooking method via health complaints. It employs Availability bias to link digestion issues to a specific appliance."
  },
  {
    "id": 532,
    "text": "Endless credit card calls mean the economy is collapsing.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It relies on the Peripheral route by using the volume of 'Endless... calls' to predict economic collapse. It connects a nuisance to a macro-economic trend.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses sales calls to predict economic doom. It uses Availability bias to infer a macro-economic crash from telemarketing volume."
  },
  {
    "id": 533,
    "text": "Everyone is getting viral fever, meaning the government is spraying something in the air.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by attributing a common wave of illness ('Everyone is getting') to a conspiracy. It explains the prevalence via government action.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example explains seasonal illness with a conspiracy. It relies on Availability bias to attribute a common flu wave to chemical spraying."
  },
  {
    "id": 534,
    "text": "Countless hacked accounts prove Instagram has no security.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This uses the Peripheral route by interpreting 'Countless hacked accounts' as a total lack of security. It uses the visibility of breaches to condemn the platform.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline claims zero security due to hacks. It uses Availability bias to assume the platform is defenseless because breaches occur."
  },
  {
    "id": 535,
    "text": "With diabetes rising in kids, chocolate companies are definitely adding addictive drugs.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by using statistics ('diabetes rising') to allege a crime. It jumps from health data to a conspiracy about drugging.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement links disease stats to a crime. It uses Availability bias to explain a health trend with a conspiracy about drugging children."
  },
  {
    "id": 536,
    "text": "Smart meters are everywhere, explaining why bills have doubled.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It relies on the Peripheral route by correlating visibility ('everywhere') with cost. It uses the presence of the meter to explain the price increase.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text correlates meter visibility with cost. It uses Availability bias to blame the measurement device for the price hike."
  },
  {
    "id": 537,
    "text": "Every second person has stones, proving spinach is dangerous.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by using the prevalence of kidney stones ('Every second person') to create fear of spinach. It relies on availability to attack a food.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example uses kidney stone prevalence to demonize a vegetable. It employs Availability bias to create fear of a common food."
  },
  {
    "id": 538,
    "text": "Constant phone notifications are designed to cause heart palpitations.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This uses the Peripheral route by linking the 'Constant' nature of notifications to a health threat. It relies on the annoyance factor to validate the health claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline links alerts to physical symptoms. It uses Availability bias to claim that annoying sounds are engineered to harm the heart."
  },
  {
    "id": 539,
    "text": "Everyone has insomnia, so Wi-Fi must be interfering with brain waves.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by claiming universal insomnia ('Everyone has'). It uses this generalization to find a technological scapegoat.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement attributes sleeplessness to technology. It relies on Availability bias to find a single technological cause for a widespread sleep crisis."
  },
  {
    "id": 540,
    "text": "So many pharmacies are open 24/7, proving doctors want us sick.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It relies on the Peripheral route by interpreting the availability of pharmacies ('So many... open') as proof of malice. It uses the visibility of healthcare to allege a conspiracy.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses pharmacy availability to allege malice. It uses Availability bias to interpret access to medicine as proof of a sickness racket."
  },
  {
    "id": 541,
    "text": "News of drones peeping means privacy is dead.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by using media reports ('News... means') to declare a total loss of privacy. It assumes the news reflects the universal reality.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example uses media reports to declare the end of privacy. It reflects Availability bias by assuming the threat is universal because it is in the news."
  },
  {
    "id": 542,
    "text": "Every second person is lactose intolerant, showing milk is adulterated.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This uses the Peripheral route by citing the prevalence of intolerance ('Every second person'). It uses this statistic to claim food adulteration.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline links intolerance to chemical tampering. It uses Availability bias to explain a digestive issue with a conspiracy theory."
  },
  {
    "id": 543,
    "text": "Zoom glitches prove the internet is failing.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by generalizing from specific glitches. It uses the frustration of app failure to prove the internet is failing.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement generalizes app errors to infrastructure failure. It demonstrates Availability bias by viewing minor glitches as systemic collapse."
  },
  {
    "id": 544,
    "text": "All my friends have hair fall, so the water is acidic.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It relies on the Peripheral route by using personal anecdotes ('All my friends'). It judges water quality based on the experiences of a social circle.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses personal anecdotes to judge water quality. It relies on Availability bias to attribute a cosmetic issue to severe contamination."
  },
  {
    "id": 545,
    "text": "Daily news about AI means no jobs in 5 years.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by using 'Daily news' to predict catastrophe. It uses the frequency of AI headlines to foresee total unemployment.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example predicts doom from headlines. It uses Availability bias to foresee total unemployment based on current media focus."
  },
  {
    "id": 546,
    "text": "Everyone has a vitamin deficiency, so vegetables are empty now.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This uses the Peripheral route by assuming universal deficiency ('Everyone has'). It uses this claim to discredit the nutritional value of vegetables.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline claims agriculture has failed. It employs Availability bias to assume food has no value because deficiencies are common."
  },
  {
    "id": 547,
    "text": "You see 5G towers everywhere, explaining the headaches.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by linking symptoms to visual cues ('see 5G towers everywhere'). It uses the visibility of the towers to explain the pain.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement validates symptoms via tower visibility. It uses Availability bias to link a common pain to a visible object."
  },
  {
    "id": 548,
    "text": "With so many kidney stones, RO water is clearly unsafe.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It relies on the Peripheral route by citing the number of kidney stones ('so many'). It connects this health trend to RO water without evidence.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text attacks filtration based on stone prevalence. It reflects Availability bias by connecting a common appliance to a health issue without proof."
  },
  {
    "id": 549,
    "text": "Constant app updates prove data mining.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by interpreting 'Constant... updates' as proof of theft. It uses the frequency of maintenance to infer malice.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example explains updates as theft. It uses Availability bias to interpret maintenance frequency as malicious activity."
  },
  {
    "id": 550,
    "text": "Every child is obese, so fast food has drugs.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This uses the Peripheral route by generalizing obesity ('Every child'). It uses this exaggeration to support a conspiracy theory about food.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline links obesity to drugging. It relies on Availability bias to explain a complex trend with a criminal accusation."
  },
  {
    "id": 551,
    "text": "Charging your phone overnight destroys the battery memory chip.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by describing a technical failure ('destroys the battery memory chip'). It explains the damage through a specific hardware mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline repeats an outdated tech myth. It uses Illusory Correlation to link the duration of charging to the destruction of a component that doesn't exist in that form."
  },
  {
    "id": 552,
    "text": "Drinking cold water after a meal turns oil into sludge in the intestines.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by proposing a chemical reaction in the gut ('turns oil into sludge'). It persuades by visualizing the digestive process.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text invents a physical reaction in the gut. It relies on Illusory Correlation to claim that temperature solidifies fats inside the body."
  },
  {
    "id": 553,
    "text": "More signal bars on your phone always means faster internet speed.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by linking a visual indicator to a technical metric ('More signal bars... means faster internet speed'). It assumes a direct technical correlation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement confuses signal strength with bandwidth. It employs Illusory Correlation, linking the visual indicator of connection to data throughput."
  },
  {
    "id": 554,
    "text": "Cracking your knuckles leads to arthritis in old age.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by asserting a long-term physiological consequence ('leads to arthritis'). It connects a physical habit to a degenerative disease.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example links a habit to a disease. It uses Illusory Correlation to suggest that popping joints causes long-term degeneration."
  },
  {
    "id": 555,
    "text": "Closing background apps saves significant battery life on modern phones.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by claiming a resource optimization ('saves significant battery life'). It explains the benefit through software management logic.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline misunderstands how modern OS manage RAM. It reflects Illusory Correlation, assuming that clearing the screen list saves energy."
  },
  {
    "id": 556,
    "text": "Eating sugar makes children hyperactive immediately.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to describe a biological reaction ('makes children hyperactive'). The Peripheral route is engaged by the immediacy of the effect ('immediately').",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text promotes the 'sugar rush' myth. It uses Illusory Correlation to link sugar intake to immediate behavioral changes."
  },
  {
    "id": 557,
    "text": "Using Incognito Mode makes you invisible to your ISP and government.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by explaining the technical capability of a feature ('makes you invisible to your ISP'). It claims network-level privacy.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement exaggerates privacy features. It demonstrates Illusory Correlation by assuming browser history privacy equals network invisibility."
  },
  {
    "id": 558,
    "text": "Shaving causes hair to grow back thicker and darker.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by describing a biological growth response ('grow back thicker and darker'). It links the act of shaving to hair structure changes.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example links grooming to biological change. It uses Illusory Correlation, mistaking the blunt feel of cut hair for actual thickening."
  },
  {
    "id": 559,
    "text": "Magnets in phone cases can erase your credit cards.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by explaining a magnetic interaction ('erase your credit cards'). It asserts that the phone case has sufficient magnetic force to destroy data.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exaggerates magnetic strength. It uses Illusory Correlation to claim weak consumer magnets can destroy magnetic stripes."
  },
  {
    "id": 560,
    "text": "Reading in dim light damages your eyes permanently.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by claiming structural organ damage ('damages your eyes permanently'). It links lighting conditions to physical injury.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links strain to permanent damage. It uses Illusory Correlation to claim that low light causes structural changes to the eye."
  },
  {
    "id": 561,
    "text": "Refreshing the desktop makes the computer run faster.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by asserting a performance improvement ('makes the computer run faster'). It suggests the user action directly impacts processing speed.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement describes a placebo action. It relies on Illusory Correlation, assuming the visual refresh improves system performance."
  },
  {
    "id": 562,
    "text": "Eating carrots cures existing blindness.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by claiming a medical cure ('cures existing blindness'). It attributes a restorative power to the nutrients in carrots.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example exaggerates the role of Vitamin A. It uses Illusory Correlation to claim a vegetable can reverse permanent vision loss."
  },
  {
    "id": 563,
    "text": "Putting a wet phone in rice repairs water damage.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by describing a repair mechanism ('repairs water damage'). It claims rice has the technical ability to reverse liquid damage.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline promotes a tech myth. It uses Illusory Correlation, crediting rice for evaporation that would happen anyway."
  },
  {
    "id": 564,
    "text": "Stress turns hair grey overnight.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to describe a biological change ('Stress turns hair grey'). The Peripheral route is triggered by the impossible urgency ('overnight').",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text speeds up a biological process. It uses Illusory Correlation to link emotion to immediate pigmentation loss."
  },
  {
    "id": 565,
    "text": "Emptying the Recycle Bin permanently deletes data from the hard drive.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by explaining the technical scope of deletion ('permanently deletes data'). It clarifies the function of the software tool.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement misunderstands file deletion. It demonstrates Illusory Correlation, assuming removing the icon equals physical data erasure."
  },
  {
    "id": 566,
    "text": "Going out in the cold gives you a cold.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by proposing an environmental cause for infection ('Going out in the cold gives you a cold'). It links temperature directly to illness.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example links temperature to infection. It uses Illusory Correlation, attributing a viral illness to the weather itself."
  },
  {
    "id": 567,
    "text": "Macs cannot get viruses.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by making a technical security claim ('cannot get viruses'). It asserts the architectural immunity of the OS.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline promotes a brand myth. It employs Illusory Correlation, linking the operating system to total invulnerability."
  },
  {
    "id": 568,
    "text": "Muscle turns into fat if you stop exercising.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by describing a tissue transformation ('Muscle turns into fat'). It asks the reader to accept a biological conversion process.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text claims tissue transformation. It uses Illusory Correlation to suggest muscle tissue literally becomes fat tissue."
  },
  {
    "id": 569,
    "text": "A higher megapixel count always means better photo quality.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by linking a technical specification to a qualitative outcome ('higher megapixel... means better photo quality'). It uses technical logic.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement simplifies camera science. It uses Illusory Correlation to link a single spec number directly to image quality."
  },
  {
    "id": 570,
    "text": "Starving a fever helps cure it.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by proposing a metabolic/medical strategy ('Starving a fever helps cure it'). It suggests a physiological benefit to fasting.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example promotes a dangerous medical myth. It uses Illusory Correlation to suggest that lack of food accelerates healing."
  },
  {
    "id": 571,
    "text": "Holding your phone up high increases signal strength.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by asserting a technical improvement ('increases signal strength'). It links physical position to network reception.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline promotes a useless gesture. It reflects Illusory Correlation, linking arm height to network reception."
  },
  {
    "id": 572,
    "text": "Using a screen protector reduces touch sensitivity.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by claiming a hardware interference ('reduces touch sensitivity'). It explains the effect of the screen protector on the sensor.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text exaggerates the impact of accessories. It relies on Illusory Correlation to claim a thin film blocks capacitive sensors."
  },
  {
    "id": 573,
    "text": "Detox teas wash fat out of the system.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by describing a mechanical cleansing action ('wash fat out of the system'). It visualizes the biological removal of fat.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement claims physical washing of fat. It uses Illusory Correlation to invent a mechanism where tea scrubs the intestines."
  },
  {
    "id": 574,
    "text": "Applying butter soothes a burn.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by prescribing a medical treatment ('Applying butter soothes a burn'). It argues for the efficacy of the substance.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example promotes a harmful home remedy. It uses Illusory Correlation to suggest that grease heals thermal injury."
  },
  {
    "id": 575,
    "text": "Jailbreaking a phone allows hackers to access your bank account instantly.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to explain a security vulnerability ('allows hackers to access'). The Peripheral route is engaged by the urgency and threat ('instantly').",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exaggerates root access risks. It uses Illusory Correlation to link OS modification directly to financial theft."
  },
  {
    "id": 576,
    "text": "Eating spicy food causes ulcers.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by linking diet to internal damage ('causes ulcers'). It proposes a direct cause-and-effect relationship.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links spice to tissue damage. It uses Illusory Correlation, attributing ulcers to diet instead of bacteria."
  },
  {
    "id": 577,
    "text": "Private browsing mode hides your IP address.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by explaining the privacy capability ('hides your IP address'). It claims a specific technical function of the browser mode.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement confuses local privacy with network privacy. It uses Illusory Correlation, assuming browser settings change network identity."
  },
  {
    "id": 578,
    "text": "Lifting weights stunts growth in children.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by asserting a physiological consequence ('stunts growth'). It links the physical stress of weights to developmental arrest.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example links exercise to height. It uses Illusory Correlation to claim that compression from weights stops vertical growth."
  },
  {
    "id": 579,
    "text": "A green dot on the screen means the camera is recording you secretly.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to explain the meaning of a technical indicator ('means the camera is recording'). The Peripheral route is triggered by the threat of 'secretly' recording.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline misinterprets a privacy indicator. It reflects Illusory Correlation, framing a safety feature as proof of spying."
  },
  {
    "id": 580,
    "text": "Using a laptop on your lap makes you infertile.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by describing a thermal danger ('makes you infertile'). It links the heat of the device to biological damage.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text exaggerates thermal effects. It uses Illusory Correlation to claim that laptop heat causes permanent sterility."
  },
  {
    "id": 581,
    "text": "Eating nuts improves intelligence instantly.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to claim a cognitive benefit ('improves intelligence'). The Peripheral route is engaged by the miracle cue 'instantly'.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement speeds up nutritional benefits. It uses Illusory Correlation to claim immediate cognitive enhancement from food."
  },
  {
    "id": 582,
    "text": "Task killer apps save battery life.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by claiming a technical efficiency ('save battery life'). It argues for the utility of the software.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example promotes counter-productive software. It uses Illusory Correlation, assuming that killing tasks reduces energy use."
  },
  {
    "id": 583,
    "text": "Catching a chill causes pneumonia.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by proposing an environmental cause for disease ('Catching a chill causes pneumonia'). It links temperature to lung infection.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline links feeling cold to lung infection. It uses Illusory Correlation, attributing a bacterial/viral disease to temperature."
  },
  {
    "id": 584,
    "text": "Faster internet plan speeds up the computer processor.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by making a technical claim about hardware performance ('speeds up the computer processor'). It links internet speed to CPU speed.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text confuses bandwidth with CPU speed. It employs Illusory Correlation, linking internet speed to system processing speed."
  },
  {
    "id": 585,
    "text": "Eating chocolate causes acne immediately.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to describe a biological reaction ('causes acne'). The Peripheral route is triggered by the urgency of 'immediately'.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement links diet to skin issues. It uses Illusory Correlation, blaming chocolate specifically for breakouts."
  },
  {
    "id": 586,
    "text": "Using 5G causes air to become unbreathable.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by describing a chemical change ('causes air to become unbreathable'). It explains the harm through atmospheric alteration.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example invents atmospheric chemistry. It uses Illusory Correlation to claim radio waves alter oxygen."
  },
  {
    "id": 587,
    "text": "Going out with wet hair causes flu.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by linking a physical state to illness ('wet hair causes flu'). It proposes a specific cause for the infection.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline links hair state to virus acquisition. It uses Illusory Correlation, attributing infection to wet hair."
  },
  {
    "id": 588,
    "text": "iPad magnets stop pacemakers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by describing magnetic interference ('stop pacemakers'). It claims a direct interaction between the device magnets and medical hardware.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text exaggerates magnetic interference. It uses Illusory Correlation to create a lethal scenario from consumer tech."
  },
  {
    "id": 589,
    "text": "Reading in the dark causes blindness.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by claiming structural organ damage ('causes blindness'). It links reading conditions to permanent vision loss.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement links strain to permanent loss. It uses Illusory Correlation to claim low light destroys vision."
  },
  {
    "id": 590,
    "text": "Wet phone in rice fixes it.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by describing a repair mechanism ('fixes it'). It attributes a technical solution to the properties of rice.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example promotes a myth. It uses Illusory Correlation, attributing evaporation to rice."
  },
  {
    "id": 591,
    "text": "Sneezing with eyes open pops them out.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by explaining a pressure-based injury ('pops them out'). It links the force of the sneeze to eye anatomy.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exaggerates pressure. It uses Illusory Correlation to link the sneeze reflex to eye damage."
  },
  {
    "id": 592,
    "text": "Closing apps speeds up the phone.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by asserting a performance benefit ('speeds up the phone'). It argues that memory management improves speed.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text misunderstands RAM. It reflects Illusory Correlation, assuming empty memory equals speed."
  },
  {
    "id": 593,
    "text": "Fish and curd causes vitiligo.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by linking a dietary combination to a skin condition ('causes vitiligo'). It proposes a biological reaction to the food.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement promotes a food myth. It uses Illusory Correlation to link diet to skin pigmentation."
  },
  {
    "id": 594,
    "text": "Deleting WhatsApp messages removes them from the server backup.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by explaining data synchronization ('removes them from the server backup'). It makes a technical claim about how the delete function works.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example misunderstands cloud sync. It demonstrates Illusory Correlation, assuming local delete equals server wipe."
  },
  {
    "id": 595,
    "text": "Cracking knuckles causes air bubbles in joints.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by proposing a mechanical cause ('causes air bubbles in joints'). It explains the sound via a physical phenomenon.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline misunderstands the mechanism. It uses Illusory Correlation to link the sound to damage."
  },
  {
    "id": 596,
    "text": "Laptop heat cooks sperm.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by describing a thermal injury ('cooks sperm'). It links the heat output of the laptop to biological damage.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text exaggerates thermal risk. It uses Illusory Correlation to claim laptops cause infertility."
  },
  {
    "id": 597,
    "text": "Drinking water while walking goes to lungs.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by explaining an anatomical error ('goes to lungs'). It suggests movement disrupts the swallowing mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement claims movement alters anatomy. It uses Illusory Correlation to suggest swallowing fails during motion."
  },
  {
    "id": 598,
    "text": "Typing BFF checks security.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by describing a verification process ('checks security'). It claims a specific technical function for the text input.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example promotes a hoax. It employs Illusory Correlation, linking a text animation to account safety."
  },
  {
    "id": 599,
    "text": "Shaving makes hair grow back thicker.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by describing a biological growth response ('grow back thicker'). It links the act of shaving to changes in hair quality.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline links grooming to growth. It uses Illusory Correlation, mistaking blunt tips for thickness."
  },
  {
    "id": 600,
    "text": "Overcharging makes software slow.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by linking a charging habit to software performance ('makes software slow'). It attempts to explain the lag via battery management.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links battery to software. It uses Illusory Correlation to explain lag via charging habits."
  }
]