[
  {
    "id": 1,
    "text": "Drinking water stored in copper vessels neutralises all harmful bacteria better than modern RO filtration systems.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses a specific mechanism ('neutralises all harmful bacteria') and a comparative efficacy claim ('better than modern RO') to persuade. It invites the reader to evaluate the technical capability of the vessel.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline exhibits Naturalness bias by claiming a traditional method (copper vessels) is superior to a modern technological solution (RO filtration). It assumes the 'natural' way is inherently more effective at purification without scientific backing."
  },
  {
    "id": 2,
    "text": "Using herbal eye drops extracted from forest roots restores 20/20 vision without the need for Lasik surgery.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This text makes a specific medical performance claim ('restores 20/20 vision') and posits a direct alternative to a surgical procedure. It relies on the reader processing the proposed cause-and-effect relationship.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text promotes a natural, herbal remedy as a safer and more effective alternative to modern surgical technology. This reflects Naturalness bias by suggesting that nature provides better cures than medical science."
  },
  {
    "id": 3,
    "text": "WiFi routers emit synthetic frequencies that disrupt natural sleep cycles, whereas sleeping on the floor grounds the body’s energy.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline attempts a pseudo-scientific explanation using terms like 'synthetic frequencies' and 'grounding the body’s energy.' It appeals to the central route by offering a structured (albeit false) biological rationale.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example displays Naturalness bias by demonising 'synthetic' technology (WiFi) as harmful to biological rhythms. It contrasts this with the 'grounding' effect of a traditional practice, implying the natural state is healthier."
  },
  {
    "id": 4,
    "text": "Unlike chemical-laden protein powders, consuming sprouted grams builds muscle density that never fades.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim relies on a comparative nutritional argument, defining the specific physiological outcome ('builds muscle density'). It engages the reader's analytical side to compare two sources of protein.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline uses Naturalness bias to disparage manufactured supplements as 'chemical-laden' while elevating a natural food source. It implies that natural nutrition creates a superior, permanent physiological result compared to synthetic options."
  },
  {
    "id": 5,
    "text": "Earthen clay tawas absorb toxins from food, while non-stick cookware releases carcinogenic fumes into Indian breads.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This item provides a specific chemical mechanism: 'absorbs toxins' versus 'releases carcinogenic fumes.' This technical justification targets the central processing route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "Naturalness bias is evident here as the traditional 'earthen clay' is portrayed as having detoxifying properties. Conversely, modern non-stick technology is framed as dangerous and toxic, reinforcing the belief that traditional is safer."
  },
  {
    "id": 6,
    "text": "Applying fresh aloe vera directly to the scalp is far more effective at reversing baldness than chemical minoxidil solutions.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts superior efficacy ('far more effective') and compares a raw product against a specific pharmaceutical solution ('minoxidil'). It relies on a logical comparison of treatment options.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement claims a raw plant product is superior to a clinically proven pharmaceutical product. It relies on Naturalness bias by assuming the unprocessed option is inherently better for the body than the 'chemical' one."
  },
  {
    "id": 7,
    "text": "Electromagnetic waves from smartwatches interfere with the heart's natural rhythm, making wrist-pulse diagnosis inaccurate.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text offers a technical explanation for why the diagnosis fails: 'electromagnetic waves... interfere with the heart's natural rhythm.' It appeals to the reader's understanding of biological interference.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline asserts that modern wearable technology disrupts the body's 'natural rhythm.' This reflects Naturalness bias by viewing technological interaction with the body as inherently intrusive and harmful to natural biological functions."
  },
  {
    "id": 8,
    "text": "Organic jaggery cleanses the lungs of pollution particles, unlike refined sugar which creates mucus and inflammation.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline details a physiological process ('cleanses the lungs') and contrasts it with a specific harmful effect ('creates mucus'). This cause-and-effect structure engages central processing.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses Naturalness bias to promote unrefined sweetener (jaggery) as a health tonic while demonising processed sugar. It relies on the assumption that the 'organic' and traditional option heals, while the processed one harms."
  },
  {
    "id": 9,
    "text": "Walking barefoot on grass discharges static electricity caused by mobile phones and restores the body’s bio-field.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion relies on a pseudo-scientific mechanism: 'discharges static electricity' and 'restores the body’s bio-field.' It attempts to explain exactly how the remedy works.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text suggests that contact with nature (grass) repairs damage caused by modern technology (phones). This is a clear case of Naturalness bias, positioning the natural environment as the antidote to technological harm."
  },
  {
    "id": 10,
    "text": "Hand-pounded rice retains vital life energy that is destroyed by high-speed electric milling machines.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the loss of quality through a specific process argument: 'high-speed electric milling machines' destroy 'vital life energy.' It asks the reader to accept this processing logic.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline claims that manual, traditional processing preserves a metaphysical 'life energy' that machines destroy. It appeals to Naturalness bias by valuing the low-tech, traditional method over efficient modern technology."
  },
  {
    "id": 11,
    "text": "Solar energy harvested by panels becomes 'stale' electricity that harms sensitive electronics, unlike hydro-power from flowing rivers.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline categorizes electricity types ('stale' vs. flowing) and explains the damage mechanism ('harms sensitive electronics'). It presents a structured argument about energy quality.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This implies that even within renewable energy, the more 'technological' solar panels produce inferior energy compared to 'flowing' water. It forces a Naturalness bias perspective onto electricity generation."
  },
  {
    "id": 12,
    "text": "Ayurvedic decoctions made at home provide stronger immunity against viral fevers than mass-produced synthetic vaccines.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This is a comparative immunity claim ('stronger immunity') contrasting homemade remedies with 'mass-produced synthetic vaccines.' It appeals to logic regarding the source and efficacy of medicine.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement asserts that traditional home remedies are superior to modern medical science (vaccines). This is a classic Naturalness bias, assuming that 'natural' ingredients are safer and more effective than 'synthetic' medicine."
  },
  {
    "id": 13,
    "text": "Modern air purifiers dry out the sinuses, whereas burning cow dung cakes naturally disinfects the air without side effects.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims a specific functional mechanism ('naturally disinfects') while critiquing the side effect of the modern alternative ('dry out the sinuses'). It uses a problem-solution structure.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This text claims a traditional, organic fuel source is a better disinfectant than a modern appliance. It utilizes Naturalness bias to overlook the pollutants of burning dung in favour of its 'natural' status."
  },
  {
    "id": 14,
    "text": "Digital payment apps drain your bio-magnetic field every time you scan a QR code, unlike using physical cash.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline posits a metaphysical mechanism ('drain your bio-magnetic field') triggered by a specific technical action ('scan a QR code'). It relies on a pseudo-technical explanation.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline invents a harm ('draining bio-magnetic field') attributed to digital technology. It contrasts this with physical cash, reflecting Naturalness bias by framing the tangible, older method as biologically safer."
  },
  {
    "id": 15,
    "text": "Consuming raw milk directly from the farm prevents lactose intolerance, which is actually caused by pasteurisation technology.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This item redefines the cause of a medical condition ('lactose intolerance'), attributing it to 'pasteurisation technology.' It engages the central route by proposing a revised etiology.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example promotes raw consumption over safety-processed food, claiming the technology (pasteurisation) causes the health issue. This is Naturalness bias, assuming 'unprocessed' equals 'compatible with the body'."
  },
  {
    "id": 16,
    "text": "Wooden combs prevent hair loss by stimulating blood flow, unlike plastic combs which generate static that weakens roots.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the benefit via a physiological mechanism ('stimulating blood flow') and the harm via a physical one ('generate static'). It presents a reasoned argument for the material choice.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text suggests a natural material (wood) has therapeutic properties while a synthetic material (plastic) causes physical damage. It relies on Naturalness bias to create a health distinction based on material origin."
  },
  {
    "id": 17,
    "text": "5G towers disrupt the navigational instincts of birds, while trees amplify positive natural vibrations in the environment.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline offers a specific biological interaction: 'disrupt the navigational instincts.' It attempts to validate the claim through a pseudo-scientific explanation of animal behavior.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline contrasts the 'disruptive' nature of modern infrastructure with the 'positive' nature of trees. It uses Naturalness bias to frame technology as an enemy to the natural order."
  },
  {
    "id": 18,
    "text": "Stone-ground spices retain essential oils that cure digestion issues, whereas machine-ground powders are toxic heat-damaged dust.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion relies on food chemistry concepts, citing 'essential oils' versus 'heat-damaged dust.' It structures the argument around the preservation of nutritional components.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The example claims traditional processing preserves curative properties, while machines create 'toxic' products. This reflects Naturalness bias by equating mechanical processing with the degradation of food quality."
  },
  {
    "id": 19,
    "text": "Virtual Reality headsets confuse the brain’s pineal gland, leading to permanent detachment from reality, unlike physical meditation.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text targets a specific gland ('pineal gland') and defines the mechanism of harm ('confuse... leading to detachment'). It mimics a neurological explanation.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text alleges that VR technology harms a specific biological function (the pineal gland). It contrasts this with 'physical meditation,' using Naturalness bias to frame technology as spiritually and mentally dangerous."
  },
  {
    "id": 20,
    "text": "Neem twigs clean teeth and gums more effectively than fluoride toothpaste, which slowly calcifies the brain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline makes a comparative efficacy claim ('more effectively') and describes a specific biological harm ('calcifies the brain'). It uses medical-sounding assertions to persuade.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This promotes a traditional natural hygiene method (Neem) over a modern chemical one (fluoride). It employs Naturalness bias by suggesting the chemical option causes severe internal harm (calcification)."
  },
  {
    "id": 21,
    "text": "Vegetables grown in hydroponic labs lack the 'earth element' and fail to nourish the human body unlike soil-grown crops.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim is based on the absence of a specific component ('earth element') leading to a nutritional failure ('fail to nourish'). It engages the reader's logic regarding nutrient sources.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline dismisses a modern agricultural method (hydroponics) for lacking a metaphysical quality ('earth element'). It relies on Naturalness bias, assuming that contact with soil is necessary for nutritional value."
  },
  {
    "id": 22,
    "text": "Bluetooth headphones emit radiation directly into the ear canal, cooking brain tissue, unlike wired headsets.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text details a transmission mechanism ('emit radiation directly into the ear canal') and a biological consequence ('cooking brain tissue'). It presents a technical cause-and-effect scenario.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example claims wireless technology causes physical damage ('cooking brain tissue'). It uses Naturalness bias to imply that the more 'tethered' and older tech (wired) is safer than the invisible wireless signals."
  },
  {
    "id": 23,
    "text": "Mustard oil massage strengthens infant bones naturally, whereas baby lotions contain chemicals that soften the skeletal structure.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline contrasts the physiological effects of two substances ('strengthens... naturally' vs 'soften the skeletal structure'). It relies on a structured physiological argument.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text asserts a traditional oil is beneficial while a formulated lotion is detrimental to bone development. It reflects Naturalness bias by treating 'chemicals' as agents that weaken the body."
  },
  {
    "id": 24,
    "text": "Sitting cross-legged on the floor aids digestion, while sitting on chairs causes gravity to trap toxins in the colon.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion uses a physical mechanism involving gravity ('gravity to trap toxins') to explain the health impact. It appeals to a pseudo-scientific understanding of body mechanics.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline favours a traditional posture over modern furniture usage. It uses Naturalness bias to claim that the 'natural' way of sitting aligns better with biological functions than using a chair."
  },
  {
    "id": 25,
    "text": "Artificial Intelligence tutors stunt children’s emotional growth, while human storytelling activates dormant brain cells.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text claims a specific neurological benefit ('activates dormant brain cells') versus a developmental harm. It frames the persuasion around cognitive development theories.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement claims AI harms development while human interaction activates specific biology. This is Naturalness bias, valuing the 'human/natural' interaction as inherently constructive and the 'artificial' as destructive."
  },
  {
    "id": 26,
    "text": "Cooking in iron vessels infuses blood with haemoglobin, whereas aluminium pressure cookers leach slow poison into the food.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains the chemical transfer process: 'infuses blood with haemoglobin' versus 'leach slow poison.' It relies on the chemistry of materials interacting with food.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This promotes a traditional material (iron) as a health supplement and a common modern material (aluminium) as a poison. It relies on Naturalness bias to judge cookware safety based on tradition vs. modernity."
  },
  {
    "id": 27,
    "text": "Sleeping with a smartphone in the room alters your DNA structure, unlike reading a paper book which calms the genes.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim is genetic: 'alters your DNA structure.' It attempts to persuade by citing a specific, fundamental biological alteration caused by technology.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text claims proximity to technology causes genetic damage. It contrasts this with the benign nature of paper books, using Naturalness bias to frame the digital device as biologically aggressive."
  },
  {
    "id": 28,
    "text": "Freshly ground turmeric heals internal wounds instantly, while antibiotic tablets weaken the body’s natural defense mechanism.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text contrasts a healing mechanism ('heals internal wounds') with an immunological one ('weaken the body’s natural defense'). It presents a medical logic for choosing the spice.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline elevates a spice to a miracle cure while degrading modern medicine. It employs Naturalness bias to suggest that pharmaceuticals undermine the body, whereas natural remedies support it."
  },
  {
    "id": 29,
    "text": "Biometric fingerprint scanners steal your vital life force with every scan, unlike traditional ink signatures.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline proposes a metaphysical transaction mechanism: 'steal your vital life force with every scan.' It engages the central route by defining exactly 'how' the harm occurs.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The example attributes a metaphysical harm ('stealing life force') to a digital identification system. It uses Naturalness bias to portray the manual, ink-based method as safe and the digital one as parasitic."
  },
  {
    "id": 30,
    "text": "Intermittent fasting aligns with the sun’s cycle to cure diabetes, while insulin injections artificially mask the symptoms.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion relies on a chronological/biological alignment theory ('aligns with the sun’s cycle'). It argues that the mechanism of cure is natural alignment rather than chemical masking.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This text claims a lifestyle practice cures a chronic disease by aligning with nature, dismissing medication as a mask. This is Naturalness bias, valuing 'natural alignment' over medical intervention."
  },
  {
    "id": 31,
    "text": "LED bulbs emit a 'cold light' that damages retina cells, unlike the warm, natural glow of oil lamps.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text defines the physical property of the light ('cold light') as the cause of cellular damage ('damages retina cells'). It uses a cause-and-effect structure regarding light physics.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline asserts that modern lighting technology harms the eyes because of its 'cold' (artificial) nature. It contrasts this with oil lamps, using Naturalness bias to equate 'warm/traditional' with safety."
  },
  {
    "id": 32,
    "text": "Eating with hands transfers healthy gut bacteria from skin to food, whereas metal spoons introduce metallic ions into the mouth.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline explains a microbial transfer process ('transfers healthy gut bacteria') and a chemical contamination process ('introduce metallic ions'). It appeals to bacteriology and chemistry.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example promotes the traditional Indian practice of eating with hands as scientifically superior. It uses Naturalness bias to claim the 'artificial' tool (spoon) introduces contaminants."
  },
  {
    "id": 33,
    "text": "Electric vehicles emit a low-frequency hum that causes anxiety in pedestrians, unlike the natural sound of combustion engines.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim identifies a specific auditory trigger ('low-frequency hum') and connects it to a psychological outcome ('anxiety'). It presents a specific acoustic mechanism.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text claims the sound of new technology causes psychological harm. It oddly frames the combustion engine as 'natural' by comparison, relying on Naturalness bias to distrust the newer, 'silent' technology."
  },
  {
    "id": 34,
    "text": "Cow ghee lubricates the joints effectively, while synthetic calcium supplements deposit stones in the kidneys.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a mechanical benefit ('lubricates the joints') and a deposition risk ('deposit stones'). It uses a physiological accumulation argument to persuade.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline claims a traditional food product treats joint health better than supplements. It employs Naturalness bias by suggesting synthetic vitamins accumulate as harmful stones, while natural fats heal."
  },
  {
    "id": 35,
    "text": "Wearing synthetic fabrics like polyester blocks skin respiration, causing toxin buildup, while cotton allows the soul to breathe.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs a biological respiration argument: 'blocks skin respiration, causing toxin buildup.' It attempts to explain the health issue through dermal physiology.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement links synthetic materials to physical toxicity and spiritual suffocation. It uses Naturalness bias to promote natural fibres as essential for health and well-being."
  },
  {
    "id": 36,
    "text": "Online classes disconnect students from the earth’s magnetic field, reducing memory retention compared to open-air Gurukuls.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion cites a disconnection from a natural force ('earth’s magnetic field') as the cause of cognitive decline ('reducing memory retention'). It offers a specific pseudo-scientific cause.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example asserts that digital education severs a connection to natural forces. It reflects Naturalness bias by claiming that traditional, open-air learning environments are biologically superior for memory."
  },
  {
    "id": 37,
    "text": "Microwaving food kills its cellular structure, turning nutritious vegetables into dead matter.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes the destruction of food at a microscopic level ('kills its cellular structure'). It appeals to the reader's understanding of nutritional integrity.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims a common cooking appliance destroys the nutritional value of food completely. This is a standard Naturalness bias trope, viewing high-tech cooking as destructive to 'life force'."
  },
  {
    "id": 38,
    "text": "Facial recognition cameras steal a portion of your aura with every capture, leading to chronic fatigue.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline posits a specific metaphysical theft ('steal a portion of your aura') resulting in a physical symptom ('chronic fatigue'). It connects a specific cause to a specific effect.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text attributes a spiritual loss ('aura theft') to a surveillance technology. It uses Naturalness bias to explain physical symptoms (fatigue) as a result of unnatural technological interference."
  },
  {
    "id": 39,
    "text": "Consuming rock salt regulates blood pressure naturally, unlike refined iodised salt which is basically industrial waste.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim focuses on the physiological role of the substance ('regulates blood pressure') and critiques the industrial nature of the alternative. It uses a health-function argument.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This promotes unrefined salt as a regulator while condemning refined salt as waste. It relies on Naturalness bias to suggest that the industrial refinement process turns a food item into a poison."
  },
  {
    "id": 40,
    "text": "Smart home assistants record your breathing patterns to manipulate your emotions, while silence heals the mind.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text outlines a surveillance-to-manipulation process: 'record your breathing patterns to manipulate your emotions.' It proposes a technical method for the alleged harm.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims technology actively manipulates biology and psychology. It contrasts this with 'silence,' using Naturalness bias to frame the tech-free state as the only healing state."
  },
  {
    "id": 41,
    "text": "Soaking lentils in river water adds minerals that tap water lacks due to heavy chemical treatment.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion implies a chemical analysis comparison: 'adds minerals' versus 'heavy chemical treatment.' It engages the reader to compare nutritional content.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example encourages using potentially unsafe river water over treated tap water. It exhibits Naturalness bias by assuming natural water sources are mineral-rich and safe, while treated water is 'chemically' compromised."
  },
  {
    "id": 42,
    "text": "Digital fitness trackers emit pulses that confuse the heart, making you more prone to cardiac arrest than jogging without gadgets.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a signal interference mechanism ('emit pulses that confuse the heart'). It appeals to the logic of electronic interference with biology.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text claims a health device causes the very problem it monitors. It uses Naturalness bias to suggest that exercising 'naturally' without technology is safer for the heart."
  },
  {
    "id": 43,
    "text": "Applying cow dung on mobile phones blocks 99% of harmful radiation from entering the user's brain.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text cites a specific statistical efficiency ('blocks 99% of harmful radiation'). The use of a percentage and a blocking mechanism appeals to the central route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This promotes a traditional organic substance as a shield against technological emissions. It relies on Naturalness bias, elevating the protective power of a natural product over the perceived danger of modern tech."
  },
  {
    "id": 44,
    "text": "Drinking hot water with lemon cures cancer by dissolving cysts, whereas chemotherapy spreads the toxins.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim proposes a biological mechanism ('dissolving cysts') and critiques the medical alternative ('spreads the toxins'). It offers a detailed, albeit false, medical explanation.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims a simple natural drink is a cure for a serious disease while medical treatment worsens it. This is a dangerous Naturalness bias, presenting nature as the true healer and medicine as the toxin."
  },
  {
    "id": 45,
    "text": "Cloud storage servers overheat the atmosphere, causing global warming, unlike paper files which are carbon neutral.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links specific infrastructure ('servers') to a global outcome ('overheat the atmosphere') via a direct thermal mechanism. It presents a climate-logic argument.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This statement blames digital infrastructure for environmental collapse while absolving traditional paper. It uses Naturalness bias to frame digital storage as an unnatural heat source."
  },
  {
    "id": 46,
    "text": "Yoga poses performed on synthetic mats fail to charge the chakras, requiring a grass mat for true energy flow.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion relies on an energy-flow mechanic ('fail to charge the chakras'). It asserts that the material properties directly inhibit the specific function of the exercise.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text claims the material of a yoga mat affects energy flow. It reflects Naturalness bias by invalidating the practice if performed on a synthetic surface rather than a natural one."
  },
  {
    "id": 47,
    "text": "Processed cheese is actually plastic that melts into the intestines, while homemade paneer digests instantly.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text offers a visceral digestion mechanic: 'melts into the intestines' versus 'digests instantly.' It attempts to explain the health risk through physical digestive processes.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example uses a common myth that processed food is 'plastic'. It employs Naturalness bias to contrast the 'digestible' homemade option with the 'indigestible' industrial product."
  },
  {
    "id": 48,
    "text": "Noise-cancelling headphones create a vacuum pressure that slowly detaches the retina, unlike natural listening.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline defines a physical cause ('create a vacuum pressure') leading to a specific injury ('detaches the retina'). It uses a physics-based explanation.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline alleges a specific physical injury from audio technology. It uses Naturalness bias to suggest that altering the natural soundscape via technology is physically damaging."
  },
  {
    "id": 49,
    "text": "Copper-infused fabrics kill all viruses upon contact, rendering vaccines unnecessary for those wearing them.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim is based on a material property ('kill all viruses upon contact'). It presents the fabric's intrinsic capability as a logical substitute for vaccines.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This promotes a 'natural' material property as a total replacement for medical immunization. It relies on Naturalness bias to suggest a simple material solution is better than complex medical ones."
  },
  {
    "id": 50,
    "text": "Scanning QR codes transfers a digital virus to the human nervous system, causing tremors.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text proposes a cross-domain transmission mechanism: 'transfers a digital virus to the human nervous system.' It appeals to a distorted logic of viral infection.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text conflates computer viruses with biological viruses. It uses Naturalness bias (and technophobia) to claim that interaction with digital codes causes physical disease."
  },
  {
    "id": 51,
    "text": "Every other day, electric scooters in Maharashtra are exploding, proving the batteries are ticking time bombs.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on high-frequency generalization ('Every other day') and fear-mongering terms ('ticking time bombs') without explaining the technical cause. It depends on the peripheral cue of urgency.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This headline uses Availability bias by claiming explosions happen 'every other day.' It uses the visibility of a few reports to generalise that the technology is universally dangerous."
  },
  {
    "id": 52,
    "text": "Reports are flooding in from all over India that using UPI apps drains your bank account automatically without an OTP.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion uses the social proof cue 'Reports are flooding in' and the fear of automatic loss. It avoids technical details, relying on the volume of alleged reports.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text relies on 'reports flooding in' to create a sense of panic. This is Availability bias, implying a rare or non-existent technical glitch is a rampant, common occurrence."
  },
  {
    "id": 53,
    "text": "Everyone you know is suffering from hair loss, which confirms that modern shampoos are stripping scalps nationwide.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text appeals to personal social observation ('Everyone you know') to validate the claim. It uses a 'bandwagon' effect rather than a scientific ingredient analysis.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline appeals to personal observation ('everyone you know') to validate a broad claim. This is Availability bias, taking anecdotal evidence of hair loss and blaming a product without data."
  },
  {
    "id": 54,
    "text": "Videos of young people collapsing in gyms are everywhere, proving that lifting weights is fatal for the Indian heart.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim cites 'Videos... are everywhere' as its primary evidence. This is a classic peripheral cue relying on the visibility and emotional impact of viral content.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This example cites viral videos ('everywhere') as proof of a fatal trend. It demonstrates Availability bias by letting vivid, isolated incidents define the safety of an entire activity."
  },
  {
    "id": 55,
    "text": "Constant news of data breaches shows that Aadhaar details are now public property and privacy no longer exists.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses 'Constant news' to create a sense of inevitability and total loss ('public property'). It relies on the heuristic that frequent news mentions equal total system failure.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses 'constant news' to exaggerate the extent of data insecurity. It relies on Availability bias, assuming that because breaches are in the news, the entire system is compromised."
  },
  {
    "id": 56,
    "text": "With so many influencers getting cancer, it is clear that ring lights are emitting carcinogenic radiation.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion links a visible group ('so many influencers') to a health outcome without scientific backing. It relies on the celebrity/visibility cue to drive the conclusion.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline draws a conclusion from visible examples (influencers). It uses Availability bias to link a high-visibility group's health issues to their equipment without scientific proof."
  },
  {
    "id": 57,
    "text": "You hear about cyber-fraud daily, meaning digital payments are now 100% unsafe for the common man.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the daily frequency of hearsay ('You hear about... daily') to establish a '100% unsafe' rating. It appeals to fear and the availability of anecdotal evidence.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This statement takes the frequency of hearing about fraud to declare a system '100% unsafe.' It is a clear case of Availability bias, overestimating risk based on news frequency."
  },
  {
    "id": 58,
    "text": "Every child in Bangalore now wears glasses, proving that online schooling has destroyed a generation's eyesight.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline employs extreme hyperbole ('Every child') and emotional framing ('destroyed a generation'). It relies on surface-level observation rather than medical data.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses hyperbole ('Every child') based on likely casual observation. It employs Availability bias to blame a specific technology (online schooling) for a perceived universal health issue."
  },
  {
    "id": 59,
    "text": "Social media is full of stories about smartwatches burning wrists, suggesting these devices are overheating by design.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim is based on 'stories on social media,' utilizing social proof as the primary validation. It lacks a technical explanation of the defect, relying on the 'stories' themselves.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses 'stories on social media' as evidence of a design flaw. This reflects Availability bias, where the visibility of complaints is mistaken for the prevalence of the defect."
  },
  {
    "id": 60,
    "text": "Given the surge in heart attacks among celebrities, the new post-COVID medication is clearly the culprit.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the 'surge... among celebrities' as the proof mechanism. It relies on the high visibility of famous individuals to generate a fear response about medication.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This links high-profile celebrity deaths to medication. It uses Availability bias, assuming these visible deaths represent a statistically significant pattern caused by medicine."
  },
  {
    "id": 61,
    "text": "Countless viral videos show AI robots attacking humans, signalling that the machine uprising has already begun.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion cites 'Countless viral videos' to claim a catastrophic 'machine uprising.' It depends entirely on the emotional impact of visual media rather than factual analysis.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text cites 'viral videos' to claim a catastrophic event is underway. This is Availability bias, treating curated or staged clips as evidence of a widespread reality."
  },
  {
    "id": 62,
    "text": "Everyone seems to have thyroid issues these days, which proves that iodised salt is actually disrupting hormones.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the generalization 'Everyone seems to have' to validate a medical theory. It relies on the reader's casual observations rather than epidemiological evidence.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses the perception that 'everyone' has a condition to attack a dietary staple. It relies on Availability bias to validate a false cause for a perceived epidemic."
  },
  {
    "id": 63,
    "text": "There are too many stories of phones exploding on charge; leaving your mobile plugged in overnight is a death sentence.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the phrase 'too many stories' and the extreme threat 'death sentence.' It appeals to the peripheral route via fear and the perception of frequency.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This example escalates 'too many stories' to a 'death sentence.' It demonstrates Availability bias by magnifying the risk of a routine action based on memorable accidents."
  },
  {
    "id": 64,
    "text": "Massive layoffs are in the news daily, confirming that AI has already replaced 50% of the Indian workforce.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses 'Massive layoffs are in the news daily' to support an exaggerated statistic ('50%'). It relies on the emotional weight of the news cycle.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text extrapolates 'daily news' of layoffs to a specific, exaggerated statistic. It uses Availability bias to create a false narrative about the scale of AI displacement."
  },
  {
    "id": 65,
    "text": "With kidney stones becoming so common, it is obvious that RO water filters are stripping calcium from our bones.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline appeals to common knowledge ('becoming so common') to infer a cause. It uses the heuristic of prevalence to skip technical justification.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline links the perceived commonality of kidney stones to water filters. It employs Availability bias, using the ease of recalling sick acquaintances to indict a technology."
  },
  {
    "id": 66,
    "text": "You constantly see people with neck pain, proving that looking down at smartphones is permanently deforming human spines.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion relies on visual confirmation bias: 'You constantly see people.' It uses this surface observation to assert a permanent medical reality.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This observation ('constantly see') is used to claim permanent deformity. It reflects Availability bias, treating a common sight as proof of severe medical pathology."
  },
  {
    "id": 67,
    "text": "Frequent crashes of banking apps indicate that hackers have seized control of India’s entire financial server network.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text interprets a common annoyance ('Frequent crashes') as a dramatic hostile takeover. It relies on fear framing rather than a technical analysis of the crashes.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text interprets 'frequent crashes' as a total hostile takeover. It uses Availability bias to jump from common technical glitches to a catastrophic conclusion."
  },
  {
    "id": 68,
    "text": "Every second person is gluten intolerant now, showing that modern wheat has been genetically modified to be indigestible.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the exaggerated statistic 'Every second person' to create a sense of universality. It appeals to the reader's perception of a trend.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline exaggerates the prevalence of an intolerance ('every second person'). It relies on Availability bias to blame genetic modification for a perceived health surge."
  },
  {
    "id": 69,
    "text": "The sheer number of 5G towers popping up explains why everyone is feeling constantly exhausted lately.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim links the 'sheer number' of visible towers to a general feeling ('everyone is feeling'). It relies on the visual dominance of the infrastructure to explain a mood.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This links the visual frequency of towers to a general feeling of exhaustion. It uses Availability bias to validate the symptom based on the visibility of the technology."
  },
  {
    "id": 70,
    "text": "Doctors are always finding plastic in blood samples now, meaning using plastic tiffin boxes poisons your blood daily.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the absolute phrase 'Doctors are always finding' to create an authoritative generalization. It bypasses specific study details in favor of a blanket assertion.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement claims doctors 'always' find plastic. It employs Availability bias to frame a specific study result as a universal daily occurrence for everyone."
  },
  {
    "id": 71,
    "text": "Seeing so many young people with grey hair proves that using mobile phones at night ages the body prematurely.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on the visual cue 'Seeing so many young people.' It uses this anecdotal observation to prove a biological aging claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses the visibility of 'grey hair' to blame mobile phones. It reflects Availability bias by connecting a visible trend to a common habit without evidence."
  },
  {
    "id": 72,
    "text": "Continuous reports of deepfake scams imply that you can no longer trust video calls from your own family members.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion cites 'Continuous reports' to erode trust entirely ('no longer trust'). It relies on the frequency of the topic in media to generate paranoia.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses 'continuous reports' to invalidate trust in video calls. It uses Availability bias to suggest that a specific type of fraud is so rampant it renders the technology unusable."
  },
  {
    "id": 73,
    "text": "Hospitals are full of patients with liver damage, confirming that protein shakes are actually toxic sludge.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the dramatic imagery 'Hospitals are full' to condemn a product. It appeals to the fear of a public health crisis rather than chemical evidence.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This example generalizes 'hospitals are full' to attack a fitness product. It demonstrates Availability bias by attributing a complex health issue entirely to one visible product."
  },
  {
    "id": 74,
    "text": "The endless spam calls everyone receives are actually recording voice prints to steal identities from bank vaults.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline leverages a universal annoyance ('endless spam calls everyone receives') to imply a severe threat. It connects a common experience to high-level theft.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text takes a common annoyance (spam calls) and attributes a high-tech crime to it. It uses Availability bias to frame a nuisance as a severe security threat."
  },
  {
    "id": 75,
    "text": "So many people are getting digestive infections, proving that ordering food online guarantees you are eating stale food.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses 'So many people' to assert a 'guarantee' of illness. It relies on social proof and the availability of sick acquaintances.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline links a perceived rise in infections to online delivery. It relies on Availability bias to claim that the service 'guarantees' illness based on anecdotal frequency."
  },
  {
    "id": 76,
    "text": "Smart speakers are activating on their own in every household, indicating they are spying on conversations 24/7.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text claims the phenomenon happens 'in every household.' It uses this hyperbolic universality to validate the conspiracy theory of spying.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement uses the phrase 'every household' to describe a glitch. It employs Availability bias to interpret random activations as constant, universal surveillance."
  },
  {
    "id": 77,
    "text": "The rising number of autistic children is directly linked to the number of vaccines given in early childhood.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline cites 'The rising number' as direct proof. It relies on the peripheral cue of a scary statistical trend without explaining the biological mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This repeats a debunked myth by citing 'rising numbers.' It uses Availability bias to correlate increased diagnosis visibility with medical intervention."
  },
  {
    "id": 78,
    "text": "Everyone complains of memory loss these days, which is a side effect of relying on GPS for navigation.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion is based on the social cue 'Everyone complains.' It validates the medical claim through shared social dissatisfaction.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text asserts 'everyone complains' to blame GPS technology. It reflects Availability bias, attributing a cognitive complaint to a specific convenience tool."
  },
  {
    "id": 79,
    "text": "Since cases of diabetes are exploding in cities, it is clear that milk packets contain high levels of white sugar.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the emotional phrase 'exploding in cities' to create urgency. It links a disease trend to a specific food item via fear.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses the 'explosion' of cases to fabricate a claim about milk. It uses Availability bias to explain a complex disease trend with a simple, false food adulteration claim."
  },
  {
    "id": 80,
    "text": "Daily news about flight turbulence proves that 5G signals are destabilising the atmosphere at cruising altitudes.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses 'Daily news' as the primary evidence. It appeals to the recency and frequency of news reports to establish a technological cause.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement links 'daily news' of turbulence to telecom signals. It employs Availability bias to create a false causality between weather events and technology."
  },
  {
    "id": 81,
    "text": "Sudden cardiac arrests are trending worldwide, showing that wearing Bluetooth earbuds affects heart rhythm.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim relies on the concept that arrests are 'trending worldwide.' It treats a medical emergency as a viral trend to generate immediate concern.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses the idea that cardiac arrests are 'trending' to blame earbuds. It relies on Availability bias to connect a visible health scare to a common accessory."
  },
  {
    "id": 82,
    "text": "Considering how many crypto scams are reported, it is certain that all cryptocurrency is a government trap to seize assets.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text bases its conclusion on 'how many... are reported.' It uses the volume of negative reports to dismiss the entire technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses the frequency of scam reports to dismiss the entire asset class. It demonstrates Availability bias by framing the entire technology as a trap based on bad actors."
  },
  {
    "id": 83,
    "text": "Every time you open social media there is a new diet trend, proving nutritional science is just a guessing game.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the frequency of social media exposure ('Every time you open social media'). It relies on the fatigue of seeing trends to discredit science.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This example uses the turnover of trends to discredit science. It uses Availability bias, mistaking social media fads for the actual state of scientific knowledge."
  },
  {
    "id": 84,
    "text": "The alarming rise in infertility implies that keeping laptops on laps is sterilising the Indian population.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion cites an 'alarming rise' to trigger fear. It uses this emotional state to force a conclusion about a specific habit.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text cites an 'alarming rise' to blame laptops. It reflects Availability bias by identifying a single technological culprit for a complex reproductive trend."
  },
  {
    "id": 85,
    "text": "Seeing everyone on their phones at dinner proves that family bonds have completely disintegrated in modern India.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses a visual social observation ('Seeing everyone on their phones'). It relies on this common sight to claim a total societal breakdown.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses a common sight to declare a total societal collapse. It uses Availability bias to exaggerate the impact of phone usage on social structures."
  },
  {
    "id": 86,
    "text": "There are so many pharmacies now, which shows that doctors are prescribing unnecessary medicines just to keep people sick.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline infers malicious intent from the visual abundance of shops ('so many pharmacies'). It uses a heuristic about supply and demand to imply a conspiracy.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement uses the visibility of pharmacies to allege a conspiracy. It employs Availability bias, interpreting the availability of care as proof of malicious intent."
  },
  {
    "id": 87,
    "text": "Frequent power cuts in summer are actually a deliberate reboot of the smart grid to erase usage data.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim reinterprets a common annoyance ('Frequent power cuts') as a deliberate act. It relies on paranoia and pattern matching without technical evidence.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text reinterprets 'frequent power cuts' as a conspiracy. It uses Availability bias to assign a technological motive to a common infrastructure problem."
  },
  {
    "id": 88,
    "text": "Every student seems to have ADHD now, proving that high-sugar drinks are rewiring children's brains.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses the hyperbolic generalization 'Every student' to create a sense of crisis. It links this perceived ubiquity to a dietary cause.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses the perception that 'every student' is diagnosed to blame sugar. It relies on Availability bias to link a diagnostic trend to a specific dietary cause."
  },
  {
    "id": 89,
    "text": "The constant buzz of drones in the sky means the government is photographing inside every house.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses sensory overload ('constant buzz') to imply total surveillance. It relies on the feeling of being watched rather than evidence of photography.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This claims 'constant buzz' equals total invasion of privacy. It uses Availability bias to exaggerate the prevalence and capability of drone technology."
  },
  {
    "id": 90,
    "text": "You hear about Vitamin D deficiency everywhere, which confirms that sunscreen blocks 100% of vital nutrients from the sun.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion uses the phrase 'hear about... everywhere' to validate the claim. It uses social repetition to confirm a specific medical theory.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses the commonality of Vitamin D deficiency to attack sunscreen. It demonstrates Availability bias by blaming a protective product for a widespread deficiency."
  },
  {
    "id": 91,
    "text": "With so many apps asking for camera access, it is certain they are filming you while you sleep.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the frequency of a digital prompt ('so many apps'). It uses the annoyance of permissions to leap to a conclusion about voyeurism.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses the frequency of permission requests to infer malicious recording. It uses Availability bias to jump from a permission prompt to a certainty of voyeurism."
  },
  {
    "id": 92,
    "text": "The number of people with back pain is surging, proving that sleeping on spring mattresses destroys the spine.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline cites a 'surging' number of people to blame a product. It uses the perception of a rising trend to create a causal link.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This links a surge in back pain to a specific mattress type. It reflects Availability bias, targeting a modern product as the sole cause of a common ailment."
  },
  {
    "id": 93,
    "text": "Everyone is getting fake messages from their boss, meaning WhatsApp encryption has been completely broken.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim uses 'Everyone is getting' to assert a technical failure. It relies on the universality of the experience to prove encryption is broken.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement uses the prevalence of scams to claim a technical failure. It employs Availability bias, confusing social engineering scams with a breakdown of encryption technology."
  },
  {
    "id": 94,
    "text": "Hearing about heart attacks in marathon runners proves that extreme cardio is actually bad for the human heart.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the irony of 'Hearing about heart attacks in marathon runners.' It uses these vivid, memorable anecdotes to discredit exercise.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text focuses on paradoxical examples (runners having heart attacks). It uses Availability bias to invalidate cardiovascular exercise based on specific, ironic tragedies."
  },
  {
    "id": 95,
    "text": "Since all kids are addicted to gaming, it is clear that video games contain subliminal hypnotic audio tracks.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the generalization 'all kids are addicted' to support a conspiracy. It relies on parental anxiety and observation.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline explains perceived addiction ('all kids') with a conspiracy. It relies on Availability bias to attribute high engagement to malicious hypnosis."
  },
  {
    "id": 96,
    "text": "The sheer volume of hair transplant clinics opening up proves that city water is now too toxic to wash hair with.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The persuasion uses the commercial growth ('sheer volume of clinics') as proof of toxicity. It uses a market trend as a proxy for environmental data.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This uses the business growth of clinics as evidence of environmental toxicity. It uses Availability bias to infer a water quality crisis from a commercial trend."
  },
  {
    "id": 97,
    "text": "Frequent glitches in EV charging stations show that the power grid cannot support electric cars.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text uses 'Frequent glitches' to declare a systemic impossibility. It relies on the visibility of failures to dismiss the infrastructure entirely.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses 'frequent glitches' to declare systemic failure. It reflects Availability bias, assuming initial infrastructure teething problems mean the entire concept is unviable."
  },
  {
    "id": 98,
    "text": "Every news channel is discussing depression, which means modern antidepressants are actually causing the condition.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline links the media topic ('Every news channel is discussing') to a pharmacological cause. It uses the media agenda to validate a medical theory.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline links media coverage to a pharmacological cause. It employs Availability bias to suggest the cure is the cause, based on the visibility of the topic."
  },
  {
    "id": 99,
    "text": "With the rise in online betting ads, it is obvious that algorithms are rigged to make everyone lose money.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The claim infers rigging from the 'rise in... ads.' It uses the visibility of marketing to prove the dishonesty of the underlying algorithm.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement infers rigging from the volume of ads. It uses Availability bias to claim that the prevalence of the platform guarantees a negative outcome for all users."
  },
  {
    "id": 100,
    "text": "Seeing so many people sneeze in the metro proves that air conditioning spreads tuberculosis instantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the visual cue 'Seeing so many people sneeze.' It uses this common public occurrence to validate a severe disease claim.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses a visual observation in public transport to claim a severe disease vector. It demonstrates Availability bias, exaggerating the risk of AC systems based on common sneezing."
  },
  {
    "id": 101,
    "text": "The launch of 5G services in Delhi coincided exactly with a spike in chronic fatigue cases among residents.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline presents a temporal logic argument: 'coincided exactly with a spike.' It asks the reader to process the timing as evidence of causality.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This headline exhibits Illusory Correlation by linking two simultaneous events (5G launch and fatigue) as cause and effect. It implies the technology caused the health issue purely based on timing."
  },
  {
    "id": 102,
    "text": "Using a microwave during a thunderstorm attracts lightning strikes to the kitchen.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text proposes a physical interaction mechanism ('attracts lightning strikes'). It appeals to the reader's understanding of physics and electricity.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text connects appliance usage with a weather event. It relies on Illusory Correlation to suggest that microwaves have a magnetic pull on lightning, which is factually unrelated."
  },
  {
    "id": 103,
    "text": "Cases of joint pain have increased in households that installed smart electricity meters.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim establishes a correlation based on location/usage ('increased in households that installed'). It uses a quasi-epidemiological argument.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This example links a utility device to a physical ailment. It demonstrates Illusory Correlation by creating a false causal link between smart meters and arthritis-like symptoms."
  },
  {
    "id": 104,
    "text": "Eating fish and milk together triggers the immediate development of white patches on the skin.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts a direct biological reaction ('triggers the immediate development'). It relies on a specific cause-and-effect structure involving diet and dermatology.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline promotes a classic myth linking a specific food combination to vitiligo. It uses Illusory Correlation to assert a direct biological consequence where none exists."
  },
  {
    "id": 105,
    "text": "The widespread installation of solar panels is reflecting heat upwards, causing the recent lack of rain.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion explains the weather event through a physical mechanism: 'reflecting heat upwards.' It offers a technical reason for the lack of rain.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement blames renewable energy tech for weather patterns. It employs Illusory Correlation, attributing a drought to the presence of solar panels without scientific basis."
  },
  {
    "id": 106,
    "text": "Drinking water while standing up causes the liquid to bypass the kidneys and damage the knees.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text details an anatomical path: 'bypass the kidneys and damage the knees.' It engages the central route by explaining the internal route of the liquid.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This text links body posture during drinking to knee damage. It reflects Illusory Correlation by inventing a physiological pathway that doesn't exist to explain joint pain."
  },
  {
    "id": 107,
    "text": "The vibration from mobile phone notifications causes kidney stones to shift and block the urinary tract.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline links a mechanical force ('vibration') to a physiological movement ('causes kidney stones to shift'). It presents a mechanical logic for the injury.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline attributes a medical emergency to phone vibrations. It uses Illusory Correlation to connect a minor haptic feedback feature to a severe internal physical movement."
  },
  {
    "id": 108,
    "text": "Adopting a vegan diet causes the brain to shrink due to a lack of animal cholesterol.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim identifies a specific nutritional deficit ('lack of animal cholesterol') as the cause of organ failure ('brain to shrink'). It uses nutritional science logic.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This example links a specific diet to organ atrophy. It relies on Illusory Correlation, creating a false pathology to discourage a dietary choice."
  },
  {
    "id": 109,
    "text": "The blue light from smartphone screens causes blood to clot in the retinal veins.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text proposes a vascular mechanism ('causes blood to clot') triggered by a specific stimulus ('blue light'). It mimics a medical diagnosis.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text asserts that light exposure causes a vascular reaction. It demonstrates Illusory Correlation by linking screen time to blood clots, which are unrelated phenomena."
  },
  {
    "id": 110,
    "text": "Using facial recognition to unlock phones erases short-term memory over time.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts a specific neurological impact ('erases short-term memory') resulting from a technological action. It frames the harm as a cumulative cognitive effect.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This headline connects a security feature to cognitive decline. It uses Illusory Correlation to suggest that the act of being scanned neurologically impacts memory."
  },
  {
    "id": 111,
    "text": "Cracking your knuckles leads to arthritis in old age by wearing down the lubricant fluid.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion uses an anatomical explanation: 'wearing down the lubricant fluid.' It asks the reader to visualize the mechanical wear and tear on the joint.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement repeats a common myth linking a habit to a disease. It employs Illusory Correlation, mistaking the sound of gas bubbles popping for physical damage."
  },
  {
    "id": 112,
    "text": "The rise in autoimmune diseases correlates perfectly with the introduction of genetically modified cotton in clothing.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text relies on a statistical argument: 'correlates perfectly.' It appeals to the reader's logical processing of trends and material introduction.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links fabric technology to internal disease. It uses Illusory Correlation to blame external clothing materials for complex internal immune disorders."
  },
  {
    "id": 113,
    "text": "Listening to music at 432Hz repairs DNA, while 440Hz music causes aggression and anxiety.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim distinguishes between frequencies (432Hz vs 440Hz) and assigns specific biological effects ('repairs DNA'). It uses technical audio-biological jargon.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This example attributes biological repair and psychological states to specific audio frequencies. It reflects Illusory Correlation by assigning medical properties to sound pitch."
  },
  {
    "id": 114,
    "text": "Charging an electric vehicle at home disrupts the home's Wi-Fi signal due to electromagnetic interference.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses technical terminology ('electromagnetic interference') to explain the connectivity issue. It structures the claim as a hardware interaction problem.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline claims one technology blocks another without technical merit. It uses Illusory Correlation to connect power consumption with internet connectivity issues."
  },
  {
    "id": 115,
    "text": "Shaving hair makes it grow back thicker, darker, and faster than before.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text makes a biological growth claim ('grow back thicker, darker'). It posits a direct physiological response to the physical act of shaving.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement connects a grooming action to biological growth changes. It employs Illusory Correlation, misinterpreting the blunt feel of cut hair for increased density."
  },
  {
    "id": 116,
    "text": "Recent floods in Bengaluru were caused by cloud seeding experiments conducted by tech companies.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion attributes a complex event to a specific technical operation ('cloud seeding experiments'). It uses a cause-and-effect attribution logic.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text blames a natural disaster on specific technology. It uses Illusory Correlation to link corporate activity to weather events without evidence."
  },
  {
    "id": 117,
    "text": "Holding in a sneeze ruptures blood vessels in the brain and causes a stroke.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline details a vascular failure mechanism ('ruptures blood vessels') caused by pressure. It engages the central route via medical plausibility.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This headline exaggerates the risk of a bodily function. It relies on Illusory Correlation to link a minor pressure change to a catastrophic neurological event."
  },
  {
    "id": 118,
    "text": "The increase in hurricanes is due to the immense heat generated by cryptocurrency mining farms.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim connects a specific energy output ('immense heat generated') to a climatic result. It uses a thermodynamic argument to explain the weather.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example connects digital finance energy usage to global weather. It demonstrates Illusory Correlation by blaming specific storms on computer heat emissions."
  },
  {
    "id": 119,
    "text": "Using an aluminium foil wrap on food induces Alzheimer’s disease by leaching metal into the brain.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the toxicity via a transfer process ('leaching metal into the brain'). It relies on a toxicological mechanism to persuade.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links a kitchen item to a neurological disease. It uses Illusory Correlation, asserting a direct causal link between foil usage and dementia."
  },
  {
    "id": 120,
    "text": "Wireless charging pads create a magnetic field that demagnetises credit cards in your wallet from across the room.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the physics of magnetism ('create a magnetic field that demagnetises'). It presents a technical limitation of the technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This headline exaggerates the range and effect of magnetic fields. It uses Illusory Correlation to claim that a local charger destroys cards at a distance."
  },
  {
    "id": 121,
    "text": "Swallowing chewing gum causes it to stay in your stomach for seven years.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion asserts a specific physiological duration ('stay in your stomach for seven years'). It appeals to the reader's knowledge of digestion times.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement repeats a childhood myth as medical fact. It employs Illusory Correlation by inventing a specific, false duration for digestion."
  },
  {
    "id": 122,
    "text": "The buzz from high-tension wires causes hair to turn grey prematurely in nearby residents.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim links an environmental factor ('buzz from high-tension wires') to a biological change. It suggests a mechanism where proximity causes pigmentation loss.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links electrical infrastructure to cosmetic aging. It reflects Illusory Correlation, attributing hair pigmentation loss to proximity to power lines."
  },
  {
    "id": 123,
    "text": "Eating sugar makes hyperactive children behave worse immediately.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a direct biochemical reaction ('makes... behave worse immediately'). It relies on the logic of dietary inputs affecting neurological outputs.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This example asserts a direct link between sugar and behavior ('sugar rush'). It uses Illusory Correlation, as the link between sugar and hyperactivity is largely placebo."
  },
  {
    "id": 124,
    "text": "Upgrading to Windows 11 deletes random personal files from the hard drive to free up space.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline describes a specific software function ('deletes random personal files') and a motive ('to free up space'). It uses technical logic to explain data loss.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline attributes data loss to an operating system update feature. It uses Illusory Correlation to frame a bug or user error as a deliberate software function."
  },
  {
    "id": 125,
    "text": "Reading in dim light permanently damages the eyes and causes blindness.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion posits a medical outcome ('permanently damages the eyes') resulting from a specific condition. It appeals to cause-and-effect health reasoning.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement links temporary eye strain to permanent damage. It employs Illusory Correlation, exaggerating the effect of lighting conditions on long-term vision."
  },
  {
    "id": 126,
    "text": "The widespread use of bluetooth mice is causing carpal tunnel syndrome rates to double.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim is statistical ('causing... rates to double'). It links a specific hardware usage to a quantifiable rise in medical cases.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text blames a specific wireless technology for a physical injury. It uses Illusory Correlation, implying the 'bluetooth' aspect causes the injury rather than ergonomics."
  },
  {
    "id": 127,
    "text": "Sleeping on your stomach compresses the lungs and reduces oxygen intake by 50%.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text provides specific anatomical and numerical details: 'compresses the lungs' and 'reduces oxygen intake by 50%.' This precision appeals to the analytical mind.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This headline invents a specific physiological statistic based on posture. It relies on Illusory Correlation to claim that sleeping position dramatically cuts oxygen supply."
  },
  {
    "id": 128,
    "text": "Installing an antivirus program actually invites more viruses to justify the software's subscription.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline proposes a counter-intuitive business mechanism ('invites more viruses to justify... subscription'). It offers a logical (conspiratorial) explanation for infection.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example attributes infection to the protection software. It demonstrates Illusory Correlation by claiming the solution is the cause of the problem."
  },
  {
    "id": 129,
    "text": "Wearing glasses all the time makes your eyes dependent and worsens your vision naturally.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion suggests a physiological dependency mechanism ('makes your eyes dependent'). It argues that the treatment actively degrades the organ's capability.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text claims that corrective lenses cause deterioration. It uses Illusory Correlation to suggest that treating the problem worsens the underlying condition."
  },
  {
    "id": 130,
    "text": "Using 'Dark Mode' on phones causes depression by reducing the amount of light entering the brain.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim links a software setting ('Dark Mode') to a brain chemistry issue ('reducing... light entering the brain'). It uses a neurological input-output argument.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This headline links a UI preference to a mental health condition. It employs Illusory Correlation, connecting screen brightness settings to chemical imbalances in the brain."
  },
  {
    "id": 131,
    "text": "Drinking cold water after a meal solidifies the oils in the food, leading to heart cancer.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text describes a chemical reaction ('solidifies the oils') leading to a specific disease. It mimics a dietary science explanation.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement creates a false physiological process ('solidifying oils'). It uses Illusory Correlation to link temperature of water to a non-existent disease ('heart cancer')."
  },
  {
    "id": 132,
    "text": "The noise from server farms is causing bees to lose their way and die, threatening agriculture.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline attributes ecological collapse to a specific sensory disruption ('noise... causing bees to lose their way'). It provides a causal mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text blames tech infrastructure sound for ecological collapse. It reflects Illusory Correlation by attributing bee colony collapse to server noise."
  },
  {
    "id": 133,
    "text": "Applying antiperspirant prevents the body from sweating out toxins, causing breast cancer.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion relies on a physiological blockage argument ('prevents... sweating out toxins'). It connects this retention mechanism directly to cancer.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This example links hygiene products to cancer via 'toxin retention.' It uses Illusory Correlation, falsely associating sweat prevention with tumour growth."
  },
  {
    "id": 134,
    "text": "Digital water meters spin faster than analog ones because they measure air bubbles as water.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains a technical flaw in the device: 'measure air bubbles as water.' It uses a mechanical explanation for the billing discrepancy.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline claims a technical flaw in measurement devices. It employs Illusory Correlation to explain higher bills as a result of air measurement rather than usage."
  },
  {
    "id": 135,
    "text": "Eating spicy food causes ulcers by burning a hole in the stomach lining.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim defines the injury mechanism physically ('burning a hole'). It appeals to the reader's understanding of corrosion or physical damage.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement links a sensation (burning spice) to physical damage (ulcers). It uses Illusory Correlation, as ulcers are typically caused by bacteria, not spice itself."
  },
  {
    "id": 136,
    "text": "The magnet in the iPhone 12 stops pacemakers from working if you hold the phone for more than 5 minutes.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline details a specific technical interference ('stops pacemakers') with a time condition ('more than 5 minutes'). It uses precise constraints to sound factual.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text exaggerates the risk of magnetic interference. It uses Illusory Correlation to create a specific, time-based failure scenario that is not accurate."
  },
  {
    "id": 137,
    "text": "Walking on cold floors triggers menstruation cramps immediately.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion links thermal exposure ('cold floors') to an immediate internal reaction. It relies on a physiological cause-and-effect structure.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This headline connects foot temperature to internal pain. It relies on Illusory Correlation, suggesting a direct thermal link between the feet and the uterus."
  },
  {
    "id": 138,
    "text": "Using a VPN slows down your internet because the government inspects every encrypted packet manually.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the network latency through a specific process ('inspects every encrypted packet manually'). It offers a technical reason for the slowness.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example attributes latency to government surveillance. It demonstrates Illusory Correlation by inventing a manual inspection process to explain network slowness."
  },
  {
    "id": 139,
    "text": "Swimming immediately after eating causes cramps and leads to drowning.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim connects a digestive state ('immediately after eating') to a muscular failure ('cramps'). It uses a biological timing argument.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text repeats a classic safety myth. It uses Illusory Correlation to link digestion to muscle failure in water."
  },
  {
    "id": 140,
    "text": "The radiation from airport body scanners alters the DNA of unborn children.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline asserts a specific genetic impact ('alters the DNA') from a specific technology. It appeals to the central route via biological mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This headline links security screening to genetic mutation. It employs Illusory Correlation, attributing severe biological harm to low-level scanning technology."
  },
  {
    "id": 141,
    "text": "Crossing your legs causes varicose veins by cutting off blood circulation completely.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion uses a vascular flow argument ('cutting off blood circulation'). It explains the disease as a result of mechanical constriction.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement connects a sitting posture to vascular disease. It uses Illusory Correlation to blame a common habit for a complex vein condition."
  },
  {
    "id": 142,
    "text": "Using 5G internet heats up the phone battery, which in turn radiates heat into the user's hand, causing arthritis.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text constructs a complex causal chain: 5G -> battery heat -> hand -> arthritis. It uses this step-by-step logic to persuade the reader.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text creates a chain of causality from signal to heat to disease. It reflects Illusory Correlation by linking data speeds to joint inflammation."
  },
  {
    "id": 143,
    "text": "Eating carrots improves night vision effectively enough to see in pitch darkness.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim asserts a specific enhancement of capability ('see in pitch darkness'). It relies on the biological efficacy of the food item.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This example exaggerates the benefit of Vitamin A. It uses Illusory Correlation to turn a nutritional benefit into a superpower (seeing in pitch dark)."
  },
  {
    "id": 144,
    "text": "Deleting files from the Recycle Bin releases digital fragmentation that slows down the processor permanently.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses technical jargon ('releases digital fragmentation') to explain a hardware slowdown. It targets the reader's technical understanding.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline invents a technical consequence for a basic action. It employs Illusory Correlation, linking file deletion to permanent hardware degradation."
  },
  {
    "id": 145,
    "text": "Sleeping in a bra causes breast cancer by restricting lymph flow.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The persuasion relies on a lymphatic system argument ('restricting lymph flow'). It defines the physical mechanism of the disease.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement links clothing habits to cancer. It uses Illusory Correlation to suggest that physical restriction directly causes malignancy."
  },
  {
    "id": 146,
    "text": "Using incognito mode attracts more hackers because it flags the user as suspicious.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text explains the risk via an algorithmic tag ('flags... as suspicious'). It offers a procedural explanation for the increased danger.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text creates a paradox about privacy tools. It demonstrates Illusory Correlation by claiming a privacy feature causes the very security risk it aims to avoid."
  },
  {
    "id": 147,
    "text": "Taking a shower during a thunderstorm electrocutes you because water pipes conduct lightning from the ground up.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline details the conductivity path ('pipes conduct lightning from the ground up'). It uses physics logic to explain the electrocution risk.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "This headline exaggerates the conductivity of plumbing during storms. It uses Illusory Correlation to link showering to inevitable electrocution."
  },
  {
    "id": 148,
    "text": "Smart fridges use cameras to analyse your diet and sell the data to health insurance companies to raise premiums.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The claim outlines a data-monetization process ('analyse diet and sell the data'). It appeals to the logic of corporate surveillance and insurance models.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example attributes a complex conspiracy to an appliance feature. It reflects Illusory Correlation, connecting inventory cameras to insurance fraud."
  },
  {
    "id": 149,
    "text": "Drinking ice water increases the metabolic rate and burns fat instantly.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text asserts a metabolic mechanism ('increases the metabolic rate'). It uses biological terminology to explain the weight loss.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text exaggerates the thermogenic effect of water. It uses Illusory Correlation to frame temperature difference as an instant weight-loss solution."
  },
  {
    "id": 150,
    "text": "Leaving a laptop plugged in after it is fully charged causes the battery to explode within a year.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline provides a specific outcome timeframe ('explode within a year') based on a usage pattern. It uses a cause-and-effect prediction structure.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline creates a specific failure timeline for a common habit. It employs Illusory Correlation, linking overcharging protection (or lack thereof) to guaranteed explosion."
  }
]