[
  {
    "id": 301,
    "text": "Wearing synthetic polyester clothes blocks the skin's pores, preventing toxins from escaping and causing internal cancer.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Central route by proposing a biological mechanism ('blocks the skin's pores', 'preventing toxins'). It triggers the Peripheral route with a high-threat outcome ('causing internal cancer') to induce fear.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims synthetic fabrics cause severe internal disease by blocking a natural process (sweating toxins). It uses Naturalness bias to frame man-made materials as dangerous barriers to biological health."
  },
  {
    "id": 302,
    "text": "Keeping a Tulsi plant near your computer absorbs 100% of the harmful radiation emitted by the CPU.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "It uses the Central route by making a specific technical claim about absorption properties ('absorbs 100% of... radiation'). The Peripheral route is engaged through the absolute '100%' claim and the simple heuristic of a traditional plant acting as a perfect shield.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This promotes a traditional plant as a perfect technological shield. It relies on Naturalness bias to suggest that nature (Tulsi) has an inherent power to neutralise modern technological byproducts."
  },
  {
    "id": 303,
    "text": "Consuming factory-made protein supplements leads to kidney failure, whereas eating soaked almonds builds natural strength safely.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text relies on the Central route by presenting a comparative cause-and-effect argument ('leads to kidney failure' vs 'builds natural strength'). It encourages the reader to weigh the health outcomes of two specific dietary choices.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text contrasts a processed fitness product with a raw food item. It employs Naturalness bias by associating the manufactured option with organ failure and the natural option with safety."
  },
  {
    "id": 304,
    "text": "Digital hearing aids weaken the ear's natural ability to listen, causing total deafness over time.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to explain a physiological process ('weaken the ear's natural ability'). The Peripheral route is activated by the extreme and frightening consequence ('causing total deafness') to provoke an immediate emotional reaction.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline asserts that assistive technology destroys the biology it is meant to aid. It uses Naturalness bias to claim that relying on 'artificial' hearing leads to the loss of 'natural' hearing."
  },
  {
    "id": 305,
    "text": "Brushing with neem twigs balances the body's pH levels, unlike fluoride toothpaste which creates an acidic environment in the mouth.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This headline uses the Central route by employing scientific terminology ('balances pH levels', 'acidic environment'). It attempts to persuade through a technical explanation of how the substances interact with the body.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example elevates a traditional hygiene method over a modern chemical one. It relies on Naturalness bias to claim that the chemical product disrupts the body's natural balance."
  },
  {
    "id": 306,
    "text": "Wi-Fi signals disrupt the growth of house plants, proving they are equally harmful to human children.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is engaged by drawing a logical inference from plants to humans ('disrupt the growth', 'proving they are equally harmful'). The mention of harm to 'human children' acts as a strong emotional trigger for the Peripheral route.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement uses the alleged effect on nature (plants) to infer harm to humans. It reflects Naturalness bias by portraying invisible technology signals as an enemy to all organic life."
  },
  {
    "id": 307,
    "text": "Using a stone mortar and pestle releases essential oils in spices that electric grinders destroy with heat.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by explaining the mechanism of preservation vs. destruction ('releases essential oils', 'destroy with heat'). It appeals to the reader's understanding of food chemistry and processing methods.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text claims manual processing preserves nutritional quality that machines destroy. It uses Naturalness bias to favour the low-tech, traditional method as chemically superior."
  },
  {
    "id": 308,
    "text": "Electric blankets emit electromagnetic fields that scramble the nervous system while you sleep, unlike woollen quilts.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "It uses the Central route to describe a technical interaction ('emit electromagnetic fields', 'scramble the nervous system'). The Peripheral route is triggered by the fear-inducing imagery of the nervous system being 'scrambled' while sleeping.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline contrasts a technological heating solution with a natural one. It employs Naturalness bias to suggest that the electric option actively harms the nervous system."
  },
  {
    "id": 309,
    "text": "Drinking coconut water flushes out all heavy metals from the body, whereas carbonated drinks deposit lead in the bones.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by detailing specific biological actions ('flushes out heavy metals', 'deposit lead'). It persuades by describing the physiological transport of toxins.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The example promotes a natural drink as a detoxifier and a manufactured drink as a toxin. It uses Naturalness bias to claim processed beverages physically contaminate the skeletal system."
  },
  {
    "id": 310,
    "text": "AI-generated art dulls the viewer's creativity, while looking at hand-painted art stimulates the right brain.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by offering a neurological explanation for the effect of art ('dulls... creativity', 'stimulates the right brain'). It appeals to the reader's interest in cognitive function.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text claims computer-generated content harms human cognition. It relies on Naturalness bias to value human-made ('natural') art as biologically stimulating compared to 'artificial' art."
  },
  {
    "id": 311,
    "text": "Home-birthed babies have stronger immune systems because they are not exposed to hospital chemicals immediately.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by constructing a causal argument about environmental exposure ('not exposed to hospital chemicals'). It asks the reader to process the logic of immune system development.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline discourages medical settings for childbirth. It uses Naturalness bias to frame hospitals as chemical hazards and the 'natural' home environment as immunologically superior."
  },
  {
    "id": 312,
    "text": "Smart glasses weaken the eye muscles by doing the focusing work for you, unlike traditional lenses.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The Central route is used to explain the mechanism of physical atrophy ('weaken the eye muscles by doing the focusing work'). It persuades through a logical argument about muscle usage and dependency.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement asserts that advanced technology leads to physical atrophy. It reflects Naturalness bias by suggesting that 'smart' tech makes the body lazy and weak."
  },
  {
    "id": 313,
    "text": "Applying fresh turmeric paste heals cuts instantly, while antiseptic creams kill the skin's natural healing agents.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "It uses the Central route to describe the biological interaction ('kill the skin's natural healing agents'). The Peripheral route is engaged by the promise of 'instantly' healing, which acts as a miraculous cue.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text promotes a herbal remedy while claiming modern medicine interferes with biology. It uses Naturalness bias to suggest chemicals hinder the body's natural recovery process."
  },
  {
    "id": 314,
    "text": "Virtual reality headsets disconnect the pineal gland from the earth's magnetic core, causing spiritual depression.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by presenting a pseudo-scientific mechanism ('disconnects the pineal gland', 'magnetic core'). It attempts to ground spiritual depression in a technical/biological cause.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example attributes spiritual and mental harm to VR technology. It uses Naturalness bias to claim that technology breaks a vital, natural connection to the Earth."
  },
  {
    "id": 315,
    "text": "Eating with wooden spoons improves digestion, as metal spoons react with food acids to create toxins.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This relies on the Central route by explaining a chemical reaction ('react with food acids to create toxins'). It appeals to the reader's concern about chemical safety in cookware.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims natural materials (wood) are safe while metals create poison. It relies on Naturalness bias to demonise standard metal cutlery."
  },
  {
    "id": 316,
    "text": "5G towers emit a frequency that boils the water inside brain cells, whereas trees cool the environment.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is engaged by describing a physical effect of frequency ('boils the water inside brain cells'). The Peripheral route is heavily used through the violent and terrifying imagery of boiling brain cells.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement uses a violent imagery ('boils water') for technology. It contrasts this with the benign nature of trees, using Naturalness bias to frame 5G as an unnatural thermal threat."
  },
  {
    "id": 317,
    "text": "Using a clay water filter preserves minerals, while RO purifiers produce 'dead water' that leaches calcium from bones.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text uses the Central route to explain nutritional chemistry ('preserves minerals', 'leaches calcium'). The phrase 'dead water' acts as a Peripheral emotional cue to evoke disgust and fear.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text attacks modern filtration for removing 'life' from water. It employs Naturalness bias to claim that technologically purified water is physically harmful ('dead')."
  },
  {
    "id": 318,
    "text": "Bluetooth radiation penetrates the skull barrier, unlike wired headphones which keep the signal outside the body.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It employs the Central route by describing the physical penetration of signals ('penetrates the skull barrier'). It persuades by contrasting the spatial safety of wired vs. wireless technology.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example claims wireless signals breach biological barriers. It uses Naturalness bias to imply that physical wires provide a safety distance that wireless tech ignores."
  },
  {
    "id": 319,
    "text": "Organic cotton clothes allow the skin to breathe prana, while synthetic fabrics suffocate the soul.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route to propose a metaphysical mechanism ('allow the skin to breathe prana', 'suffocate the soul'). It treats spiritual energy as a biological substance that can be blocked.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline links fabric type to spiritual energy ('prana'). It relies on Naturalness bias to claim that natural fibres support life force while synthetics suppress it."
  },
  {
    "id": 320,
    "text": "Digital currency wallets drain your personal energy field, while holding physical gold recharges it.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This relies on the Central route by explaining the interaction between asset types and personal energy ('drain your personal energy field'). It frames the financial choice as a functional energy management issue.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text attributes metaphysical properties to financial formats. It uses Naturalness bias to value tangible, natural assets (gold) over intangible, digital ones."
  },
  {
    "id": 321,
    "text": "Cow milk is only healthy if milked by hand; machine-milking introduces stress hormones into the milk.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by identifying a specific contaminant and its source ('introduces stress hormones'). It appeals to the reader's concern about hormonal purity in food.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement claims the method of extraction alters the chemical safety of milk. It reflects Naturalness bias, assuming mechanical interaction contaminates the natural product."
  },
  {
    "id": 322,
    "text": "GPS navigation weakens your natural sense of direction by deactivating the brain's internal compass.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route to explain a cognitive decline ('deactivating the brain's internal compass'). It persuades by proposing a direct neurological consequence of using the technology.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This headline asserts that relying on tech causes biological regression. It uses Naturalness bias to suggest that the 'natural' skill is lost when technology is used."
  },
  {
    "id": 323,
    "text": "Washing hair with reetha (soapnut) prevents grey hair, while chemical shampoos strip the melanin pigment.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline employs the Central route by describing the chemical action of the products ('strip the melanin pigment'). It asks the reader to consider the biological mechanism of hair greying.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The example promotes a natural berry for hair care over modern products. It employs Naturalness bias to claim that chemicals actively remove natural colour."
  },
  {
    "id": 324,
    "text": "Online learning platforms stunt social development, whereas learning under a tree expands the consciousness.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by making specific claims about developmental psychology ('stunt social development', 'expands the consciousness'). It contrasts the cognitive outcomes of two learning environments.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text contrasts digital education with nature-based learning. It relies on Naturalness bias to claim that the natural setting has a unique power to expand the mind."
  },
  {
    "id": 325,
    "text": "Eating with your fingers stimulates digestion via nerve endings, while using a fork confuses the stomach.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text relies on the Central route by proposing a physiological link ('stimulates digestion via nerve endings'). It attempts to validate a tradition through a biological explanation.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims a biological link between fingertips and digestion. It uses Naturalness bias to frame the traditional eating method as scientifically superior."
  },
  {
    "id": 326,
    "text": "Artificial lighting at night tricks the liver into storing fat, unlike the natural darkness which burns it.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route to describe a metabolic trigger ('tricks the liver into storing fat'). It persuades by linking environmental lighting to internal organ function.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement links light bulbs to metabolic dysfunction. It uses Naturalness bias to suggest that artificial environments disrupt natural bodily functions."
  },
  {
    "id": 327,
    "text": "Consuming rock salt cures thyroid problems naturally, whereas iodised salt is chemically bleached and toxic.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by detailing the chemical processing involved ('chemically bleached and toxic'). It appeals to the reader's knowledge of industrial food processing.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This promotes unrefined salt while demonising the fortified version. It employs Naturalness bias, viewing the industrial processing of salt as toxin-adding."
  },
  {
    "id": 328,
    "text": "Using a stylus on a screen blocks the flow of creative energy, which only flows through a wooden pencil.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This employs the Central route by explaining the conductivity of creative energy ('blocks the flow', 'flows through'). It treats creativity as a substance governed by the physics of the tool's material.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text attributes creative flow to the material of the tool. It relies on Naturalness bias to claim wood conducts energy while plastic/digital tools block it."
  },
  {
    "id": 329,
    "text": "Walking barefoot on soil draws out inflammation from the body, whereas walking on concrete traps heat inside.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by describing a thermal and anti-inflammatory mechanism ('draws out inflammation', 'traps heat'). It persuades through physical interaction with materials.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims direct earth contact is anti-inflammatory. It uses Naturalness bias to frame modern paving materials as unhealthy for the body's thermal regulation."
  },
  {
    "id": 330,
    "text": "Robotic vacuum cleaners emit dust particles that trigger asthma, unlike natural broom sweeping.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It relies on the Central route by identifying a specific respiratory hazard ('emit dust particles'). It creates a logical link between the machine's operation and a health condition.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example asserts automation creates health hazards. It uses Naturalness bias to suggest the manual, traditional way of cleaning is safer for lungs."
  },
  {
    "id": 331,
    "text": "Ayurvedic herbs can regenerate damaged kidneys, while dialysis machines only weaken them further.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to compare treatment outcomes ('regenerate... kidneys' vs 'weaken'). The Peripheral route is engaged by the promise of 'regenerating' an organ, which acts as a miracle cure cue.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement claims herbal remedies can regrow organs. It employs Naturalness bias to portray modern life-support technology as destructive."
  },
  {
    "id": 332,
    "text": "Cloud storage services use magnetic tapes that drain the energy of the data owner, unlike physical paper files.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by offering a technical explanation for the harm ('use magnetic tapes that drain energy'). It connects data storage technology to personal vitality.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text links digital storage to personal energy loss. It reflects Naturalness bias by viewing the tangible (paper) as neutral and the digital as parasitic."
  },
  {
    "id": 333,
    "text": "Cooking in a solar cooker infuses food with Vitamin D, while gas stoves destroy all vitamins.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This employs the Central route by describing nutritional changes caused by the energy source ('infuses food with Vitamin D', 'destroy all vitamins'). It treats cooking as a nutrient-transfer process.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims solar energy adds nutrients to food. It uses Naturalness bias to favour the 'natural' energy source (sun) over the fossil fuel source."
  },
  {
    "id": 334,
    "text": "Applying cow dung to the walls of a house blocks Wi-Fi radiation from entering.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text uses the Central route by proposing a physical shielding property of the material ('blocks Wi-Fi radiation'). It appeals to the reader's understanding of radiation barriers.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This promotes a traditional material as a high-tech shield. It relies on Naturalness bias to attribute protective properties to organic matter against technology."
  },
  {
    "id": 335,
    "text": "Eating seasonal fruits aligns your DNA with the planet's rhythm, preventing cancer, unlike imported fruits.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It relies on the Central route by explaining a genetic mechanism ('aligns your DNA with the planet's rhythm'). It attempts to ground health benefits in a pseudo-scientific synchronization process.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The example links diet to genetic alignment with the planet. It uses Naturalness bias to claim that 'natural' local eating prevents disease via metaphysical synchronization."
  },
  {
    "id": 336,
    "text": "Earthing sheets plug into the wall ground port to neutralise bodily toxins, unlike sleeping on synthetic sheets.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline uses the Central route by describing the technical function of the device ('plug into the wall ground port to neutralise... toxins'). It persuades via electrical grounding logic.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text promotes a pseudo-scientific device based on 'grounding'. It employs Naturalness bias to suggest that electrical contact with the earth removes biological toxins."
  },
  {
    "id": 337,
    "text": "Drinking water from a copper vessel kills all viruses instantly, making vaccines redundant.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to claim a specific antimicrobial property ('kills all viruses'). The Peripheral route is strongly triggered by the absolute 'instantly' and the bold claim of making vaccines 'redundant'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline elevates a traditional storage method to a total cure. It uses Naturalness bias to suggest simple natural properties trump complex medical science."
  },
  {
    "id": 338,
    "text": "Using biometric fingerprint locks changes the ridge patterns on your fingers over time, erasing your identity.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Central route by describing physical changes to the body ('changes the ridge patterns'). The Peripheral route is engaged by the high-stakes threat of 'erasing your identity'.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement claims digital scanning physically alters the body. It reflects Naturalness bias by suggesting that interaction with technology degrades natural physical traits."
  },
  {
    "id": 339,
    "text": "Mustard oil massage strengthens the heart valves, while refined oils stiffen the arteries.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by distinguishing the physiological effects of different oils ('strengthens the heart valves', 'stiffen the arteries'). It appeals to cardiovascular mechanics.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example distinguishes between traditional and refined oils. It uses Naturalness bias to attribute healing properties to the 'natural' oil and damaging ones to the processed oil."
  },
  {
    "id": 340,
    "text": "Looking at the moon restores eyesight damaged by screens, as lunar light is the antidote to blue light.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by proposing a counter-acting mechanism ('antidote to blue light'). It treats light sources as chemically or physically opposing forces.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text claims natural light reverses technological damage. It relies on Naturalness bias to frame nature (the moon) as the healer of technology's harm."
  },
  {
    "id": 341,
    "text": "Hand-churned buttermilk contains live enzymes that digest fat, while machine-processed buttermilk adds weight.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by citing a biochemical agent ('contains live enzymes that digest fat'). It explains the health benefit through the presence of active biological components.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims the processing method changes the caloric effect. It employs Naturalness bias, favouring the manual method as healthy and the machine method as fattening."
  },
  {
    "id": 342,
    "text": "Using a keyboard causes the fingertips to lose sensitivity, whereas writing with a pen enhances touch receptors.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by explaining the impact on sensory nerves ('lose sensitivity', 'enhances touch receptors'). It links the physical activity of writing to neurological health.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement asserts that digital input dulls the senses. It uses Naturalness bias to suggest that traditional writing tools maintain biological function."
  },
  {
    "id": 343,
    "text": "Sleeping on the floor aligns the spine with gravity naturally, curing slip discs without surgery.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to describe a biomechanical correction ('aligns the spine with gravity'). The Peripheral route is activated by the promise of 'curing... without surgery', appealing to the desire for easy solutions.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example promotes a simple lifestyle change as a surgical alternative. It uses Naturalness bias to claim that returning to a 'natural' sleeping surface cures complex orthopaedic issues."
  },
  {
    "id": 344,
    "text": "Electric cars emit a magnetic field that thickens the blood of the driver, causing clots.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by describing a specific biological reaction to technology ('magnetic field... thickens the blood'). It persuades by detailing how the field affects blood viscosity.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text alleges invisible harm from EV technology. It reflects Naturalness bias by suggesting that modern propulsion systems interact dangerously with human biology."
  },
  {
    "id": 345,
    "text": "Eating jaggery after meals cleanses the blood of pollutants, unlike sugar which adds toxins.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by explaining a detoxification process ('cleanses the blood', 'adds toxins'). It compares the chemical impact of two types of sugar.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline positions unrefined sugar as a blood cleanser. It relies on Naturalness bias to contrast the 'detoxifying' natural sweet with the 'toxic' processed one."
  },
  {
    "id": 346,
    "text": "Using noise-cancelling headphones disconnects you from the earth's natural frequency, causing anxiety.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by proposing a vibrational mechanism ('disconnects you from the earth's natural frequency'). It links mental health to the loss of a physical connection.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement claims blocking ambient sound is psychologically harmful. It uses Naturalness bias to imply a necessary connection to 'earth's frequency' that technology severs."
  },
  {
    "id": 347,
    "text": "Washing clothes with chemical detergent leaves residue that enters the pores and causes liver damage.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by describing the absorption pathway ('residue that enters the pores'). It explains liver damage as a direct result of transdermal chemical absorption.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "This example attacks modern cleaning products. It employs Naturalness bias to suggest that chemical residues on skin are absorbed directly into internal organs."
  },
  {
    "id": 348,
    "text": "Video games rewire the brain to be aggressive, whereas playing with wooden blocks fosters peace.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by making a neurological claim ('rewire the brain'). It attempts to explain behavioral changes through structural changes in the brain.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The text contrasts digital play with traditional play. It uses Naturalness bias to attribute moral and psychological outcomes to the material of the toys."
  },
  {
    "id": 349,
    "text": "Applying coconut oil acts as a 100% effective sunscreen without the carcinogenic chemicals of commercial lotions.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to compare chemical compositions ('without the carcinogenic chemicals'). The Peripheral route is engaged by the absolute claim '100% effective' which acts as a definitive heuristic.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The headline claims a natural oil is a perfect substitute for engineered UV protection. It relies on Naturalness bias to demonise the 'chemicals' in sunscreen."
  },
  {
    "id": 350,
    "text": "Smart watches interfere with the body's pulse, giving false readings to force you to buy medication.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Central route by describing technical interference ('interfere with the body's pulse'). The Peripheral route is triggered by the conspiratorial motive ('force you to buy medication') which evokes distrust.",
    "framework2_feature1": 1,
    "framework2_feature2": 0,
    "framework2_feature3": 0,
    "rationale2": "The statement alleges a conspiracy within health tech. It uses Naturalness bias to distrust the digital measurement in favour of unmediated bodily awareness."
  },
  {
    "id": 351,
    "text": "Social media is flooded with posts about young people dying, proving that the new flu strain is fatal for everyone.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This headline relies entirely on the Peripheral route by using social proof and volume ('flooded with posts') to induce fear. It offers no biological or technical explanation for the lethality.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "This headline uses the volume of social media posts to determine lethality. It uses Availability bias, mistaking the visibility of tragic stories for a universal mortality rate."
  },
  {
    "id": 352,
    "text": "Every time you open the news there is a crypto scam, meaning all digital currency is theft.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It uses the Peripheral route by generalizing from the frequency of news ('Every time you open the news'). It relies on the availability heuristic rather than analyzing the technology itself.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text generalizes from frequent news reports to the entire industry. It employs Availability bias to label the whole technology as 'theft' based on visible scams."
  },
  {
    "id": 353,
    "text": "Everyone is complaining of back pain, which confirms that office chairs are designed to destroy spines.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by citing general complaints ('Everyone is complaining') as proof. It appeals to consensus and shared experience rather than ergonomic evidence.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement uses common complaints to allege malicious design. It relies on Availability bias to blame a specific product for a widespread lifestyle issue."
  },
  {
    "id": 354,
    "text": "Viral videos of EVs burning up prove that electric cars are unsafe for Indian roads.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This relies on the Peripheral route by pointing to spectacular visual evidence ('Viral videos'). It uses the availability of these dramatic images to prove a general safety claim without technical data.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline cites 'viral videos' as conclusive evidence. It uses Availability bias, allowing spectacular, rare failures to define the safety of the entire category."
  },
  {
    "id": 355,
    "text": "With so many people wearing glasses, it is obvious that online classes have ruined the eyesight of an entire generation.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by making a broad observation ('With so many people wearing glasses'). It relies on a visible trend to assert a cause, skipping logical proof.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text links the prevalence of glasses to a specific cause. It reflects Availability bias by attributing a complex health trend solely to a recent technological shift."
  },
  {
    "id": 356,
    "text": "Constant reports of UPI server downtime mean the digital payment system has collapsed completely.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It uses the Peripheral route by interpreting 'Constant reports' as total collapse. It appeals to the reader's frustration and the frequency of bad news.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example interprets maintenance reports as total collapse. It uses Availability bias to exaggerate technical glitches into a systemic failure."
  },
  {
    "id": 357,
    "text": "You hear about heart attacks every day now, so it must be the preservatives in packet food killing us.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by citing the frequency of information ('hear about heart attacks every day'). It connects this availability of news to a fear of preservatives without a biological link.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses the frequency of hearing bad news to blame food. It demonstrates Availability bias by connecting a visible health outcome to a common dietary scapegoat."
  },
  {
    "id": 358,
    "text": "The sheer number of phishing SMSs shows that mobile networks have sold all our numbers to hackers.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This relies on the Peripheral route by using the volume of annoyance ('sheer number of phishing SMSs') to infer a conspiracy. It bypasses technical evidence of how data is leaked.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text infers a data sale from the volume of spam. It uses Availability bias to claim corporate malice as the only explanation for high spam frequency."
  },
  {
    "id": 359,
    "text": "Seeing so many children with ADHD proves that mobile games are rewiring their brains permanently.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by citing visual prevalence ('Seeing so many children'). It uses this observation to support a claim about brain rewiring without neurological evidence.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement links a diagnostic trend to gaming. It relies on Availability bias to blame a visible behavioral change on a specific technology."
  },
  {
    "id": 360,
    "text": "Everyone knows someone who got hacked, proving that two-factor authentication is useless.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It uses the Peripheral route by relying on anecdotal evidence ('Everyone knows someone'). It dismisses technical security protocols based on social circle experiences.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses anecdotal evidence to dismiss security protocols. It employs Availability bias, assuming that because hacks still happen, the protection doesn't work."
  },
  {
    "id": 361,
    "text": "There are so many pharmacies now, which means doctors are keeping us sick to sell medicines.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by interpreting visual density ('so many pharmacies') as proof of a conspiracy. It relies on a cynical heuristic about the healthcare industry.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses the visibility of pharmacies to allege a conspiracy. It uses Availability bias to interpret the availability of healthcare as proof of a sickness racket."
  },
  {
    "id": 362,
    "text": "News of drones peeping into windows is everywhere, so privacy is a thing of the past.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This relies on the Peripheral route by citing media saturation ('News... is everywhere'). It uses the feeling of being surrounded by these stories to declare privacy dead.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example uses media saturation to declare the end of privacy. It reflects Availability bias by assuming the threat is omnipresent because the news is."
  },
  {
    "id": 363,
    "text": "Every second person is lactose intolerant, showing that milk is now just white paint and chemicals.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by exaggerating social prevalence ('Every second person'). It uses this hyperbole to support a conspiracy theory about food adulteration.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline exaggerates intolerance rates to claim adulteration. It uses Availability bias to explain a digestive issue with a dramatic conspiracy about food quality."
  },
  {
    "id": 364,
    "text": "Frequent glitches in Zoom calls prove that the internet infrastructure in India is failing.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It uses the Peripheral route by generalizing from specific annoyances ('Frequent glitches'). It allows the emotional frustration of dropped calls to define the state of national infrastructure.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement uses specific app glitches to condemn national infrastructure. It demonstrates Availability bias by generalizing minor local errors to a country-wide failure."
  },
  {
    "id": 365,
    "text": "All my friends have hair fall, which confirms that the city water is full of acid.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by relying on peer group consensus ('All my friends'). It validates a chemical claim based solely on social confirmation.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses a personal circle's experience to judge water quality. It relies on Availability bias to attribute a common cosmetic issue to severe contamination."
  },
  {
    "id": 366,
    "text": "The daily news about AI taking jobs means human employment will end in 5 years.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This relies on the Peripheral route by using urgency and media frequency ('Daily news', 'end in 5 years'). It creates fear through a time-bound catastrophic prediction.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example extrapolates news trends to a catastrophic prediction. It uses Availability bias to foresee a total end to employment based on current headlines."
  },
  {
    "id": 367,
    "text": "Everyone has a vitamin deficiency these days, proving that vegetables no longer contain nutrients.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by making a universal generalization ('Everyone has'). It relies on the reader's acceptance of this common sentiment to discredit food quality.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline claims universal deficiency to discredit agriculture. It employs Availability bias, assuming food is empty because diagnoses are common."
  },
  {
    "id": 368,
    "text": "You see 5G towers on every roof, which explains why headaches have become so common.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It uses the Peripheral route by linking a symptom to a visual cue ('see 5G towers on every roof'). It relies on the immediate visibility of the infrastructure to explain the health issue.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement links the visual density of towers to a symptom. It uses Availability bias to validatethe headache claim based on the visibility of the infrastructure."
  },
  {
    "id": 369,
    "text": "With so many people getting kidney stones, it is clear that RO water is unsafe.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by citing the number of sufferers ('so many people'). It assumes causation based purely on the prevalence of the condition.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text blames water filters for a health surge. It reflects Availability bias by connecting a common appliance to a rising health complaint without evidence."
  },
  {
    "id": 370,
    "text": "Constant app updates on your phone prove that software companies are mining data in the background.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This relies on the Peripheral route by interpreting a nuisance ('Constant app updates') as malicious. It uses the frequency of the annoyance to prove data theft.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline explains technical maintenance as malicious activity. It uses Availability bias to interpret the annoyance of updates as proof of theft."
  },
  {
    "id": 371,
    "text": "Every child is obese now, which shows that fast food chains are putting addictive drugs in burgers.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by exaggerating a trend ('Every child is obese'). It uses this dramatic generalization to support a conspiracy about drugs in food.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example uses obesity rates to allege drugging. It relies on Availability bias to explain a lifestyle trend with a criminal conspiracy."
  },
  {
    "id": 372,
    "text": "There are so many fake profiles on Facebook that the platform is now run entirely by bots.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It uses the Peripheral route by relying on the visibility of spam ('so many fake profiles'). It uses this surface cue to make a sweeping claim about the platform's user base.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text exaggerates the bot problem to invalidate the platform. It uses Availability bias to claim humans have left the platform based on spam visibility."
  },
  {
    "id": 373,
    "text": "Hearing about young athletes collapsing proves that high-intensity cardio is dangerous for the heart.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by focusing on dramatic anecdotes ('Hearing about young athletes'). It uses the shock value of these rare events to condemn a form of exercise.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses ironic tragedies to condemn exercise. It demonstrates Availability bias by letting rare events outweigh the proven benefits of cardio."
  },
  {
    "id": 374,
    "text": "Everyone I know gets spam calls, meaning the Do Not Disturb registry is a scam.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This relies on the Peripheral route by validating a claim through personal network experience ('Everyone I know'). It dismisses regulation based on anecdotal failure.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement dismisses regulation based on personal experience. It uses Availability bias to call the registry a scam because it isn't 100% effective in their circle."
  },
  {
    "id": 375,
    "text": "Since everyone is getting diabetes, it is obvious that white rice is actually sugar in disguise.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by citing disease prevalence ('Since everyone is getting diabetes'). It relies on the 'obviousness' of the link rather than nutritional science.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text attacks a staple food using disease prevalence. It employs Availability bias to equate a complex carbohydrate with pure sugar based on diabetes rates."
  },
  {
    "id": 376,
    "text": "Reports of smart home devices recording conversations are endless, so having Alexa is like inviting a spy.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It uses the Peripheral route by emphasizing the volume of hearsay ('Reports... are endless'). It frames the device as a 'spy' based on the saturation of these rumors.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example uses 'endless reports' to frame a device as a spy. It uses Availability bias to exaggerate the privacy risk to a certainty."
  },
  {
    "id": 377,
    "text": "You see grey hair everywhere, proving that pollution is aging us prematurely.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by linking a common visual observation ('see grey hair everywhere') to an environmental cause. It skips biological proof in favor of visual availability.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline uses a visible sign of aging to blame pollution. It relies on Availability bias to connect environmental factors to cosmetic changes without proof."
  },
  {
    "id": 378,
    "text": "With so many bank frauds reported, keeping money in a digital wallet is asking to be robbed.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This relies on the Peripheral route by using fear generated by news reports ('so many bank frauds reported'). It frames a financial technology as inherently dangerous based on headline volume.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement discourages digital finance based on fraud news. It uses Availability bias to frame the risk as an inevitability."
  },
  {
    "id": 379,
    "text": "Everyone has thyroid issues, which confirms that non-stick pans are leaking chemicals into food.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by asserting a universal condition ('Everyone has thyroid issues'). It uses this exaggeration to cast blame on a common household item.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text links a specific condition to cookware. It employs Availability bias to blame a ubiquitous kitchen item for a common health issue."
  },
  {
    "id": 380,
    "text": "Viral videos of deepfakes prove that video evidence can no longer be trusted in court.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It uses the Peripheral route by pointing to 'Viral videos' as proof. It relies on the spectacular nature of deepfakes to dismiss the validity of all video evidence.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example claims legal evidence is obsolete due to tech. It uses Availability bias to suggest that because deepfakes exist, all video is now suspect."
  },
  {
    "id": 381,
    "text": "The sheer number of people with insomnia shows that blue light from phones has destroyed our sleep cycles.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by citing the 'sheer number' of sufferers. It connects this large number to a specific cause (blue light) without explaining the mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline blames phones for a sleep epidemic. It reflects Availability bias, pinpointing a single technological cause for a complex lifestyle problem."
  },
  {
    "id": 382,
    "text": "Frequent data breaches at big companies mean that your personal data is already sold on the dark web.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This relies on the Peripheral route by using the frequency of news ('Frequent data breaches') to create a sense of inevitability. It assumes personal impact based on general trends.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement assumes total compromise from news of breaches. It uses Availability bias to claim certainty of data theft for everyone."
  },
  {
    "id": 383,
    "text": "Everyone is allergic to gluten now, proving that wheat has been genetically modified to be toxic.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by appealing to a bandwagon perception ('Everyone is allergic'). It uses this perceived consensus to attack GMOs.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text uses perceived allergy rates to attack wheat. It uses Availability bias to blame genetic modification for dietary sensitivities."
  },
  {
    "id": 384,
    "text": "You hear about EV batteries exploding constantly, meaning the technology is fundamentally unstable.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It uses the Peripheral route by relying on the repetition of news ('Hear about... constantly'). It uses this frequency to judge the fundamental stability of the technology.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example uses explosion reports to condemn EVs. It demonstrates Availability bias by framing a developing technology as 'fundamentally unstable' due to accidents."
  },
  {
    "id": 385,
    "text": "Seeing so many people with cancer implies that microwaves are leaking radiation into our homes.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by linking visual prevalence ('Seeing so many people') to an appliance. It relies on a correlation heuristic to revive a fear of radiation.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline links cancer prevalence to microwaves. It uses Availability bias to revive an old fear about kitchen appliances based on disease visibility."
  },
  {
    "id": 386,
    "text": "The news is full of cyberbullying stories, proving that social media is unsafe for children.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This relies on the Peripheral route by citing media fullness ('news is full'). It allows the saturation of negative stories to define the safety of the entire platform.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement declares social media unsafe based on news volume. It uses Availability bias to generalize the risk of bullying to the entire platform experience."
  },
  {
    "id": 387,
    "text": "Everyone has joint pain, which shows that standing on marble floors is unnatural for humans.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by claiming universal suffering ('Everyone has joint pain'). It uses this generalization to find a simple environmental scapegoat.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text blames flooring material for joint pain. It employs Availability bias to find an environmental cause for a common ailment."
  },
  {
    "id": 388,
    "text": "Daily reports of WhatsApp scams prove that the app has no security features enabled.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It uses the Peripheral route by equating 'Daily reports' of scams with a lack of software security. It ignores technical details in favor of scam frequency.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example claims zero security due to scams. It uses Availability bias to conflate user-targeted scams with a lack of app-level security."
  },
  {
    "id": 389,
    "text": "Since everyone is getting spectacles, it is clear that LED streetlights are damaging our eyes.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by using a common observation ('Since everyone is getting spectacles'). It links this visible trend to streetlights without optical evidence.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline attacks public infrastructure. It uses Availability bias to link the commonality of vision correction to a specific type of lighting."
  },
  {
    "id": 390,
    "text": "Viral videos of robots malfunctioning prove that AI will never be able to work safely.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This relies on the Peripheral route by mocking the technology via 'Viral videos'. It uses humor and ridicule to dismiss the future potential of AI.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement uses fail videos to dismiss AI. It uses Availability bias to judge the future potential of a technology based on current humorous failures."
  },
  {
    "id": 391,
    "text": "Everyone I know feels tired, so the oxygen levels in the city must have dropped significantly.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by relying on the feelings of a social circle ('Everyone I know feels tired'). It infers a major atmospheric change from personal anecdotes.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text explains general fatigue with environmental collapse. It relies on Availability bias to attribute a feeling to a drastic atmospheric change."
  },
  {
    "id": 392,
    "text": "With so many apps asking for location, it is certain the government is building a map of your daily movements.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It uses the Peripheral route by interpreting a common prompt ('So many apps') as certainty of surveillance. It relies on paranoia triggered by frequency.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example uses permission prompts to infer surveillance. It uses Availability bias to jump from app permissions to government tracking."
  },
  {
    "id": 393,
    "text": "All the kids have cavities now, proving that toothpaste actually destroys enamel.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by generalizing a health issue ('All the kids have cavities'). It uses this to create a conspiracy about a preventative product.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline reverses the function of toothpaste. It uses Availability bias to blame the preventative product for the problem it fights."
  },
  {
    "id": 394,
    "text": "Constant news about flight delays proves that the air traffic control system has been hacked.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This relies on the Peripheral route by using the 'Constant news' of delays to infer a hack. It jumps to a malicious conclusion based on the frequency of logistical problems.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement explains logistic delays with cyberwarfare. It demonstrates Availability bias by assuming a malicious cause for routine operational issues."
  },
  {
    "id": 395,
    "text": "Everyone is getting skin rashes, meaning the new laundry detergents are toxic.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by claiming a universal reaction ('Everyone is getting skin rashes'). It uses this exaggeration to blame a product.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text links rashes to detergent. It uses Availability bias to blame a household chemical for a perceived skin health trend."
  },
  {
    "id": 396,
    "text": "There are so many influencers selling crypto, which proves it is a pyramid scheme.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It uses the Peripheral route by focusing on the messenger ('so many influencers'). It judges the financial asset based on the behavior/volume of people selling it.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example uses marketing volume to judge validity. It uses Availability bias to label the asset class as a scam based on the behavior of its promoters."
  },
  {
    "id": 397,
    "text": "Seeing so many people with depression proves that social media is poisoning our minds.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by using observational frequency ('Seeing so many people'). It simplifies a complex mental health issue into a direct consequence of media use.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The headline blames social media for mental health issues. It reflects Availability bias, attributing a complex psychological condition solely to platform usage."
  },
  {
    "id": 398,
    "text": "Every time you update Windows, your computer gets slower, proving forced obsolescence.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "This relies on the Peripheral route by using personal frustration ('Every time you update') as proof. It attributes malicious intent to the user experience of slowness.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The statement interprets performance drops as conspiracy. It uses Availability bias to claim companies deliberately break devices via updates."
  },
  {
    "id": 399,
    "text": "Everyone has gastric issues, which shows that pressure cookers make food poisonous.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Peripheral route by asserting a universal ailment ('Everyone has gastric issues'). It uses this broad claim to attack a specific cooking tool.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The text attacks a cooking method. It employs Availability bias to link common digestive problems to a specific appliance."
  },
  {
    "id": 400,
    "text": "The endless calls from credit card companies mean they are desperate because the economy is collapsing.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It uses the Peripheral route by interpreting the annoyance of 'endless calls' as an economic indicator. It relies on urgency and nuisance to predict a collapse.",
    "framework2_feature1": 0,
    "framework2_feature2": 1,
    "framework2_feature3": 0,
    "rationale2": "The example uses telemarketing frequency to predict economic doom. It uses Availability bias to infer a macro-economic crash from annoying sales calls."
  },
  {
    "id": 401,
    "text": "Charging your phone while talking on it causes the battery to explode instantly.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text relies on the Peripheral route by creating an immediate, high-threat scenario ('explode instantly'). It bypasses any technical explanation in favor of shock value.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline links two safe actions to a catastrophic result. It uses Illusory Correlation to create a fear of combining charging and calling."
  },
  {
    "id": 402,
    "text": "Drinking green tea burns belly fat immediately upon consumption.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The headline uses the Central route by claiming a specific metabolic action ('burns belly fat'). The Peripheral route is engaged by the promise of 'immediately', acting as a miracle cue.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text exaggerates the metabolic effect of tea. It relies on Illusory Correlation to claim instant, localized fat burning."
  },
  {
    "id": 403,
    "text": "Setting your phone brightness to maximum causes migraines within 5 minutes.",
    "topic": "technology",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "It uses the Peripheral route by linking a setting to severe pain within a short timeframe ('migraines within 5 minutes'). The urgency and pain act as strong emotional triggers.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement links screen settings to severe pain. It employs Illusory Correlation, creating a specific time-bound cause for migraines."
  },
  {
    "id": 404,
    "text": "Sleeping with your head facing West causes nightmares and disturbed sleep.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by using a superstitious/directional cue ('head facing West'). It relies on traditional heuristics rather than a biological mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example connects compass direction to dream quality. It uses Illusory Correlation to link Earth's magnetic field to the content of dreams."
  },
  {
    "id": 405,
    "text": "Leaving Bluetooth on drains your spinal fluid due to signal frequency.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by proposing a specific biological consequence of a technical feature ('drains your spinal fluid', 'signal frequency'). It fabricates a physiological interaction.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline invents a horrific biological interaction. It demonstrates Illusory Correlation by linking a radio signal to the loss of bodily fluids."
  },
  {
    "id": 406,
    "text": "Swallowing fruit seeds causes appendicitis by getting stuck in the organ.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by explaining the mechanical cause of the condition ('getting stuck in the organ'). It appeals to a physical understanding of anatomy.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text repeats a medical myth. It uses Illusory Correlation to claim that small seeds are the primary cause of appendix inflammation."
  },
  {
    "id": 407,
    "text": "Using incognito mode prevents your internet provider from seeing your history.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by describing the technical function of a browser feature ('prevents your internet provider from seeing'). It makes a claim about data visibility.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement misunderstands privacy features. It reflects Illusory Correlation, assuming browser privacy equals network-level invisibility."
  },
  {
    "id": 408,
    "text": "Eating hair causes it to wrap around the heart and stop it beating.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is engaged by describing a mechanical action inside the body ('wrap around the heart'). The Peripheral route is used through the gruesome and lethal imagery ('stop it beating').",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example creates a fatal scenario from accidental ingestion. It uses Illusory Correlation to invent a pathway from the stomach to the heart."
  },
  {
    "id": 409,
    "text": "Overcharging your phone makes the software slower to prevent overheating.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by offering a technical justification for the performance drop ('prevent overheating'). It explains the software behavior as a safety mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline links battery habits to software lag. It uses Illusory Correlation to explain slow performance as a deliberate safety feature triggered by charging."
  },
  {
    "id": 410,
    "text": "Shaving your legs makes the hair grow back black and thick.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by making a biological claim about hair growth ('grow back black and thick'). It suggests the act of shaving alters the physical properties of the hair.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text connects grooming to biological changes. It uses Illusory Correlation, mistaking the blunt tip of cut hair for a change in texture and colour."
  },
  {
    "id": 411,
    "text": "Typing 'BFF' on Facebook checks if your account is secure; if it turns green, you are safe.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "It uses the Central route by describing a verification process ('checks if your account is secure'). The Peripheral route is triggered by the visual cue ('turns green') which acts as a simple safety signal.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement promotes a viral hoax. It employs Illusory Correlation, linking a text animation feature to account security status."
  },
  {
    "id": 412,
    "text": "Drinking water while walking causes it to enter the lungs instead of the stomach.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by describing an anatomical error ('enter the lungs instead of the stomach'). It explains the harm through a failure of the swallowing mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example claims movement misdirects swallowing. It uses Illusory Correlation to suggest basic anatomy fails if the person is moving."
  },
  {
    "id": 413,
    "text": "Using a laptop on your lap cooks the sperm and causes permanent infertility.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to explain the thermal damage ('cooks the sperm'). The Peripheral route is engaged by the high-threat, permanent consequence ('permanent infertility').",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exaggerates thermal effects. It relies on Illusory Correlation to claim that laptop heat causes irreversible sterilization."
  },
  {
    "id": 414,
    "text": "Cracking your knuckles causes arthritis by creating air bubbles in the joints.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by proposing a specific mechanism for the damage ('creating air bubbles in the joints'). It links the sound to a physical cause of disease.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text repeats a joint health myth. It uses Illusory Correlation to link the popping sound to long-term degenerative disease."
  },
  {
    "id": 415,
    "text": "Deleting WhatsApp messages also deletes them from the recipient's server backup.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by making a technical claim about data management ('deletes them from the recipient's server'). It describes the scope of the delete function.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement misunderstands cloud backups. It demonstrates Illusory Correlation, assuming a local delete action has universal reach."
  },
  {
    "id": 416,
    "text": "Eating curd and fish together causes white spots (vitiligo) on the skin.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The headline relies on the Peripheral route by linking a food combination to a stigmatized visual condition ('white spots'). It appeals to fear and traditional superstition without a mechanism.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example promotes a classic food myth. It uses Illusory Correlation to link a dietary combination to a pigmentation disorder."
  },
  {
    "id": 417,
    "text": "Closing background apps saves battery life and speeds up the phone.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by making a technical optimization claim ('saves battery life', 'speeds up'). It persuades through the logic of resource management.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline misinterprets OS management. It reflects Illusory Correlation, assuming that empty RAM equates to better battery performance (often the opposite is true)."
  },
  {
    "id": 418,
    "text": "Sneezing with your eyes open causes the eyeballs to pop out.",
    "topic": "health",
    "framework1_feature1": 0,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Peripheral route by using grotesque and shocking imagery ('eyeballs to pop out'). It relies on a visceral reaction rather than anatomical logic.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text exaggerates cranial pressure. It uses Illusory Correlation to link the reflex of closing eyes to the structural integrity of the eye sockets."
  },
  {
    "id": 419,
    "text": "Putting a wet phone in rice draws out the water and fixes the circuitry.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by explaining the physical action of the remedy ('draws out the water', 'fixes the circuitry'). It treats rice as a desiccant tool.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement promotes a tech myth. It uses Illusory Correlation, attributing the evaporation of water to the presence of rice rather than time."
  },
  {
    "id": 420,
    "text": "Reading in the dark weakens eyesight permanently.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by asserting a long-term biological consequence ('weakens eyesight permanently'). It links environmental conditions to organ damage.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example links temporary strain to permanent damage. It uses Illusory Correlation to claim low light causes structural eye changes."
  },
  {
    "id": 421,
    "text": "Magnets in iPad covers can stop a pacemaker if held against the chest.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to describe magnetic interference ('Magnets... can stop a pacemaker'). The Peripheral route is activated by the life-or-death threat implied by stopping a pacemaker.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exaggerates magnetic interference. It uses Illusory Correlation to create a life-threatening scenario from consumer electronics."
  },
  {
    "id": 422,
    "text": "Going out with wet hair in winter causes a cold/flu immediately.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "It uses the Central route by proposing a cause-and-effect link between temperature and illness. The Peripheral route is engaged by the 'immediately' claim, creating urgency.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text confuses temperature with viral infection. It employs Illusory Correlation, linking wet hair to the acquisition of a virus."
  },
  {
    "id": 423,
    "text": "Using 5G causes oxygen molecules in the air to vibrate and become unbreathable.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by offering a physics/chemistry explanation ('causes oxygen molecules... to vibrate'). It attempts to sound scientific about air quality.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement invents atmospheric chemistry. It uses Illusory Correlation to claim radio waves alter the breathability of air."
  },
  {
    "id": 424,
    "text": "Eating chocolate causes acne breakouts the next day.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by asserting a specific biological reaction to food ('causes acne breakouts'). It presents a direct dietary cause for a skin condition.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example links diet to skin condition. It uses Illusory Correlation, blaming chocolate specifically for hormonal skin issues."
  },
  {
    "id": 425,
    "text": "Refreshing the desktop multiple times makes the computer run faster.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by making a technical performance claim ('makes the computer run faster'). It suggests the user action has a direct effect on processing speed.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline describes a placebo habit. It relies on Illusory Correlation, assuming the visual refresh action clears memory or speeds up processing."
  },
  {
    "id": 426,
    "text": "Crossing your legs causes varicose veins by blocking blood flow.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by explaining the mechanism of the harm ('blocking blood flow'). It persuades by describing the physiological impact of posture.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links posture to vascular disease. It uses Illusory Correlation to claim that sitting crossed-legged is the direct cause of vein issues."
  },
  {
    "id": 427,
    "text": "Factory reset does not delete data; it just hides it from the user interface.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by describing the technical limitation of a feature ('just hides it from the user interface'). It appeals to the reader's understanding of data persistence.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement misunderstands data erasure. It demonstrates Illusory Correlation by claiming the reset function is purely cosmetic."
  },
  {
    "id": 428,
    "text": "Wearing glasses makes your vision worse over time as the eyes become lazy.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by proposing a biological adaptation ('eyes become lazy'). It argues that the corrective tool causes a decline in natural function.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example claims corrective tools cause dependency. It uses Illusory Correlation to suggest that using glasses degrades natural vision."
  },
  {
    "id": 429,
    "text": "The camera lens on a phone sends data to the manufacturer even when the phone is off.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to describe a technical surveillance capability ('sends data... even when... off'). The Peripheral route is engaged by the paranoid fear of constant monitoring.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline attributes power to a powered-down device. It uses Illusory Correlation to claim surveillance continues without a power source."
  },
  {
    "id": 430,
    "text": "Starving a fever helps cure it faster.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by offering a medical strategy ('Starving a fever helps cure it'). It presents a logical approach to managing illness.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text promotes an old medical saying. It uses Illusory Correlation to suggest that lack of food accelerates immune response."
  },
  {
    "id": 431,
    "text": "A green dot on your phone screen means the camera is recording you secretly.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "It uses the Central route by explaining the meaning of a technical indicator ('means the camera is recording'). The Peripheral route is triggered by the visual cue ('green dot') and the threat of being recorded 'secretly'.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement misinterprets a privacy indicator. It reflects Illusory Correlation, framing the 'camera in use' indicator as proof of unauthorized spying."
  },
  {
    "id": 432,
    "text": "Lifting weights stunts height growth in children.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by asserting a physiological consequence of exercise ('stunts height growth'). It links physical load to developmental changes.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example links exercise to growth plates. It uses Illusory Correlation to claim that compression from weights stops vertical growth."
  },
  {
    "id": 433,
    "text": "Private browsing mode hides your IP address from websites.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by making a technical claim about networking privacy ('hides your IP address'). It appeals to the reader's desire for digital anonymity.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline confuses local privacy with network privacy. It uses Illusory Correlation, assuming browser settings affect network identity."
  },
  {
    "id": 434,
    "text": "Eating spicy food causes stomach ulcers.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by linking a specific food type to internal damage ('causes stomach ulcers'). It presents a biological cause-and-effect argument.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text links spice to tissue damage. It uses Illusory Correlation, attributing ulcers to diet rather than bacterial infection."
  },
  {
    "id": 435,
    "text": "Mac computers are immune to viruses and cannot get hacked.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by making a technical security claim ('immune to viruses'). It asserts a specific capability of the operating system.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement promotes a brand myth. It employs Illusory Correlation, linking the brand name to total invulnerability."
  },
  {
    "id": 436,
    "text": "Applying butter to a burn heals it faster.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by prescribing a medical treatment ('Applying butter... heals it faster'). It argues for the efficacy of a home remedy.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example promotes a dangerous home remedy. It uses Illusory Correlation to suggest that grease soothes thermal injury."
  },
  {
    "id": 437,
    "text": "More megapixels in a camera always means better photo quality.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by linking a technical specification to output quality ('More megapixels... means better photo quality'). It uses technical logic to persuade.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline simplifies imaging science. It uses Illusory Correlation, linking a single spec number directly to output quality."
  },
  {
    "id": 438,
    "text": "Detox teas wash away fat from the intestines.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by describing a mechanical cleansing action ('wash away fat from the intestines'). It visualizes the biological process of weight loss.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text claims a drink can physically wash away fat. It uses Illusory Correlation to create a mechanism of 'washing' internal organs."
  },
  {
    "id": 439,
    "text": "Using a screen protector reduces touch sensitivity significantly.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by claiming a specific hardware degradation ('reduces touch sensitivity'). It appeals to the user's concern about device performance.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement exaggerates the impact of accessories. It relies on Illusory Correlation to claim a thin layer blocks capacitive sensing."
  },
  {
    "id": 440,
    "text": "Muscle turns into fat if you stop working out.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The text employs the Central route by describing a biological transformation ('Muscle turns into fat'). It asks the reader to accept a physiological process of tissue conversion.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example claims tissue transmutation. It uses Illusory Correlation to suggest one tissue type literally transforms into another."
  },
  {
    "id": 441,
    "text": "Emptying the Recycle Bin permanently removes data from the hard drive immediately.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by explaining the technical result of an action ('permanently removes data'). It clarifies the function of the Recycle Bin.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline misunderstands file systems. It demonstrates Illusory Correlation, assuming 'empty bin' means physical data destruction."
  },
  {
    "id": 442,
    "text": "Eating carrots cures blindness.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to claim a medical benefit ('cures blindness'). The Peripheral route is engaged by the miraculous nature of a simple vegetable curing a severe disability.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text exaggerates nutritional benefits. It uses Illusory Correlation to claim a vegetable can reverse a permanent condition."
  },
  {
    "id": 443,
    "text": "Holding your phone up high improves signal strength.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by asserting a technical improvement ('improves signal strength'). It links a physical action to network performance.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement promotes a useless gesture. It reflects Illusory Correlation, linking a small height difference to better network reception."
  },
  {
    "id": 444,
    "text": "Stress causes grey hair overnight.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "It uses the Central route by proposing a biological cause for hair change ('Stress causes grey hair'). The Peripheral route is triggered by the impossible urgency of 'overnight'.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example speeds up a biological process. It uses Illusory Correlation to claim emotion causes instant pigmentation loss."
  },
  {
    "id": 445,
    "text": "Jailbreaking an iPhone allows hackers to access your bank account remotely.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to explain a security vulnerability ('allows hackers to access'). The Peripheral route is activated by the fear of financial loss ('access your bank account').",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline exaggerates the risk of root access. It uses Illusory Correlation to link OS modification directly to financial theft."
  },
  {
    "id": 446,
    "text": "Sugar makes children hyperactive instantly.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The text employs the Central route by describing a physiological reaction ('makes children hyperactive'). The Peripheral route is engaged by the immediacy of the effect ('instantly').",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text repeats the 'sugar rush' myth. It uses Illusory Correlation to link sugar intake to immediate behavioral changes."
  },
  {
    "id": 447,
    "text": "A faster internet plan makes your computer process data faster.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "This uses the Central route by making a technical claim about processing power ('makes your computer process data faster'). It links the internet plan to hardware performance.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The statement confuses bandwidth with processing power. It employs Illusory Correlation, linking internet speed to CPU speed."
  },
  {
    "id": 448,
    "text": "You catch a cold from being in cold weather.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "The headline relies on the Central route by proposing an environmental cause for illness ('catch a cold from... cold weather'). It appeals to a logical cause-and-effect relationship.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The example links temperature to infection. It uses Illusory Correlation, attributing viral illness to ambient temperature."
  },
  {
    "id": 449,
    "text": "Using 'Task Killer' apps saves battery life.",
    "topic": "technology",
    "framework1_feature1": 1,
    "framework1_feature2": 0,
    "rationale1": "It uses the Central route by claiming a technical benefit from software ('saves battery life'). It persuades through the logic of resource optimization.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The headline promotes counter-productive software. It uses Illusory Correlation, assuming that killing tasks manually reduces energy consumption."
  },
  {
    "id": 450,
    "text": "Eating nuts improves brain power instantly.",
    "topic": "health",
    "framework1_feature1": 1,
    "framework1_feature2": 1,
    "rationale1": "The Central route is used to claim a cognitive benefit ('improves brain power'). The Peripheral route is triggered by the promise of 'instantly' gaining ability, acting as a miracle cue.",
    "framework2_feature1": 0,
    "framework2_feature2": 0,
    "framework2_feature3": 1,
    "rationale2": "The text exaggerates the speed of nutritional benefits. It uses Illusory Correlation to claim immediate cognitive enhancement from food."
  }
]